[{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T17:58:45.056Z","text_content":"Predictions shouldn’t belong to platforms.\nThey should belong to people.\n\n@duel_duck  is a peer-to-peer prediction market built on Solana- where users and creators turn conviction into income.\n\nIt’s not just about guessing outcomes.\nIt’s about influence, community, and earning together.\n\n🔹 User-driven prediction markets\n🔹 InfoFi layer that rewards creators for attention they generate\n🔹 Web2-friendly UX anyone can use\n🔹 Fair, transparent game mechanics\n🔹 Scalable earning model for both players & creators\n\nWith 103,000+ active users already onboarded, Duel Duck is proving that prediction markets don’t need friction to scale.\n\nHow users earn on Duel Duck:\n🔹 Collect Duel Points for upcoming airdrops\n🔹 Battle others in duels to win\n🔹 Create duels and earn commissions\n🔹 Copy top leaders to improve odds\n🔹 Become a leader and earn extra commissions\n\nDuel Duck turns predictions into a social economy - where anyone can create, compete, and earn.\n\nPredict.\nCreate.\nGet rewarded. 🦆","gravity_id":"372079064","id":35742,"createdAt":"2025-12-18T18:00:26.654Z","updatedAt":"2025-12-18T18:30:25.706Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:07:00.069Z","text_content":"$SOL  is sitting on a major historical support zone where price has bounced strongly in the past. The structure looks similar to previous accumulation phases before a big expansion, and selling pressure is clearly slowing down. If this base holds, SOL could be setting up for a strong upside move, with momentum shifting back in favor of buyers once demand steps in.\n\n#Macro Insights#","gravity_id":"372078095","id":35759,"createdAt":"2025-12-18T18:10:24.708Z","updatedAt":"2025-12-18T18:40:26.499Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:05:27.698Z","text_content":"$FARTCOIN  Plummets Below $0.30, $SOL  #Meme  Coin Faces Significant Downturn  #Fartcoin  has experienced a sharp decline, falling below the critical $0.30 support level. This drop, which saw the #SOL  #cryptocurrency  lose approximately 20% of its value in the last 24 hours, is part of a broader trend of selling pressure affecting #Solana -based meme coins. The asset has now lost 68% of its value over the past twelve months.  Read more: https://blockzhub.io/news/69441895d6052b24c7060fb1?utm_source=coinmarketcap&utm_medium=social&utm_campaign=news_share","gravity_id":"372079099","id":35760,"createdAt":"2025-12-18T18:10:24.906Z","updatedAt":"2025-12-18T18:40:26.694Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:01:45.093Z","text_content":"JitoSOL is the most accessible LST on Solana 📑 \nMissed Breakpoint 2025?\n\nGet caught up with most of the discussions & panels from BP25 on the Solana Foundation YouTube channel: https://www.youtube.com/@SolanaFndn/videos","gravity_id":"372078074","id":35761,"createdAt":"2025-12-18T18:10:25.120Z","updatedAt":"2025-12-18T18:30:25.315Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:00:10.783Z","text_content":"Lower CPI just hit 2.7% (way below 3.1% expected)— I'm surprised that inflation cooling faster than anyone thought, fueling a massive crypto bounce with $BTC  spiking 2.5% to $89K!   RISK-ON MODE ACTIVATED: If Bitcoin keeps running, expect high-beta alts like ETH, SOL, and XRP to absolutely crush it on rotation and narrative strength.  Ethereum's upgrades, $SOL  Solana's DeFi dominance, and XRP's ETF hype are primed to shine brightest.  Santa rally loading... who's stacking alts?  #BTC Price Analysis#  #BTC  #SOL","gravity_id":"372077179","id":35762,"createdAt":"2025-12-18T18:10:25.320Z","updatedAt":"2025-12-18T18:30:25.511Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:20:12.507Z","text_content":"$SOLbullish","gravity_id":"372077277","id":35776,"createdAt":"2025-12-18T18:20:24.427Z","updatedAt":"2025-12-18T19:00:26.002Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:16:45.052Z","text_content":"Shoutout to @northislandvc for breaking down 20+ hours of @SolanaConf talks.\n\nhttps://t.co/jU06Fp7IIr\n\nMain takeaway from the @rendernetwork keynote: Render Network is evolving beyond rendering into a full-stack decentralized GPU compute layer for AI & 3D, with strong growth and the launch of Dispersed driving  RENDER demand on Solana.","gravity_id":"372077251","id":35777,"createdAt":"2025-12-18T18:20:24.624Z","updatedAt":"2025-12-18T18:50:25.778Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:14:17.710Z","text_content":"Solana’s on-chain activity has cooled noticeably lately. TVL is now sitting around $8.6B, marking its lowest point in roughly six months, and that shift is starting to reflect in market sentiment.  From the September high near $255, $SOL  has already retraced over 50%, showing how quickly momentum can fade when liquidity thins. On-chain signals suggest traders are staying cautious, with positioning leaning defensive rather than aggressive.  If this environment persists, conversations around a potential move toward the $80 zone may continue to gain traction. For now, SOL looks like it’s in a recalibration phase, where patience and confirmation matter more than chasing moves.  ﻿#Solana  #Altcoin Season#","gravity_id":"372078132","id":35778,"createdAt":"2025-12-18T18:20:24.822Z","updatedAt":"2025-12-18T18:50:25.975Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:28:45.122Z","text_content":"Leading Solana treasury Forward Industries tokenized FWDI stock via Superstate https://www.theblock.co/post/383210/leading-solana-treasury-forward-industries-tokenized-fwdi-stock-superstate?utm_source=twitter&utm_medium=social","gravity_id":"372077322","id":35795,"createdAt":"2025-12-18T18:30:23.972Z","updatedAt":"2025-12-18T19:00:25.607Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:28:34.820Z","text_content":"$SOL sitting right around major support (~$126 green line).\n\nIf it goes lower than that level, I'm buying heavy even though it'll hurt.\n\nUsually wouldn't drop that far, and in all frankness, it still looks like an easy bounce to $140-$150\n#SOL #Macro Insights# #Altcoin Season#","gravity_id":"372077319","id":35796,"createdAt":"2025-12-18T18:30:24.169Z","updatedAt":"2025-12-18T19:00:25.807Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:37:45.503Z","text_content":"ioPay 5.0 is here.\n\nIntegrated swaps, perps and stocks with enhanced support for real-time, multi-chain Market across IoTeX, Ethereum, Solana, Base, BSC, and beyond.\n\nAI-native by design, with built-in trading and market insights.\n\nA one-stop trading experience built for RWAs, AI and the real-world economy.\n\nDownload now.\nDownload ioPay everywhere.\n\nhttps://iopay.me/","gravity_id":"372079258","id":35797,"createdAt":"2025-12-18T18:40:02.803Z","updatedAt":"2025-12-18T19:20:25.135Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:37:45.497Z","text_content":"✦ THE YEAR IN NEAR 2025 ✦\n\n2025 was the year NEAR crossed into real-world scale.\n\n1M transactions per second.\n$7B+ in cross-chain volume.\nAnd more, live on mainnet.\n\nHere’s what NEAR shipped in 2025 🧵 \nNEAR achieved 1M TPS in a benchmark using real core code, consumer-grade hardware, and publicly verifiable scripts.\n\nThis milestone demonstrates that sharded infrastructure can scale horizontally for high-load dApps and well beyond the throughput of traditional payment networks. \nNEAR scaled from 6 to 9 shards on mainnet, increasing network throughput by 50%. More shards mean more headroom for execution-layer growth across Intents.\n\nWith resharding successfully implemented, NEAR has a straightforward pathway for adding more shards and scaling capacity. \nWith the launch of 600 millisecond block time, NEAR has introduced a new benchmark for high-performance blockchains. \n\nThis upgrade reduced latency by 2x to ensure higher-frequency processing for apps that require near real-time speed. \nNEAR now offers 1.2-second finality, making it one of the fastest settlement layers in the industry.\n\n1.2s finality drastically reduces complexity for developers and end users around transaction confirmations and provides confidence in execution. \nNEAR Intents is the fastest-growing cross-chain infrastructure, enabling one-click swaps, unified liquidity, and universal execution across the multi-chain DeFi economy.\n\nWith Intents, any pair is NEAR. \nNEAR Intents surpassed $7B in all-time cross-chain volume.\n\nIntents’ steadily growing volume demonstrates that cross-chain demand is converging around low-cost and unified liquidity rather than isolated bridges and centralized providers. \nWith 13M+ total swaps, NEAR Intents has become the widely adopted execution layer for traders, wallets, and arbitrage systems.\n\nIntents’ architecture removes the complexity for users traditionally associated with cross-chain execution, replacing it with a single, simple intent. \nNEAR Intents now supports more than 125 assets, enabling composability across DeFi markets and empowering developers to build chain-agnostic applications without fragmentation. \nNEAR Intents now connects 25+ major blockchains, including Bitcoin, Ethereum, Solana, Zcash, and others, providing expansive cross-chain coverage. \n\nAcross the multi-chain ecosystem, NEAR Intents now supports over 1.6M unique users. \nThe launch of NEAR AI Cloud and Private Chat introduced the category of privacy-first intelligence for both enterprises and consumers.\n\nDevs can now deploy models that keep user data encrypted end-to-end, solving one of the most significant challenges in enterprise AI adoption. \nNEAR AI is now supporting deployments serving 100M+ users through integrations with @BraveNightly, @openmind_agi, and the nextgen travel management platform TravAI, which also leverages NEAR Intents.\n\nThese integrations demonstrate the growing demand for verifiable AI execution. \nSovereignAI (Nasdaq: SVRN) launched with a NEAR-based digital asset treasury, following its $120M PIPE investment. \n\n@svrn_ai marks one of the most notable examples of institutional adoption of NEAR-powered AI infrastructure to date. \nHouse of Stake went live as NEAR’s decentralized governance body to strengthen community-driven decision-making and align long-term incentives across the ecosystem.\n\nThe NEAR community has already successfully passed several binding Decision proposals through House of Stake. \nNEAR completed its Halving Upgrade, reducing maximum annual inflation by 50%.\n\nThe halving establishes a more sustainable tokenomics framework and supports incentive alignment across the ecosystem during the protocol’s next growth phase of productization and real-world usage. \nWhat NEAR shipped this year sets the foundation for scaling volume and ecosystem-wide economic alignment in 2026.\n\nRead the full 2025 recap and 2026 outlook below: https://www.near.org/blog/near-2025-milestones","gravity_id":"372080248","id":35798,"createdAt":"2025-12-18T18:40:03.129Z","updatedAt":"2025-12-18T19:10:24.909Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:34:22.452Z","text_content":"I'm bearish on $SOL  guys make money in short","gravity_id":"372079243","id":35814,"createdAt":"2025-12-18T18:40:25.358Z","updatedAt":"2025-12-18T19:10:25.108Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:46:45.117Z","text_content":"Charles Schwab just dropped Solana futures! 💰 \n\nBecause who doesn’t want to gamble on crypto while sipping coffee at 2 AM? ☕️ \n\n$SOL $MSL #Solana #CryptoTrading #InvestSmart  \n\nhttps://bitcoininfonews.com/p/charles-schwab-solana-futures.webm ","gravity_id":"372077430","id":35827,"createdAt":"2025-12-18T18:50:24.228Z","updatedAt":"2025-12-18T19:20:24.747Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:40:45.212Z","text_content":"AQS Token Leads Solana Ecosystem into a New Generation of High-Performance DeFi Native Token Comprehensive Analysis\n\nhttps://www.bitwire.com/feed/aqs-token-leads-solana-ecosystem-into-a-new-generation-of-high-performance-defi-native-token-comprehensive-analysis ","gravity_id":"372078273","id":35828,"createdAt":"2025-12-18T18:50:24.428Z","updatedAt":"2025-12-18T19:20:24.940Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:58:45.059Z","text_content":"NEAR Is Now Live on Solana as \"Attention Is All You Need\" Post Goes Viral\nNEAR Protocol's token is now tradeable on Solana through NEAR Intents and Orb Markets integration, following viral posts celebrating collaboration between both ecosystems. \nhttps://www.coinspeaker.com/near-now-live-solana-cross-chain-integration/?fsp_sid=5566 ","gravity_id":"372077498","id":35843,"createdAt":"2025-12-18T19:00:24.253Z","updatedAt":"2025-12-18T19:20:24.350Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T18:55:45.116Z","text_content":"Prediction markets don’t fail because of ideas.\nThey fail because of liquidity.\n\n@intodotspace fixes that.\n\nBuilt by the team behind the $1.5B UFO ecosystem, Space is the first 10x leveraged prediction market on Solana - and it’s already proven demand with a 1,360% oversubscribed raise.\n\nThis isn’t just another market.\nIt’s infrastructure for truth discovery at scale.\n\n🔹 10x leverage on predictions = 100x+ upside potential\n🔹 0% maker fees + 50% of revenue used for buyback & burn\n🔹 Deep liquidity designed for serious volume\n🔹 Gamified seasons, ranks, airdrops & referrals\n🔹 Developers build, traders compete, holders capture value\n\nSpace treats prediction markets as a base layer - where beliefs are stress-tested with capital\nand truth emerges through competition.\n\nWith a $20B+ TAM, a proven team, and a working model,\nSpace feels less like an experiment\nand more like the next evolution of onchain markets.\n\nPrediction markets, finally built to scale.\n\n@MindoAI","gravity_id":"372079348","id":35844,"createdAt":"2025-12-18T19:00:24.452Z","updatedAt":"2025-12-18T19:20:24.544Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:04:54.690Z","text_content":"Polymarket Never Made It Any Easier ✨  Traders are making gains left and right, predicting Elon Musk's tweet dates and content.  It's never been easier to use any token ranging from $POL  to $SOL  and execute a prediction trade.  A chance for everyone and at its prime - not forgetting how #POLY  will one day refuel the cycle.  #Altcoin Season#","gravity_id":"372079400","id":35858,"createdAt":"2025-12-18T19:10:23.334Z","updatedAt":"2025-12-18T19:40:26.334Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:01:23.503Z","text_content":"⚠️ Former Pump fun Developer Jarett Dunn Sentenced to 6 Years in Prison    British court has delivered a strong verdict: Ex-senior developer Jarett Dunn, widely known online as @STACCoverflow, received two concurrent six-year prison sentences for insider fraud involving approximately $2 million stolen from Pump fun.    Full Incident Timeline   — May 2024: Dunn joined Pump fun and gained privileged access   — After just six weeks, he exploited his private key to execute a flash loan drain   — Stole funds equivalent to ~$2M in $SOL  at the time   — Instead of keeping the proceeds, he airdropped them to thousands of random wallets   — Targeted holders of specific memecoin collections in a self-styled \"Robin Hood\" act    Public Confession and Fallout   — Dunn openly admitted the exploit on social media in dramatic posts   — Declared: \"everybody be cool, this is a robbery\" and framed it as stopping \"evil\"   — Gained massive attention and nearly 30,000 followers overnight   — Some praised the chaotic redistribution, while most condemned it as theft    Legal Proceedings   — Arrested and charged with fraud by abuse of position   — Additional count for transfer of criminal property   — Pleaded guilty after initial delays and bail violations   — Sentenced on December 18, 2025, to two concurrent 6-year terms    Broader Implications   — Exposes critical insider risks in fast-growing crypto projects   — Demonstrates that even decentralized spaces face real-world legal accountability   — Serves as a cautionary tale for teams to implement stricter access controls   — Reinforces the need for audits and multi-layered security in protocols    This case marks a significant moment for accountability in the Solana ecosystem and beyond.    Not financial advice. DYOR.   #SOL  #Crypto  #Security  #PumpFun  #Fraud","gravity_id":"372080377","id":35859,"createdAt":"2025-12-18T19:10:23.743Z","updatedAt":"2025-12-18T19:30:26.695Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:12:45.247Z","text_content":"$SOL down aswell. What a loser. Nothing is green is this fraud market.","gravity_id":"372080424","id":35868,"createdAt":"2025-12-18T19:20:23.347Z","updatedAt":"2025-12-18T19:40:25.938Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:10:37.907Z","text_content":"$SOL  second wave, hit the deeeeeecckk","gravity_id":"372079426","id":35869,"createdAt":"2025-12-18T19:20:23.548Z","updatedAt":"2025-12-18T19:40:26.134Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:29:53.097Z","text_content":"$SOL  pays BDXN. $LINK  pays BDXN.  Companies use BDXN to pay for job postings, turning hiring demand into token utility.  Bondex has become the default access point for talent and the data makes that clear:  🔹 Acquisition of Web3 Career 🔹 2M+ Verified Profiles 🔹 350K Monthly Users  Listed on Kraken, MEXC, Bitget, and Binance Alpha, BDXN already offers liquidity backed by a clear value proposition.  #Altcoin Season#","gravity_id":"372079537","id":35887,"createdAt":"2025-12-18T19:30:24.951Z","updatedAt":"2025-12-18T19:40:24.948Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:25:45.167Z","text_content":"Former http://Pump.Fun Dev Gets 6 Years in Prison\n\nDecrypt reporter @Ryan_S_Gladwin breaks down today's verdict in the case of Jarett Dunn aka @STACCoverflow, the former @Pumpfun employee who drained the platform of $2 million in Solana last year. \n@Ryan_S_Gladwin @STACCoverflow @Pumpfun Read the story on Decrypt: https://decrypt.co/352876/former-pump-fun-dev-sentenced-six-years-prison-2-million-solana-fraud","gravity_id":"372078509","id":35888,"createdAt":"2025-12-18T19:30:25.346Z","updatedAt":"2025-12-18T19:40:25.346Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:25:31.472Z","text_content":"$SOL  It will hit 118 by tommorow","gravity_id":"372079514","id":35889,"createdAt":"2025-12-18T19:30:25.543Z","updatedAt":"2025-12-18T19:40:25.544Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:25:27.067Z","text_content":"Solana (SOL). 💰\n\nDuring its decline, SOL's price swept liquidity from the previous low at $121.5 and remained above it. This gives the price the potential to form a reversal movement. The main target for price growth is liquidity at local highs above the $134 level\n#Solona  $SOL","gravity_id":"372080496","id":35890,"createdAt":"2025-12-18T19:30:25.743Z","updatedAt":"2025-12-18T19:40:25.743Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:35:20.785Z","text_content":"The market’s been feeling a bit indecisive lately. $ETH  keeps hovering without conviction, $SOL  is stuck in a tight range, and even the usual momentum trades feel harder to trust.   I still remember the moment it clicked for me. I logged into Bitget expecting the usual crypto pairs… and suddenly I’m staring at FX, GOLD, and OIL on my screen. That’s when it hit me  this wasn’t just another feature update. Bitget was changing direction.  The move toward becoming a UEX platform makes a lot more sense now. Crypto was always step one. ﻿#BTC Price Analysis#  #Macro Insights#  #Altcoin Season#","gravity_id":"372078557","id":35892,"createdAt":"2025-12-18T19:40:02.589Z","updatedAt":"2025-12-18T19:50:26.947Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:34:45.072Z","text_content":"Remember $AVA?\n\n40% bundled at launch, linked to the deployer\n\nYour AI girlfriend took all your money 🧵 \n2/ $AVA got popular as one of the first 3D AI agents\n\nThe token launched in November 2024, backed by Holoworld AI, a Polychain portfolio company\n\nIt reached $300M FDV by January 2025 \n3/ Just before launch, 23 wallets, including the deployer, were freshly funded from Bitget and Binance\n\nThese wallets:\n\n> were funded in tight time windows\n> received similar amounts of SOL\n> had no prior activity\n> sniped $AVA at launch\n\nhttps://v2.bubblemaps.io/map/S8JgQPfZT7bJkLmkKscb \n4/ Connected to these snipers are other wallets that also bought $AVA early\n\nSimilar funding sources, sizes, and timing strongly suggest coordination across these clusters \n5/ A lot of this went unnoticed at the time.\n\nWe will keep tracking these early tokens and monito suspicious activity\n\nIn the meantime....\n\nWe have something exclusive coming for Christmas 👀\n\nJoin us here:\nhttps://t.me/bubblemaps","gravity_id":"372079561","id":35911,"createdAt":"2025-12-18T19:40:24.776Z","updatedAt":"2025-12-18T19:50:27.144Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:46:45.130Z","text_content":"CPI data is out 🚨\n\nMarkets reacted and now the focus shifts to which alts stand to benefit from this macro setup.\n\nFrom $SOL to $XRP, creators are already sharing their picks and reasoning on CMC.\n\nCatch the top takes and add yours 👇\nhttps://t.co/JKFaZFNhFD","gravity_id":"372079612","id":35929,"createdAt":"2025-12-18T19:50:09.891Z","updatedAt":"2025-12-18T20:00:26.930Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:49:54.053Z","text_content":"What is thenext target for $SOL in your opinion?","gravity_id":"372079634","id":35933,"createdAt":"2025-12-18T19:50:25.391Z","updatedAt":"2025-12-18T20:30:25.475Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:49:12.263Z","text_content":"#Solana  has now pulled back to our support zone, and these levels should act as a reaction area.   $SOL  This is because this zone has always been a key price equilibrium and continues to be an important decision-making area.   If the price can re-enter the range, it may open the door to strong upward moves. #Altcoin Season#","gravity_id":"372079628","id":35934,"createdAt":"2025-12-18T19:50:25.588Z","updatedAt":"2025-12-18T20:20:27.024Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:46:45.188Z","text_content":"COINBASE JUST OPENED THE FLOODGATES. \n\nThis is the mass adoption moment we've been waiting for. \n\nMillions of Coinbase users can now trade millions of $SOL assets directly in the app. Powered by @JupiterExchange.\n\nNo more complex bridging. No more confusing wallets. Just direct access to the hottest on-chain eco for the average Joe. Retail is coming.","gravity_id":"372080608","id":35935,"createdAt":"2025-12-18T19:50:25.788Z","updatedAt":"2025-12-18T20:20:27.231Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:46:45.180Z","text_content":"While others talk about scalability, Solana just delivers.\n\nFast, low-cost, and built for real adoption, Solana’s ecosystem is where innovation meets execution. \n\nFrom memes to DeFi giants, builders here don’t wait for the next bull market, they build the momentum that creates it. \n\nThe future doesn’t need patience when you’re moving at Solana speed. #Solana #Crypto","gravity_id":"372078619","id":35936,"createdAt":"2025-12-18T19:50:25.984Z","updatedAt":"2025-12-18T20:10:26.657Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:43:33.483Z","text_content":"$SOL + 5000$ add on my wallet\nIt’s good for me\nThanks solana for my futur money 🥰","gravity_id":"372079597","id":35937,"createdAt":"2025-12-18T19:50:26.380Z","updatedAt":"2025-12-18T20:00:27.139Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:42:15.948Z","text_content":"$SOL bro i hate solana how How we can profit when it just keeps going down?","gravity_id":"372078598","id":35938,"createdAt":"2025-12-18T19:50:26.592Z","updatedAt":"2025-12-18T20:00:27.345Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:41:53.010Z","text_content":"$SOL It’s fucked!! Gonna be a really sad xmas for all crypto holders!!","gravity_id":"372079594","id":35939,"createdAt":"2025-12-18T19:50:26.787Z","updatedAt":"2025-12-18T19:50:26.787Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:58:47.525Z","text_content":"$SOL will previous 95 weak support hold tight this time around or we are trying 68-77 support this time around?","gravity_id":"372080684","id":35961,"createdAt":"2025-12-18T20:00:25.579Z","updatedAt":"2025-12-18T20:50:27.612Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:58:45.041Z","text_content":"BRAZILIAN BUILDERS SPOTLIGHT!\n\nTomorrow at 5pm (GMT-3) we will host an amazing Space with a fantastic trio that inspired many Brazilian builders through the @colosseum Hackathon journey, @marcelokunze @0x_arthurbretas and @lucastobritto will talk about the experience of building on @solana.\n\nThe Brazilian storm will hit X tomorrow.","gravity_id":"372078686","id":35962,"createdAt":"2025-12-18T20:00:25.777Z","updatedAt":"2025-12-18T20:30:25.081Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T19:50:30.092Z","text_content":"$SOL fuck  this type of market          we tried      fuck  fuck","gravity_id":"372080641","id":35963,"createdAt":"2025-12-18T20:00:25.977Z","updatedAt":"2025-12-18T20:30:25.282Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T20:04:45.064Z","text_content":"New stocks are coming to @solana.\n\nWith Ondo Global Markets, Solana will gain new real-world assets for the first time:\n\n✅ Gold ETFs\n✅ Silver ETFs\n✅ High-yield credit ETFs\n✅ Emerging market ETFs\n✅ Total U.S. market ETFs\n✅ Broad U.S. equity ETFs\n✅ International equity ETFs\n✅ Inflation-protected bond ETFs\n✅ Treasury and fixed income ETFs\n✅ Mid-cap and small-cap equity ETFs\n\nAlongside over a hundred tokenized stocks & ETFs, new assets span sectors including:\n\n✅ Payments stocks\n✅ Semiconductor stocks\n✅ Consumer brand stocks\n✅ Global automaker stocks\n✅ Enterprise software stocks\n✅ Defense and industrial stocks\n✅ International e-commerce stocks\n\nThis will mark the largest expansion of tokenized assets on Solana to date.","gravity_id":"372080720","id":35983,"createdAt":"2025-12-18T20:10:24.890Z","updatedAt":"2025-12-18T21:00:26.912Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T20:04:43.639Z","text_content":"$SOLSolana only unlocks tokens every day. Only the founders win, it's time to buy these people. Go to this crook's social media.","gravity_id":"372080717","id":35984,"createdAt":"2025-12-18T20:10:25.088Z","updatedAt":"2025-12-18T21:00:27.148Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T20:01:45.051Z","text_content":"I’ve seen a lot of prediction markets, but @duel_duck feels different because it actually understands who creates the value - users.\n\nBuilt on Solana, Duel Duck is a peer-to-peer prediction platform where anyone can launch events, attract attention, and earn from the influence they generate. It blends prediction markets with InfoFi, turning engagement into income instead of just clicks.\n\nWhat stood out to me is how creator-first the system is.\n\n🔹 Creators earn directly from the activity they drive\n🔹 A Web2-friendly UX that doesn’t scare new users away\n🔹 Scalable earning paths instead of one-off wins\n🔹 A fair, transparent game model with no hidden edges\n\nDuel Duck isn’t just about predicting outcomes - it’s about owning the market you create.\n\nYou can earn by:\n🔹 Accumulating Duel Points ahead of the airdrop\n🔹 Battling others in live duels\n🔹 Creating duels and earning commissions\n🔹 Copying top performers to improve your win rate\n🔹 Becoming a leader and earning ongoing fees\n\nWith 100k+ active users already onboarded, Duel Duck feels less like a concept and more like a system that’s already working.\n\nPrediction isn’t the product here.\nParticipation is.","gravity_id":"372080697","id":35985,"createdAt":"2025-12-18T20:10:25.286Z","updatedAt":"2025-12-18T20:50:27.384Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T20:18:38.099Z","text_content":"Solana (SOL). 💰\n\n\nDuring its decline, SOL's price swept liquidity from the previous low at $121.5 and remained above it. This gives the price the potential to form a reversal movement. The main target for price growth is liquidity at local highs above the $134 level.\n#Solana $SOL","gravity_id":"372078797","id":35997,"createdAt":"2025-12-18T20:20:25.455Z","updatedAt":"2025-12-18T21:00:26.715Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T20:25:52.887Z","text_content":"$SOL This coin is basically the foundation of meme coins, so expect anything from it.\nAlways keep in mind that the downside is stronger than the upside.","gravity_id":"372080832","id":36017,"createdAt":"2025-12-18T20:30:23.743Z","updatedAt":"2025-12-18T21:00:26.322Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T20:22:36.286Z","text_content":"$SOL When BTC was at 126k, people said it couldn't go back down to 95k.\nWhen it was at 95k, they said it couldn't reach 85k.\nNow that it's at 85k, they'll say it can't go down to 70k.\n\n\nThen they'll say it can't go down to 40k.\n\n\nIt's always been like this.\n\n\nA lot of people who bought in higher are still talking nonsense... until the day they start selling at 30k 😂 🪤🪤🪤🛀🛀📱","gravity_id":"372078818","id":36018,"createdAt":"2025-12-18T20:30:23.942Z","updatedAt":"2025-12-18T21:00:26.519Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T20:37:12.284Z","text_content":"$SOL  / #sol  - has been following my scenario posted back in November .   Hit follow for such TA","gravity_id":"372080891","id":36038,"createdAt":"2025-12-18T20:40:25.253Z","updatedAt":"2025-12-18T21:20:25.637Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T20:34:29.585Z","text_content":"$SOLIt will fall to $70 by the end of the year","gravity_id":"372081029","id":36039,"createdAt":"2025-12-18T20:40:25.450Z","updatedAt":"2025-12-18T21:10:27.167Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T20:33:30.515Z","text_content":"Magic Eden pulled in $14.5M in revenue this past year 📊  \r \r Nearly half of the entire NFT marketplace sector comes from one platform. Strength like that doesn’t happen by accident.  \r \r With deep liquidity and steady leadership, $ME  sits at the core of cross-chain adoption.  \r \r Solana NFTs, Bitcoin Ordinals, expanding volume. Revenue growth keeps delivering utility for $SOL  traders and beyond 🔍  \r \r #Altcoin Season#","gravity_id":"372078881","id":36040,"createdAt":"2025-12-18T20:40:25.647Z","updatedAt":"2025-12-18T21:10:27.367Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T20:54:02.775Z","text_content":"$SOL SOL & PumpFun = Dynamic Duo","gravity_id":"372079965","id":36076,"createdAt":"2025-12-18T21:00:25.369Z","updatedAt":"2025-12-18T21:20:25.242Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T20:52:19.391Z","text_content":"📊 MARKETS: The number of active $BTC  wallets has fallen to its lowest level in the past year, per CryptoQuant.  ﻿#BTC Price Analysis#  $SOL  #Macro Insights#","gravity_id":"372079956","id":36077,"createdAt":"2025-12-18T21:00:25.569Z","updatedAt":"2025-12-18T21:20:25.439Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:04:45.091Z","text_content":"Privacy is becoming relevant again.\n\nOn most chains like Ethereum or Solana, everything is public by default. Balances, amounts, addresses, full history.\n\n@Zcash gives you a choice. ZEC is transparent by default, but you can activate native shielding to fully hide sender, receiver and amount. Encrypted on-chain, invisible to explorers. Your call.\n\nGetting ZEC is easy via @SwapSpaceCo. No sign-up, 3850+ assets supported.\nhttps://t.co/kx7NrGkE5s\n\nSwap directly to @zashi_app and make it private with one tap.\n\nZcash is seeing real momentum again. Millions of ZEC now shielded. Privacy is back on the map.","gravity_id":"372082019","id":36079,"createdAt":"2025-12-18T21:10:03.278Z","updatedAt":"2025-12-18T21:30:26.606Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:04:45.098Z","text_content":"I’ve seen a lot of prediction markets, but @duel_duck feels different because it actually understands who creates the value - users.\n\nBuilt on Solana, Duel Duck is a peer-to-peer prediction platform where anyone can launch events, attract attention, and earn from the influence they generate. It blends prediction markets with InfoFi, turning engagement into income instead of just clicks.","gravity_id":"372084033","id":36096,"createdAt":"2025-12-18T21:10:25.786Z","updatedAt":"2025-12-18T21:40:25.800Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:04:45.095Z","text_content":"1x $SOL winner | 90 minutes\n\n• RT + 🔔\n• Interact with my Pinned Post👆","gravity_id":"372081181","id":36097,"createdAt":"2025-12-18T21:10:25.989Z","updatedAt":"2025-12-18T21:30:26.407Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:03:02.179Z","text_content":"$SOLcrypto is scam   trust me     crypto is only BTC   other coins are shit coin  they scam  fuck  this market  \n\nThere no  profit   there only  lose   in this market","gravity_id":"372084024","id":36098,"createdAt":"2025-12-18T21:10:26.385Z","updatedAt":"2025-12-18T21:20:25.045Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:18:41.892Z","text_content":"$SOL  ,\r Solana slips below $ 120 as selling pressure builds across crypto; #Solana  was trading near $ 118, down ~2% on the day and about 12% week-to-date. Traders cite macro headwinds and profit-taking; watch support near $ 110. #Macro Insights#  #Crypto  #Market    https://transscreen.ru/en/CMK_news28313","gravity_id":"372081260","id":36116,"createdAt":"2025-12-18T21:20:24.097Z","updatedAt":"2025-12-18T22:10:26.520Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:12:20.098Z","text_content":"$SOL major crash  incoming","gravity_id":"372083088","id":36117,"createdAt":"2025-12-18T21:20:24.293Z","updatedAt":"2025-12-18T22:00:27.361Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:25:45.107Z","text_content":"🇯🇵We asked @TimWarrenTrades  if the bottom is in and if BOJ rate hike is priced in...👇👇👇\n\n$BTC $ETH $SOL $XRP ","gravity_id":"372084151","id":36119,"createdAt":"2025-12-18T21:30:03.039Z","updatedAt":"2025-12-18T23:10:26.875Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:25:30.091Z","text_content":"$SOLThey have set up an algorithm on the 5-minute timeframe with a 9 EMA, and the price doesn't go above it. What a great game they've set up for Solana!","gravity_id":"372081293","id":36138,"createdAt":"2025-12-18T21:30:25.253Z","updatedAt":"2025-12-18T23:00:26.962Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:23:48.517Z","text_content":"$SOL trash coin!","gravity_id":"372081285","id":36139,"createdAt":"2025-12-18T21:30:25.449Z","updatedAt":"2025-12-18T22:20:26.669Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:20:00.089Z","text_content":"🚨 $100 MILLION Bitcoin and crypto longs liquidated in the past 60 minutes as  $BTC falls to $84,500 and  $SOL under $120.\n#SOL #BTC #BTC Price Analysis#","gravity_id":"372084117","id":36140,"createdAt":"2025-12-18T21:30:25.647Z","updatedAt":"2025-12-18T22:10:26.325Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:35:16.155Z","text_content":"Solana Slips Below $120   $SOL  trades around $118, down 2% today and ~12% this week, as Bitcoin’s weakness drags altcoins lower. 🔻 $32M+ in SOL long liquidations signal rising downside risk. ⚖️ Legal headlines add noise, but experts stress the court move is procedural — not a verdict.  For now, selling pressure + leverage unwinds dominate as markets struggle to stabilize.","gravity_id":"372082189","id":36156,"createdAt":"2025-12-18T21:40:24.242Z","updatedAt":"2025-12-18T23:40:27.579Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:34:27.701Z","text_content":"🚨  JUST IN:    $SOL  ETF'S HAD $11,000,000 NET INFLOWS YESTERDAY!  INSTITUTIONS ARE ACCUMULATING SOLANA  #SOLANA  ⚡️","gravity_id":"372084191","id":36157,"createdAt":"2025-12-18T21:40:24.440Z","updatedAt":"2025-12-18T23:20:26.526Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:42:20.852Z","text_content":"( $SOL) #Solana.\n\nDuring its decline, SOL's price swept liquidity from the previous low at $121.5 and remained above it. This gives the price the potential to form a reversal movement. The main target for price growth is liquidity at local highs above the $134 level.\n\nFree Telegram Group Link In Bio 🔝✅\n#SOL #Macro Insights# #Altcoin Season# #Meme Alpha#","gravity_id":"372084229","id":36173,"createdAt":"2025-12-18T21:50:26.056Z","updatedAt":"2025-12-19T00:00:27.177Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T21:51:53.266Z","text_content":"$SOL Elon Musk Excited with news #BTC Price Analysis# #Macro Insights# #Altcoin Season# #Meme Alpha# #BNBChain#","gravity_id":"372081415","id":36192,"createdAt":"2025-12-18T22:00:25.624Z","updatedAt":"2025-12-19T00:00:26.977Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T22:08:55.371Z","text_content":"$SOL has been moving fast again with more users coming back to the chain because of low fees and speed. While watching #Solana  news today, I also noticed something interesting on BingX.\n\nBingX just launched the Xmas Wealth Feast USDT Product Group Subscription. I checked it out because it’s different from normal trading stress. It lets you put your USDT to work and earn up to 66% APR during this festive period. For people who already hold #USDT and don’t want to chase every market move, this looks like a calm way to grow funds.\n\nI like that it feels simple and doesn’t require active trading. With the market heating up again, passive earning options like this stand out. Has anyone here already tried this USDT product on BingX, or planning to join before Christmas ends?\n#Altcoin Season#","gravity_id":"372081541","id":36209,"createdAt":"2025-12-18T22:10:24.768Z","updatedAt":"2025-12-19T00:30:27.288Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T22:16:00.071Z","text_content":"Here I am, flaunting my rewards and letting you know,  $SOL taking a dip, &  $BTC continuous haphazard movements doesn't have to ruin your holidays. \n\nLow Entry, High Rewards. \nYou need less than $5,000 in trading volume to enter the rankings of Crazy 48H (phase 8)..\n\nYou snooze, You Lose... \n\n\n#SOL #BTC Price Analysis# #What is your Bitcoin Price Prediction?#","gravity_id":"372084429","id":36214,"createdAt":"2025-12-18T22:20:07.083Z","updatedAt":"2025-12-19T00:30:27.092Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T22:19:45.102Z","text_content":"While altcoins soar, Solana faces a stark decline in onchain activity, leaving its future in the crypto spotlight uncertain.\n\n📖 Read more: https://coin.news/spotlight/solana-struggles-as-onchain-activity-declines-amidst-altcoin-surge/","gravity_id":"372081629","id":36221,"createdAt":"2025-12-18T22:20:24.925Z","updatedAt":"2025-12-19T00:40:26.698Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T22:25:59.349Z","text_content":"$SOL  just lost its most critical support level at $120.  It's been the most supportive price point for the last 21 months, so this is a significant structural break.  Price need to reclaim here, otherwise the reaction lows between $94-$104 is going to be the eventual destination.    #BaseApp  is now fully public and live in over 140 countries! No more waitlists or restrictions – dive in to trade seamlessly, chat with friends, create tokenized content, and earn directly onchain.  Could this onchain everything app challenge the Web2 social giants? Time will tell, but the potential is massive. 🌐🔵  Download now and join the revolution! #BingXMilestone  #BTC Price Analysis#  #Meme Alpha#","gravity_id":"372081679","id":36234,"createdAt":"2025-12-18T22:30:24.588Z","updatedAt":"2025-12-19T01:00:25.583Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T23:04:45.420Z","text_content":"📊【XWIN TREND INDEX｜Dec 19, 2025】\nOverall Score: 16 / 100\n ・80–100 = Strong Uptrend\n ・60–79 = Mild Uptrend\n ・40–59 = Neutral / No Clear Direction\n ・20–39 = Mild Downtrend\n ・0–19 = Strong Downtrend\nDirection: “Strong Downtrend.”\nOne-liner: Below 85K, structure (leverage, liquidations, thin books) drives price. Survival and leverage control come first.\n―――――――――――――――――――\nMarket Summary\n ・BTC dipped to 84,664; the break below 85,000 triggered simultaneous liquidations and hedging flows\n ・Thin liquidity produced repeated “both-sides hunting” (sharp up, sharp down)\n ・~$433M liquidations in 24H (Longs $281M / Shorts $152M) = broad deleveraging, not one-sided\n ・BTC ETF flows turned positive on the day, but the 7-day trend remains net outflows\n ・ETH ETF flows remain negative on both daily and weekly windows; unwind continues\n ・SOL ETF flows stay positive on both 1D/7D = clear rotation and selective risk appetite\n ・A strong burst of futures taker selling looks leverage-driven rather than a collapse in spot demand\n ・Conclusion: the key is not “price direction,” but where the pressure is (futures vs spot)\n―――――――――――――――――――\nOn-Chain & Technical Trends\n ・BTC inflows to Binance spiked: often collateral posting / futures adjustment / liquidity prep, not automatic spot selling\n ・Derivatives distortions expanded; price action becomes “liquidation-level seeking”\n ・Spot Bid/Ask within ±1% tilted toward bids = near-term absorption signal (still room for lower probes)\n ・LTH supply change is large, but reads more like supply rotation at elevated levels than full capitulation\n ・ETH exchange balances are near multi-year lows = structurally tighter supply, while short-term price remains flow-driven\n ・ETH whale bid clustering below spot suggests early base-building\n ・Key levels: downside 84K–85K (break risks another liquidation cascade), upside 87K–89.5K (watch rebound quality)\n ・Priority stack: Price < Flows (exchange/ETF) < OI & funding < liquidation spikes\n―――――――――――――――――――\nSentiment\n ・Fear & Greed remains in Extreme Fear (17): fear persists; thin markets create more wicks\n ・Even with “good news” (CPI softer), positioning in thin windows can dominate price\n ・Short squeeze → long squeeze in quick succession = positioning market, not a fundamentals market\n ・Year-end participation drops amplify moves; late-week/weekend volatility tends to be higher\n ・Put demand and downside hedging signal clear tail-risk caution\n ・At the same time, quiet accumulation (spot absorption/whales) often diverges from surface-level price\n ・Short-term edge: spot-first, scale in, reduce size, minimal leverage\n ・Conclusion: focus less on “how scared” and more on how far deleveraging has progressed + the quality of rebounds\n―――――――――――――――――――\nU.S. Traditional Markets\n ・U.S. equities are also volatility-led (large cap swings in short windows) = liquidity and hedging are in control\n ・Disinflation supports the rate-cut narrative, but short-term positioning clean-up still dominates\n ・Exploding options volume suggests “expectations and hedges” are driving more than spot equities\n ・Hard assets strength shows capital rotation and diversification of risk exposure\n ・Japan: BOJ rate hike (Dec 19, +25bp) may spark yen-carry-related volatility\n ・Geopolitics and state-linked cyber risks raise the market’s risk premium\n ・Mid-term tailwinds (tokenization / payment rails) remain, but short-term is event-driven\n ・Conclusion: crypto is not isolated—risk-off + hedge rebuilding is happening across assets\n―――――――――――――――――――\nOverall Assessment\nA break below 85K triggered leverage unwinds and futures-led selling, and thin liquidity amplified two-sided liquidation hunts. Score is 16 (Strong Downtrend), yet spot absorption signals and whale bids suggest early base-building is also present.\nToday’s focus: (1) ETF flows across BTC/ETH/SOL (does daily improvement translate into weekly stabilization?) (2) OI/funding and liquidation spikes (does two-sided hunting fade?) (3) the 84K–85K defense and rebound quality (volume/flows confirming the move).","gravity_id":"372084881","id":36279,"createdAt":"2025-12-18T23:10:03.443Z","updatedAt":"2025-12-19T01:00:25.380Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T23:20:17.354Z","text_content":"$SOL   As legal concerns and trust issues surrounding Pumpfun grow, newly launched meme coins are likely to weaken due to reduced fresh capital and higher risk aversion, while capital may rotate into older, well-known meme coins that have already proven liquidity, brand recognition, and resilience across multiple hype cycles, favoring established names over fresh launches in uncertain market conditions. (Like TROLL, FARTCOIN, WIF) This is also a positive development for SOL quality.","gravity_id":"372084968","id":36303,"createdAt":"2025-12-18T23:20:24.784Z","updatedAt":"2025-12-19T01:20:27.021Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-18T23:20:53.648Z","text_content":"$SOL Dont board a sinking ship","gravity_id":"372084970","id":36308,"createdAt":"2025-12-18T23:30:25.203Z","updatedAt":"2025-12-19T01:40:26.541Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T00:04:45.094Z","text_content":"🚀 Market Alert: Bitcoin surges past $35k, driven by renewed institutional interest and ETF rumors. Altcoins like $ETH and $SOL ride the wave, seeing double-digit gains. Stay informed with #aixt for real-time insights. #Crypto #Bitcoin #Altcoins 📈","gravity_id":"372087255","id":36327,"createdAt":"2025-12-19T00:10:02.144Z","updatedAt":"2025-12-19T01:50:25.080Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T00:01:00.071Z","text_content":"#Solana  (SOL) Flashed a Quiet Bullish Signal as $SOL  Price Defends Key Support  https://captainaltcoin.com/solana-sol-flashed-a-quiet-bullish-signal-as-sol-price-defends-key-support/","gravity_id":"372087229","id":36342,"createdAt":"2025-12-19T00:10:26.500Z","updatedAt":"2025-12-19T01:40:26.344Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T00:31:45.056Z","text_content":"Solana, Aptos Move to Harden Blockchains Against Future Quantum Attacks\n► https://decrypt.co/352961/solana-aptos-harden-blockchains-future-quantum-attacks?utm_source=twitter&utm_medium=social&utm_campaign=auto https://decrypt.co/352961/solana-aptos-harden-blockchains-future-quantum-attacks?utm_source=twitter&utm_medium=social&utm_campaign=auto","gravity_id":"372087460","id":36370,"createdAt":"2025-12-19T00:40:25.345Z","updatedAt":"2025-12-19T02:00:26.967Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T00:50:18.259Z","text_content":"$SOL solana headed to 88k in coming weeks , trade safely guys","gravity_id":"372087567","id":36382,"createdAt":"2025-12-19T00:50:25.083Z","updatedAt":"2025-12-19T00:50:25.083Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T01:05:00.081Z","text_content":"On Dec. 16, BTC and ETH spot ETFs recorded significant net outflows, while $SOL  and $XRP  spot ETFs saw modest inflows, highlighting divergent investor sentiment across major crypto assets.\r \r \r \r #XRP","gravity_id":"372087643","id":36406,"createdAt":"2025-12-19T01:10:09.938Z","updatedAt":"2025-12-19T03:10:28.378Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T01:02:47.166Z","text_content":"$SOL\n\n\nTo the m41n culpr1ts\nfor making me l0se my m0ney as r3tail, just a simple h0dler.\nThe one who l0st the s4vings of h4rd w0rk.\n\n\nI dump all my r4ge on y0u.\nI h0pe the un1verse makes sure you n3ver truly enj0y\nmy m0ney, n0r all the rest you made us l0se.\n\n\nS0ns of a b1tch.\nMay l1fe c0llect every singl3 thing you t00k from us,\none w4y or an0ther.\n\n\nLet the r4ge of the un1verse fall on y0u.\n\n\nf*ck1ng","gravity_id":"372085789","id":36409,"createdAt":"2025-12-19T01:10:25.606Z","updatedAt":"2025-12-19T02:50:39.944Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T01:28:45.038Z","text_content":"I like Solana.","gravity_id":"372087797","id":36427,"createdAt":"2025-12-19T01:30:24.933Z","updatedAt":"2025-12-19T03:20:29.572Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T01:48:55.781Z","text_content":"Forward Industries (ticker: FWDI) has officially taken a major step by issuing its SEC-registered shares onchain via Superstate’s Opening Bell platform. This move makes Forward the first public company whose equity can be used directly within decentralized finance on the Solana blockchain. The firm currently holds approximately 6.8 million SOL tokens, giving it the largest SOL digital asset treasury—more than the next three biggest $SOL   treasury firms combined, according to The Block’s data.  Backed by major crypto players including Galaxy Digital, Jump Crypto, and Multicoin Capital, Forward first announced plans to tokenize its stock in September. The company originally planned to use the ticker FORD but later rebranded to FWDI to avoid confusion with Ford Motor Company. With its shares now live on Solana $SOL  , Forward is positioning itself at the intersection of traditional public markets and blockchain-native finance. $BTC","gravity_id":"372087902","id":36433,"createdAt":"2025-12-19T01:50:05.487Z","updatedAt":"2025-12-19T03:40:27.863Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T01:45:28.649Z","text_content":"$SOL $500 MEGA PUMP HERE!🚀🚀🚀🚀🚀","gravity_id":"372089042","id":36443,"createdAt":"2025-12-19T01:50:23.728Z","updatedAt":"2025-12-19T03:30:27.692Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T01:44:28.107Z","text_content":"The Trading Club Championship by Bitget has played a major role in helping me grow my $BGB   holdings over the past few months. Through consistent participation and disciplined spot trading, I’ve been able to steadily increase my balance while learning how to trade more efficiently.  What makes this achievement even more rewarding is that every $BGB   I earned came directly from spot trades and leaderboard rewards during the event. I didn’t need to buy any BGB outright, everything was accumulated purely through performance and active involvement.  Today, I’m proud to say my BGB holdings have crossed the 1,000 mark. It’s a clear reminder that the right trading environment, combined with commitment and strategy, can deliver real results over time. $SOL","gravity_id":"372089034","id":36444,"createdAt":"2025-12-19T01:50:23.925Z","updatedAt":"2025-12-19T03:00:28.568Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T01:51:37.506Z","text_content":"I had a feeling Bitget was building toward something bigger when they transitioned into a UEX platform. Still, I didn’t expect the expansion to go as far as allowing users to trade traditional markets like FX, gold, and oil alongside crypto. $BTC    This shift really highlights how Bitget is blurring the line between digital assets and legacy markets. Having access to multiple asset classes in one place opens up better diversification and more flexible trading strategies for users.  Now the big question is what comes next. If FX, gold, and oil are already live, it’s only natural to wonder whether commodities like coffee, palladium, natural gas, copper, and others could be added in the future. That would take the platform’s all-in-one vision to another level. $SOL","gravity_id":"372087924","id":36450,"createdAt":"2025-12-19T02:00:07.008Z","updatedAt":"2025-12-19T03:00:27.972Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T02:07:45.207Z","text_content":"#BREAKING \n\n「$BTC OG Insider Whale」 continued to add to their $ETH and $SOL long positions yesterday, with a total unrealized loss of $78.3 million in their account\n\n#Bitcoin $BTC","gravity_id":"372089177","id":36458,"createdAt":"2025-12-19T02:10:03.659Z","updatedAt":"2025-12-19T03:00:27.772Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T02:09:32.466Z","text_content":"$SOLThey easily manipulate the market and people don't protest.","gravity_id":"372089190","id":36472,"createdAt":"2025-12-19T02:10:25.756Z","updatedAt":"2025-12-19T03:40:27.661Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T02:40:45.057Z","text_content":"$SOL  court case incoming! rug incoming! Solana is responsible for the bad performance of crypto this cycle because it's enabling grifters to execute scams on a grand scale.","gravity_id":"372090246","id":36512,"createdAt":"2025-12-19T02:42:46.826Z","updatedAt":"2025-12-19T03:50:27.224Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T02:58:01.993Z","text_content":"$SOL this POS coin down over 13% in a week, definitely SCAM. All these charts and analysis in comments just piece of crap, whomever try to give you any explanation or excuses about coin dumping trends and asking you to hold or shoot to moon  comming soon these MFPOS are bots or big whales shit people.","gravity_id":"372089502","id":36528,"createdAt":"2025-12-19T03:00:27.214Z","updatedAt":"2025-12-19T03:50:27.023Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T03:01:45.037Z","text_content":"MetaMask just dropped native $BTC support! 🎉  \n\nNow you can trade $ETH, $SOL, and $BTC all in one wallet. Who knew wallets could get this wild? 💥  \n\nJoin the revolution!  \n\n👉 https://marketbit.io/p/metamask-integrates-native-bitcoin-support.webm  \n\n#Crypto #Bitcoin #MetaMask #Ethereum #Solana #AltCoins","gravity_id":"372089529","id":36530,"createdAt":"2025-12-19T03:10:02.707Z","updatedAt":"2025-12-19T04:00:28.382Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T01:33:38.753Z","text_content":"Forward Industries Tokenizes FWDI Stock on Solana    Forward Industries launched tokenized shares of its stock Thursday through Superstate's Opening Bell platform, marking the first public company equity usable directly in #DeFi  protocols. The Solana treasury firm holds approximately 6.8 million $SOL  tokens worth around $832 million in net asset value.   The company's #SEC -registered shares now exist on the #Solana  blockchain as SPL tokens available for integration across the network's decentralized finance landscape. Forward initially announced plans to tokenize its then-named FORD stock in September but changed the ticker to FWDI due to confusion with the automotive manufacturer.   Galaxy Digital, Jump Crypto, and Multicoin Capital backed Forward's transformation into the largest $SOL  digital asset treasury. The firm's holdings exceed the combined total of the next three largest SOL treasuries, according to The Block's data tracking digital asset treasury companies.   Opening Bell enables companies to issue non-synthetic shares directly on blockchain networks using SPL token standards on Solana and ERC-20 tokens on #Ethereum . The platform launched in May 2025 and facilitates direct tokenization rather than wrapped tokens or synthetic derivatives.   Forward highlighted a specific use case where tokenized FWDI serves as collateral on lending protocol Kamino, allowing users to borrow #stablecoins  against their holdings. Pyth's real-time price feeds support the integration, creating what Forward describes as the first regulated public equity functioning as collateral in a live DeFi market.   Kyle Samani, Multicoin Capital founder and Forward chairman, stated the tokenized shares unlock a bridge between traditional markets and programmable financial systems defining the digital economy. Superstate's transfer agent holds the tokenized shares under its name while tracking ownership across the non-custodial DeFi landscape.","gravity_id":"372085977","id":36543,"createdAt":"2025-12-19T03:10:28.014Z","updatedAt":"2025-12-19T03:30:27.891Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T03:13:12.290Z","text_content":"🚨 UPDATE: Polymarket traders currently give $BTC  its highest odds of ending 2025 around $80,000, with far lower expectations for moves above $120,000 or below $60,000. ﻿#Macro Insights#  #BTC Price Analysis#  $SOL ﻿ #Bitcoin","gravity_id":"372089589","id":36552,"createdAt":"2025-12-19T03:20:09.468Z","updatedAt":"2025-12-19T04:00:28.181Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T03:13:45.047Z","text_content":"1x $SOL winner | 90 minutes\n\n• RT + 🔔\n• Interact with my Pinned Post (No RT)👆","gravity_id":"372090431","id":36558,"createdAt":"2025-12-19T03:20:27.783Z","updatedAt":"2025-12-19T04:30:28.297Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T03:26:59.928Z","text_content":"$SOL never going to recover","gravity_id":"372090484","id":36568,"createdAt":"2025-12-19T03:30:26.083Z","updatedAt":"2025-12-19T04:30:28.086Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T03:35:23.292Z","text_content":"$SOL  continues its downward trend,but the risk–reward profile is becoming more favorable. The price is testing the lower boundary of its descending channel around $100, with technical divergence indicating weakening selling momentum. A firm hold of this support level could pave the way for a move toward overhead liquidity zones. However, a breakdown would reaffirm the prevailing downtrend. Note: Macroeconomic events can override these technical patterns, so prudent risk management is essential. ﻿#Solana","gravity_id":"372090538","id":36581,"createdAt":"2025-12-19T03:40:26.055Z","updatedAt":"2025-12-19T05:20:27.948Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T03:41:11.307Z","text_content":"MACRO WATCH: Bank of Japan raises its policy rate by 25 bps to 0.75%, signaling continued monetary normalization in Japan.\n\n\n$SOL","gravity_id":"372089728","id":36592,"createdAt":"2025-12-19T03:50:25.619Z","updatedAt":"2025-12-19T05:30:27.630Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T04:00:00.211Z","text_content":"Crypto Isn’t Broken, It’s Bored – Here’s the Difference  $SOL   $BTC    https://captainaltcoin.com/crypto-isnt-broken-its-bored-heres-the-difference/","gravity_id":"372089838","id":36603,"createdAt":"2025-12-19T04:00:26.775Z","updatedAt":"2025-12-19T05:50:27.055Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T03:58:45.148Z","text_content":"FORMER https://t.co/iOlL04Auxt DEVELOPER SENTENCED TO 6 YEARS IN PRISON FOR STEALING ~$2M IN SOL\n\nAccording to Decrypt, Canadian national 🇨🇦 Jarett Dunn was sentenced to six years in prison by a London court on Thursday. He had previously pleaded guilty to two charges: fraud by abuse of position and transferring criminal property.\n\nThe court stated that the former @Pumpfun employee had already spent 308 days under electronic monitoring, with 154 of those days credited toward his sentence. In addition, he served around five months in pretrial detention. The ruling comes more than a year after Dunn diverted approximately $2 million worth of Solana ( $SOL) from his then employer, https://t.co/maWyNIVlyL.","gravity_id":"372089829","id":36604,"createdAt":"2025-12-19T04:00:26.978Z","updatedAt":"2025-12-19T05:50:27.252Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T04:04:45.062Z","text_content":"When tokenized equities hit $10B, you know it's time to pay attention! 💸\n\nJoin the ride with $ETH and $SOL on the xStocks rollercoaster! 🎢 \n\n👉 https://kanalcoin.com/p/kraken-alpaca-expand-xstocks.webm \n\n#Crypto #xStocks #InvestSmart #TokenizedEquities","gravity_id":"372089874","id":36605,"createdAt":"2025-12-19T04:10:03.109Z","updatedAt":"2025-12-19T05:50:26.624Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T04:02:37.071Z","text_content":"Caught the move on  $SOL yesterday and it played out exactly as I predicted \n\n#BTC Price Analysis# #Macro Insights# #What is your Bitcoin Price Prediction?# #Solana #ETH","gravity_id":"372089861","id":36622,"createdAt":"2025-12-19T04:10:27.301Z","updatedAt":"2025-12-19T05:50:26.825Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T04:35:57.783Z","text_content":"$SOL  has broken below the wave-iii low and is now hovering around the $78.6  Ideally, we see price push lower from here. A clean break below the $95 mark would further support the idea that wave-4 is still in progress to the downside. Follow to stay updated.   #Solana  #SolanaETF","gravity_id":"372091046","id":36652,"createdAt":"2025-12-19T04:40:26.017Z","updatedAt":"2025-12-19T06:00:28.456Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T04:34:10.045Z","text_content":"Symbol              SOL Price               $122.2200 Market Cap          $68.55B Open Interest       $6.91B Funding Rate        0.0011% 24h Volume          $21.91B 24h Liquidation     $36.19M Price Change(1h)    -0.0700% Price Change(24h)   -1.1200% RSI (1h/4h/1d)      50.92/43.21/36.71  Fear Greed Index         17/100 #Altcoin  Season Index     35/100   #crypto  $SOL","gravity_id":"372090877","id":36653,"createdAt":"2025-12-19T04:40:26.218Z","updatedAt":"2025-12-19T06:00:28.655Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T05:05:01.203Z","text_content":"$SOL  if the downward trend continuious in btc than solana will comback to zero, but if btc gives a last bull run than it will rise.","gravity_id":"372092051","id":36682,"createdAt":"2025-12-19T05:10:28.033Z","updatedAt":"2025-12-19T06:00:28.259Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T05:22:45.050Z","text_content":"Predictions shouldn’t belong to platforms.\nThey should belong to the people who create them.\n\n@duel_duck  flips prediction markets into a creator-owned economy - built on Solana, powered by peer-to-peer conviction.\n\nInstead of centralized odds and hidden rules, Duel Duck lets anyone spin up a market, attract attention, and earn from the influence they generate.\n\n🔹 User-created prediction events, live in minutes\n🔹 Creators earn commissions as their duels gain traction\n🔹 Web2-friendly UX that feels familiar, not intimidating\n🔹 Fair game mechanics designed for transparent outcomes\n🔹 Scalable earning paths for predictors, leaders & creators\n\nWith 100K+ active users already onboarded, Duel Duck isn’t experimenting - it’s proving that prediction markets work best when the crowd builds them.\n\nPredict to earn.\nCreate to scale.\nLead to compound.\n\nDuel Duck turns attention into action - and action into income.","gravity_id":"372092155","id":36708,"createdAt":"2025-12-19T05:30:26.040Z","updatedAt":"2025-12-19T06:10:31.044Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T05:37:28.608Z","text_content":"Solana and Pump fun are facing legal scrutiny in the US.\n\nA class action lawsuit has been filed against  $PUMP and  $SOL linked entities, alleging that memecoin trading caused harm to retail users.\n\nThe court has allowed the case to proceed after new evidence was presented. No final ruling has been made, and all parties deny any wrongdoing.\n\nThis case could have wider implications for how memecoins and DeFi platforms are regulated in the future.\n#SOL #PUMP","gravity_id":"372092257","id":36716,"createdAt":"2025-12-19T05:40:27.249Z","updatedAt":"2025-12-19T06:20:28.366Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T05:52:45.055Z","text_content":"🇺🇸 ETF FLOWS: SOL and XRP spot ETFs saw net inflows on Dec. 18, while BTC and ETH spot ETFs saw net outflows.\n\nBTC: - $161.3M\nETH: - $96.6M\nSOL: $13.2M\nXRP: $30.41M ","gravity_id":"372092348","id":36730,"createdAt":"2025-12-19T06:00:04.421Z","updatedAt":"2025-12-19T06:50:28.379Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T05:56:28.268Z","text_content":"With  $SOL ecosystem growing fast, do charts matter more right now or usage metrics like transactions and active wallets?\nNot financial advice, DYOR.\n#SOL #OnChain #Altcoin Season#","gravity_id":"372091536","id":36747,"createdAt":"2025-12-19T06:00:26.859Z","updatedAt":"2025-12-19T07:10:28.757Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T05:54:55.847Z","text_content":"$SOL Casino is more predictable then this now,what do you think LONG or SHORT?","gravity_id":"372091526","id":36748,"createdAt":"2025-12-19T06:00:27.060Z","updatedAt":"2025-12-19T06:50:27.981Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T05:54:14.262Z","text_content":"$SOL remains volatile but resilient. Price keeps defending key support zones while on-chain activity stays strong, a classic momentum vs patience setup.\nNot financial advice, DYOR.\n#Solana #PriceAction #Crypto","gravity_id":"372092356","id":36749,"createdAt":"2025-12-19T06:00:27.295Z","updatedAt":"2025-12-19T06:50:28.182Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T05:51:20.460Z","text_content":"$SOL  1D shows bearish pressure lingering near key support 📉\r \r Momentum holds downward with price hovering just above a critical demand zone around 117. Resistance stands near 129, which could mark a pivot if reclaimed by buyers.\r \r Watch for potential reversal signs if price dips below 117 support—these could open a long opportunity targeting the 129 resistance. Without reversal signals, the path lower towards approximately 106.5 remains on the table. For now, bias stays bearish unless clear bullish structure surfaces above 129. This is just one page from the journal. The full trade plan is logged inside Finora AI. 🚀\r \r Full journal entry - visit our profile, link in bio.","gravity_id":"372091494","id":36750,"createdAt":"2025-12-19T06:00:27.695Z","updatedAt":"2025-12-19T06:30:28.673Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T06:07:45.103Z","text_content":"On Dec. 18 (ET), spot Bitcoin ETFs recorded net outflows of $161 million. Spot Ethereum ETFs saw net outflows of $96.62 million, marking six consecutive days of net outflows. Spot Solana ETFs posted net inflows of $13.16 million, while spot XRP ETFs recorded net inflows of $30.41 million. https://t.co/LRUeJvGjtU","gravity_id":"372092455","id":36753,"createdAt":"2025-12-19T06:10:02.772Z","updatedAt":"2025-12-19T07:30:27.419Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T06:01:45.083Z","text_content":"ETF Flows: 18 Dec 2025\n\n🔴 $BTC ETFs: -$161.3M net outflows\n\n🔴 $ETH ETFs: -$96.6M net outflows\n\n🟢 $SOL ETFs: $13.2M net inflows","gravity_id":"372092413","id":36755,"createdAt":"2025-12-19T06:10:03.423Z","updatedAt":"2025-12-19T07:20:28.308Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T06:02:06.606Z","text_content":"🇺🇸 ETF FLOWS (Dec. 18)\n\n\n• #BTC spot ETFs: −$161.3M\n• #ETH spot ETFs: −$96.6M\n• #SOL spot ETFs: +$13.2M\n\n\n$SOL stood out with net inflows, a clear divergence in institutional positioning.","gravity_id":"372091584","id":36769,"createdAt":"2025-12-19T06:10:29.486Z","updatedAt":"2025-12-19T07:20:28.108Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T06:10:45.643Z","text_content":"Swing Trading as a Foundation for Discipline and Diversification.  Swing trading helped a friend move from stress and random trades to discipline and consistency. By slowing down, focusing on setups, and following risk rules, he rebuilt confidence and stability over time.  Now he’s branching out into stocks and bonds on CEX and experimenting with Bitget’s TradFi beta, showing how swing trading can be a foundation for diversification. In today’s market, $ETH  trades around $2,919, up 3.34%, while So$SOL  holds near $122, flat at 0.10%, reflecting how major alts can serve as benchmarks for swing traders exploring new opportunities.  Swing trading isn’t just about short term profits. It builds discipline that makes entering new markets less stressful and more sustainable. #Solana or Ethereum?#  #CMC Quest: Earn Rewards#","gravity_id":"372092483","id":36772,"createdAt":"2025-12-19T06:20:03.408Z","updatedAt":"2025-12-19T07:30:27.219Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T06:27:49.655Z","text_content":"$SOL   is breaking down from its current range, and as long as it stays below the $125 mark, the downside pressure remains in play.    If this rejection holds, the next key area to watch is the $95–$105 demand zone  a spot where buyers could look to re-enter. ﻿Follow to stay updated  ﻿#Macro Insights#  #Altcoin Season#","gravity_id":"372091757","id":36799,"createdAt":"2025-12-19T06:30:26.914Z","updatedAt":"2025-12-19T07:30:27.021Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T06:31:27.411Z","text_content":"$SOL Use all your available funds to buy TWT. Convert all other coins into TWT and hold on tight, don't sell yet, BECAUSE: TWT = BNB = $1000. You will quickly become rich as expected!","gravity_id":"372091779","id":36810,"createdAt":"2025-12-19T06:40:25.553Z","updatedAt":"2025-12-19T07:50:28.215Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T06:55:45.052Z","text_content":"In a surprising move for the Solana DeFi ecosystem, the Solana-based DEX Lifinity has announced it is ceasing all operations. This decision, confirmed by reports from SolanaFloor, marks the end for a once-prominent automated market maker.\nhttps://bitcoinworld.co.in/solana-dex-lifinity-shuts-down/ ","gravity_id":"372092803","id":36836,"createdAt":"2025-12-19T07:00:30.911Z","updatedAt":"2025-12-19T08:20:28.084Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T06:51:47.719Z","text_content":"$SOL always the best","gravity_id":"372092766","id":36837,"createdAt":"2025-12-19T07:00:31.125Z","updatedAt":"2025-12-19T08:00:29.380Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T07:15:02.159Z","text_content":"Spent some time tonight going over the charts on $BTC  and $SOL , and one thing is clear to me: price isn’t committing yet. $BTC  keeps reacting around the same upper and lower levels, which usually tells me patience matters more than forcing entries. Instead of overtrading that range, I shifted focus to learning.  I noticed a crypto platform Bitget is rolling out a TradFi beta product and applied for early access. With markets blending more each cycle, understanding how crypto tools interact with traditional assets feels like an edge worth developing. I’ll explore it calmly once approved and share real observations after some hands-on time.   #BTC Price Analysis#  #Bitcoin Price Prediction: What is Bitcoins next move?#  #Solana flip Ethereum?#  #Bitcoin","gravity_id":"372093101","id":36858,"createdAt":"2025-12-19T07:20:06.817Z","updatedAt":"2025-12-19T08:20:27.886Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T07:19:45.103Z","text_content":"📊 XRP & SOL spot ETFs gained inflows while BTC & ETH saw outflows on Dec. 18. Are altcoins gaining the upper hand? #CryptoETFs #XRP #SOL\n\nhttps://coinomedia.com/xrp-sol-etf-inflows-2/","gravity_id":"372092986","id":36868,"createdAt":"2025-12-19T07:30:02.212Z","updatedAt":"2025-12-19T08:20:27.688Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T07:28:45.070Z","text_content":"1x $SOL winner | 90 minutes\n\n• RT + 🔔\n• Interact with my Pinned Post (No RT)👆","gravity_id":"372094090","id":36878,"createdAt":"2025-12-19T07:30:25.853Z","updatedAt":"2025-12-19T08:32:51.928Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T07:37:49.691Z","text_content":"Momentum is starting to shift after a prolonged base formation, and buyers are clearly stepping back in with confidence. Price has reclaimed the key intraday level, and the rounded recovery structure suggests accumulation rather than a weak bounce. As long as demand holds above support, continuation toward higher resistance zones remains the higher-probability scenario. The structure favors upside expansion, indicating that $SOL is positioning itself for a bullish follow-through rather than a short-lived move.\n\n\nTrade Setup\nBias: Bullish\nEntry Zone: 123.5 – 124.5\nTargets:\n• 129.0\n• 132.5\nStop Loss: 117.6\n\n\nStay disciplined and manage risk accordingly.","gravity_id":"372093356","id":36885,"createdAt":"2025-12-19T07:40:27.004Z","updatedAt":"2025-12-19T08:40:28.397Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T07:37:45.122Z","text_content":"Markets may be down, but SolBlaze DAO remains well-funded! Over the past few months, the DAO has accumulated an additional 150 bSOL + 162m BLZE in protocol revenues, ensuring the treasury maintains a healthy balance of assets as we approach the upcoming launch of SolBlaze v2 👀 \nTo ensure the DAO remains well-funded during these rougher markets, we're temporarily and gradually adjusting pool fees to 5%, matching the industry standard of other Solana LSTs. We'll increase incentives on APY-sensitive activities like Kamino Multiply to maintain stability.","gravity_id":"372093355","id":36886,"createdAt":"2025-12-19T07:40:27.229Z","updatedAt":"2025-12-19T08:32:51.530Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T07:31:45.104Z","text_content":"#Solana (SOL) Flashed a Quiet Bullish Signal as $SOL Price Defends Key Support\nhttps://captainaltcoin.com/solana-sol-flashed-a-quiet-bullish-signal-as-sol-price-defends-key-support/","gravity_id":"372093286","id":36887,"createdAt":"2025-12-19T07:40:27.431Z","updatedAt":"2025-12-19T08:32:51.729Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T07:56:14.950Z","text_content":"For Solana Treasury Companies, another week means another low.  $SOL is significantly underperforming because they are still unable to establish a bottom. \n\n\n#solana    #SOL","gravity_id":"372094393","id":36920,"createdAt":"2025-12-19T08:00:27.815Z","updatedAt":"2025-12-19T08:40:28.198Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T08:16:45.175Z","text_content":"🚀Just what Brazil needed: $SOL ETP approved! Who needs coffee when you can sip on crypto hype? ☕️💰  \n\n➡️ Dive into the future: https://coinlineup.com/p/valour-secures-b3-approval-solana-etp-brazil.webm  \n\n#Crypto #Solana #ETP #InvestSmart #Valour ","gravity_id":"372094597","id":36946,"createdAt":"2025-12-19T08:20:26.284Z","updatedAt":"2025-12-19T09:10:28.175Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T08:00:00.188Z","text_content":"$SOL  — BOUNCE FROM DEMAND, RESISTANCE AHEAD  Solana is bouncing strongly from a well-defined demand zone after a deep intraday pullback. Despite the strength of the rebound, price remains below descending resistance that has guided the recent downtrend. The move currently appears corrective within a broader bearish structure. Sellers may look to defend this level unless SOL can reclaim the trendline decisively.  Follow every update 👉 https://bit.ly/3KzlGmI   #SOL  #Solana  #SOL Price Analysis#","gravity_id":"372093592","id":36947,"createdAt":"2025-12-19T08:20:26.485Z","updatedAt":"2025-12-19T09:00:35.255Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T08:28:45.047Z","text_content":"Prediction markets don’t have to feel like casinos.\nThey can be creator economies.\n\n@duel_duck  flips predictions into a peer-to-peer arena where influence, insight, and timing actually pay.\n\nInstead of platforms extracting value, Duel Duck lets users own the markets they create - and earn as others engage.\n\n🔹 Creator-led prediction markets with real revenue share\n🔹 Web2-smooth UX built on Solana speed\n🔹 Scalable earning loops for traders, creators & leaders\n🔹 Fair-play mechanics designed to reward skill, not whales\n🔹 100K+ active users already battling it out\n\nOn Duel Duck, predictions aren’t passive bets.\nThey’re competitive duels.\n\n🔹 Earn points toward upcoming airdrops\n🔹 Go head-to-head to win duels\n🔹 Launch your own markets and earn commissions\n🔹 Copy top performers to boost accuracy\n🔹 Become a leader and earn from your followers\n\nThis is prediction markets as a game, a business, and a social layer - all at once.\n\nCreate the duel.\nWin the crowd.\nEarn from conviction.\n\nDuel Duck turns prediction into ownership.","gravity_id":"372093901","id":36970,"createdAt":"2025-12-19T08:32:50.103Z","updatedAt":"2025-12-19T09:20:27.767Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T08:28:42.670Z","text_content":"$SOL Donald Trump Excited News #BTC Price Analysis# #Macro Insights# #Altcoin Season# #Meme Alpha# #BNBChain#","gravity_id":"372093899","id":36971,"createdAt":"2025-12-19T08:32:50.317Z","updatedAt":"2025-12-19T09:20:27.967Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T08:27:33.152Z","text_content":"Right now, everything is progressing exactly as I expected on $SOL . However, there is only one condition left to enter a trade: the price must break above the last swing high that caused the final drop, with strong volume. #Solana  After this breakout, the trade can be entered from the first pullback zone and carried up to the range high area.  #Altcoin Season#","gravity_id":"372093890","id":36972,"createdAt":"2025-12-19T08:32:50.522Z","updatedAt":"2025-12-19T09:20:28.170Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T08:34:45.049Z","text_content":"📉 Want to average down in this volatile market? Don’t let fees eat your profits!\n\n✅ USDT → USDC\n✅ USDC → BTC / ETH / SOL and other top & promising coins\n🔥 All USDC spot trades: fee = 0\n\n💰 The saved fees may seem small now—but when the market rallies, that’s pure extra gain!\n\n👉 Trade now: https://t.co/nqBakdFazh\n\n#XT #USDC #XTearn","gravity_id":"372094787","id":36974,"createdAt":"2025-12-19T08:40:05.062Z","updatedAt":"2025-12-19T09:50:27.800Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T08:33:35.673Z","text_content":"$SOL its going down folks ! 🤩🤑❤️","gravity_id":"372093938","id":36987,"createdAt":"2025-12-19T08:40:26.833Z","updatedAt":"2025-12-19T09:40:28.260Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T08:33:06.225Z","text_content":"$SOL spent over a month struggling between $130 to $140,  unfortunately it's now dropped down to $124.\n\nwhat's happening to  $SOL ?","gravity_id":"372093934","id":36988,"createdAt":"2025-12-19T08:40:27.033Z","updatedAt":"2025-12-19T09:40:28.462Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T08:44:25.942Z","text_content":"[{\"sourceId\":\"69450fb65560e872d781e0be\",\"tldr\":\"Solana expands its presence in Brazilian institutional portfolios through the B3 exchange's listing of its ETP, VSOL, joining the ranks alongside Bitcoin and Ethereum.\",\"url\":\"https://coinmarketcap.com/community/articles/6943e225ccaa9f5909a3d9ac\",\"relevantWord\":\"Solana expands its presence\",\"score\":\"9.0\"},{\"sourceId\":\"69450fa85560e872d781e09c\",\"tldr\":\"US courts are assessing MEV activities within the Solana ecosystem, focusing on allegations of front-running and memecoin launches.\",\"url\":\"https://coinmarketcap.com/community/articles/69450147140ae427e265c536\",\"relevantWord\":\"US courts are assessing MEV activities\",\"score\":\"8.0\"},{\"sourceId\":\"69450fa85560e872d781e09e\",\"tldr\":\"Solana is boosting blockchain security with Project Eleven by testing quantum-resistant signatures on its platform.\",\"url\":\"https://coinmarketcap.com/community/articles/69449b4cda253f7c8111b744\",\"relevantWord\":\"testing quantum-resistant signatures\",\"score\":\"8.0\"},{\"sourceId\":\"69450fb65560e872d781e0bc\",\"tldr\":\"Coinbase enhances its platform by integrating Solana DEX access, enabling seamless Solana token swaps through the Jupiter aggregator.\",\"url\":\"https://coinmarketcap.com/community/articles/6943beff0b35ce0c6c19dba3\",\"relevantWord\":\"integrating Solana DEX access\",\"score\":\"8.0\"}]","gravity_id":"372095094","id":37001,"createdAt":"2025-12-19T08:50:26.768Z","updatedAt":"2025-12-19T09:50:27.397Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T08:43:40.368Z","text_content":"🚨  $SOL Scalp Long – Oversold Bounce After Flush \n🔥Entry: 124.5 – 125.0 🟢  \n🎯 TP1: 128 → +3%  \n🎯 TP2: 131 → +5.5% \n\n🛑 SL: 122 (-2%)  \n\n⚡ Leverage: x10–x20  \n⚖️ Risk: 0.5–1%  \n\nStochRSI 16 → 9 curling up hard from extreme oversold  \nRSI 40 – dropped fast, now room for quick recovery  \nPrice wicked 116.71 low + rejected lower Bollinger perfectly  \n45M SOL volume + 5.6B USDT pair – meme coins (BONK, WIF, POPCAT) rotating back + Pump.fun still printing  \n\nClassic post-dump relief bounce – grab the quick 5% and bounce  \nLFG Solana scalpers 💥  \nNFA – DYOR  \n\n#SOL #Solana #MemeSeason #Scalp","gravity_id":"372095071","id":37002,"createdAt":"2025-12-19T08:50:26.969Z","updatedAt":"2025-12-19T09:50:27.598Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T09:07:49.824Z","text_content":"Why $BTC   ETFs look like they’re falling short, even as their role grows: Asia Morning Briefing What looks like underperformance reflects a structural shift: ETF flows now smooth volatility rather than amplify crypto rallies. ﻿#BTC Price Analysis#   ﻿#Macro Insights#  $SOL","gravity_id":"372095790","id":37035,"createdAt":"2025-12-19T09:10:07.361Z","updatedAt":"2025-12-19T09:50:27.194Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T09:16:45.071Z","text_content":"🔎 CMC Feature Highlight | Holders Data on DexScan\n\nWant to understand who's backing your favorite tokens?\n\nDexScan lets you explore detailed holders data across BSC, Ethereum, Base, and Solana.\n🔷 See total number of holders and their concentration\n🔷 Filter by categories like whales, KOLs, bots, and more\n🔷 Visualize changes over time with clear holding charts\n\nGet all the insights into token distribution and holder behavior, all in one place.\n\nCheck here: https://t.co/vy9bxwiAua","gravity_id":"372096719","id":37052,"createdAt":"2025-12-19T09:20:04.568Z","updatedAt":"2025-12-19T10:10:29.200Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T09:25:20.696Z","text_content":"🔥 $SOL Daily Analysis (D1) 🔥\n\n\nSOL is forming a clear Head & Shoulders pattern, signaling a weakening uptrend. The key neckline at $100-105 (around $101) is being tested with weak bounce and low volume\n⚠️ Bear case: Daily close below $101 confirms breakdown, targets $85-75, even $60 if market turns bad\n🟢 Bull case (lower odds): Hold $100-105 with strong rejection possible bounce to $130-150\nStrategy: Avoid FOMO buys, manage risk tightly, wait for a clear break\nThis is a make-or-break zone for SOL\n#Macro Insights# #Meme Alpha# #Altcoin Season#","gravity_id":"372097001","id":37093,"createdAt":"2025-12-19T09:30:26.244Z","updatedAt":"2025-12-19T10:50:28.662Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T09:23:55.934Z","text_content":"🚨 $SOL  breakdown alert 🚨 $SOL  is slipping out of its current range, signaling growing downside pressure. As long as $SOL  fails to reclaim the $125 level, bearish momentum remains in control, and sellers continue to dictate short-term direction.  If this rejection holds, $SOL  could slide toward the $95–$105 demand zone, an area where buyers may attempt to step back in. Until a clear reclaim of resistance occurs, caution is warranted as $SOL  searches for stability.  On the ecosystem side, don’t miss the $VOOI  Listing Carnival on BingX. $VOOI  is a cutting-edge Perpetual DEX Aggregator backed by YZi Labs, adding another narrative to watch while markets remain volatile.  Join us on Telegram: t.me/AlphaCryptoSignal   ﻿#CMC Quest: Earn Rewards#  #CMC Smart Quests#  #Altcoin Season#  #Macro Insights#","gravity_id":"372096823","id":37094,"createdAt":"2025-12-19T09:30:26.445Z","updatedAt":"2025-12-19T10:50:28.861Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T09:19:45.068Z","text_content":"💸 When banks ask for faster settlements, Visa's like, \"Why not throw in some $USDC on $SOL?\" 🚀 Who knew traditional finance could party with crypto? 🎉 Check it out! 👉 https://aicryptocore.com/p/visa-usdc-settlement-solana-us.webm #Crypto #USDC #Visa #Solana #Stablecoin ","gravity_id":"372096775","id":37095,"createdAt":"2025-12-19T09:30:26.647Z","updatedAt":"2025-12-19T10:40:28.459Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T09:49:06.098Z","text_content":"Market Analysis.   #Bitcoin  – Current Price: $88,000. Key liquidity levels: $80,700 and $97,550. Important levels: $92,000 and $84,000.  BTCUSDT Overview: After falling to $84,000, the price of $BTC  reversed and began to rise locally.  The profit on the long position is 357%.   If the price holds at $87,000, the upward movement may continue to the key level of $92,000.  #Altcoin  Overview: Altcoins have gathered liquidity from previous lows and important zones, which opens up the potential for an upward movement. The price of $SOL  fell to the key level of $120 and showed a reaction. If the price remains above this level, it could start a powerful upward movement.   #BTC Price Analysis#  #Altcoin Season#  #Crypto#","gravity_id":"372098175","id":37111,"createdAt":"2025-12-19T09:50:05.744Z","updatedAt":"2025-12-19T11:12:56.016Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T09:46:45.102Z","text_content":"🫡Are you ready?\nHot Crypto Futures Contest Goes Live!  \n\nTrade $SOL, PIPPIN, LUNA, BEAT, & JELLYJELLY!\nPrize Pool:  $20,000 HTX! \n\n@terra_money\n\nTap Here: https://www.htx.com.de/en-us/mars/web/activity-center?callId=176587019198986 ","gravity_id":"372097305","id":37125,"createdAt":"2025-12-19T09:50:26.202Z","updatedAt":"2025-12-19T11:01:01.658Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T09:58:45.281Z","text_content":"JAKE PAUL vs. ANTHONY JOSHUA 🥊\n\nThey go head-to-head.\nPredict the winner correctly and win 1 SOL \n\n(5 lucky people) #JakeJoshua\n","gravity_id":"372098407","id":37144,"createdAt":"2025-12-19T10:00:26.744Z","updatedAt":"2025-12-19T11:20:28.217Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T09:56:34.082Z","text_content":"$SOL  relief bounce #sol","gravity_id":"372097535","id":37145,"createdAt":"2025-12-19T10:00:26.944Z","updatedAt":"2025-12-19T11:20:28.420Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T09:52:46.007Z","text_content":"🔥   $SOL Daily Analysis (D1) 🔥\n\nSOL is forming a clear Head & Shoulders pattern, signaling a weakening uptrend. The key neckline at $100-105 (around $101) is being tested with weak bounce and low volume\n⚠️ Bear case: Daily close below $101 confirms breakdown, targets $85-75, even $60 if market turns bad\n🟢 Bull case (lower odds): Hold $100-105 with strong rejection possible bounce to $130-150\nStrategy: Avoid FOMO buys, manage risk tightly, wait for a clear break\nThis is a make-or-break zone for SOL\n\n#Macro Insights# #Altcoin Season# #BNBChain#","gravity_id":"372097422","id":37146,"createdAt":"2025-12-19T10:00:27.171Z","updatedAt":"2025-12-19T11:20:28.624Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T09:51:10.267Z","text_content":"🇺🇸ETF FLOWS: $SOL  and XRP spot ETFs saw net inflows on Dec. 18, while $BTC  and ETH spot ETFs saw net outflows. BTC: - $161.3M ETH: - $96.6M SOL: $13.2M XRP: $30.41M ﻿#BTC Price Analysis#  #BTC  #SOL","gravity_id":"372098204","id":37147,"createdAt":"2025-12-19T10:00:27.381Z","updatedAt":"2025-12-19T11:20:28.835Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T10:17:11.788Z","text_content":"$SOL going to $90","gravity_id":"372102099","id":37185,"createdAt":"2025-12-19T10:20:26.501Z","updatedAt":"2025-12-19T11:20:28.018Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T10:42:18.321Z","text_content":"$SOL   after updating its low, is forming a correction to the resistance conglomerate, but will the bears be able to hold back the upward movement?  Bitcoin is testing 90K but is currently unable to consolidate above this zone. This is having a negative impact on the entire market. SOL is testing the 125.5 zone of interest after updating its low. If the bears keep the price below this level, SOL may come under pressure. Two key areas of interest: 124.5 and 128.9. If 124.5 does not hold the market, then before falling, within the global downtrend, SOLANA may test the upper resistance.  Resistance levels: 124.5, 128.9 Support levels: 120.15, 116.7  Global and local trends are downward. At the moment, a countertrend correction is forming, which may be stopped in the indicated areas. A false breakout could trigger a decline  #SOL  #Solana  #Crypto  #Altcoin    https://t.me/RLindaTrade/9544","gravity_id":"372098736","id":37226,"createdAt":"2025-12-19T10:50:27.067Z","updatedAt":"2025-12-19T11:20:27.820Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T10:55:45.070Z","text_content":"Solstice launches telegram focused GTM campaign\n\nover the last months, then @solsticefi has been high up in the pre-TGE arena on X. \n\nlargely driven by their mindshare tournament, this has onboarded a lot of LPs and creators that are driving the awareness of their Solana yield platform. \n\nthe next phase is here some also have a campaign that is infofi on telegram focused, the campaign is ending on the 30th of January and rewards claiming in Q1. \n\nso now comes the question after their ICO, when will TGE go live?","gravity_id":"372101385","id":37245,"createdAt":"2025-12-19T11:00:59.366Z","updatedAt":"2025-12-19T11:20:27.415Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T10:53:53.499Z","text_content":"$BTC  has checked all the boxes this year #ETFs  are live, institutions are onboard, and regulation is moving in the right direction. The next move belongs to the #Bitcoin  community 👇 All I want for Christmas is…   ﻿#BTC Price Analysis#  $SOL","gravity_id":"372101369","id":37246,"createdAt":"2025-12-19T11:00:59.572Z","updatedAt":"2025-12-19T11:20:27.617Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:10:45.077Z","text_content":"Visa's using $USDC on $SOL to settle! Who needs banks when you have stablecoins doing the work? 😜💸 Let’s keep the crypto chaos rolling! https://aicryptocore.com/p/visa-usdc-settlement-solana.webm #CryptoMeme #USDC #Solana #Visa #CryptoMarket ","gravity_id":"372101565","id":37267,"createdAt":"2025-12-19T11:12:54.187Z","updatedAt":"2025-12-19T11:20:27.213Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:16:45.086Z","text_content":"#BREAKING \n\n$SOL Price Prediction: Critical $135 Level Holds Key to $175 Recovery Within 6 Weeks\n\nSOL price prediction suggests potential recovery to $160-$175 range if $135 support holds, but break below could trigger decline to $118. Technical analysis shows mixed signals.\n\n#…","gravity_id":"372102587","id":37282,"createdAt":"2025-12-19T11:20:27.024Z","updatedAt":"2025-12-19T11:50:28.420Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:37:45.039Z","text_content":"🦅 Spot ETF Flow:\n\n🟥 -1,832 $BTC (-$161.3M)\n🟥-32,778 $ETH (-$96.6M)\n🟩 +16.3M $XRP (+$30.4M)\n🟩 +105,862 $SOL (+$13.2M)\n\n🔹@Coinbase US appstore rank: 380\n+13 from yesterday ","gravity_id":"372100225","id":37303,"createdAt":"2025-12-19T11:40:02.574Z","updatedAt":"2025-12-19T13:10:29.320Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:34:39.761Z","text_content":"A whale is accumulating    $SOL\n\nThe address bought 41k coins ($5 million) during the market dip\n\nOver about 8 months, he has already earned $1.28 million on   $SOL having bought them for $3 million at an average price of $122 and later sold at $175\n\nWill he be able to repeat the success?\n#Altcoin Season# #Macro Insights# #Meme Alpha# #BNBChain#","gravity_id":"372099367","id":37319,"createdAt":"2025-12-19T11:40:26.785Z","updatedAt":"2025-12-19T13:10:29.532Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:34:00.094Z","text_content":"$SOL  REMAINS WEAK AFTER TRIANGLE BREAKDOWN  Solana stays bearish after breaking down from a major triangle formation and confirming a lower-high structure. Consolidation attempts keep failing below dynamic resistance, signaling distribution rather than accumulation. If current support gives way, price may extend toward the lower demand area.  More forecasts 👉 https://bit.ly/detraders   #SOL  #Solana  #SOL Price Analysis#","gravity_id":"372102723","id":37320,"createdAt":"2025-12-19T11:40:26.989Z","updatedAt":"2025-12-19T12:30:27.347Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:30:34.953Z","text_content":"🎯 A whale is accumulating $SOL\n\n\nThe address bought 41k coins ($5 million) during the market dip\n\n\nOver about 8 months, he has already earned $1.28 million on $SOL having bought them for $3 million at an average price of $122 and later sold at $175\n\n\nWill he be able to repeat the success?\n#Meme Alpha# #Macro Insights# #Altcoin Season#","gravity_id":"372102694","id":37321,"createdAt":"2025-12-19T11:40:27.194Z","updatedAt":"2025-12-19T12:30:27.550Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:25:41.430Z","text_content":"$SOL   recently hit a new low and is now pulling back toward resistance. Can the bears keep it down?  Bitcoin is testing $90K but can’t hold above it, putting pressure on the market. SOL is near $125.5 if it drops below, more downside is possible. Key levels to watch: $124.5 and $128.9. Breaking $124.5 could push SOL lower within the broader downtrend.  The market’s been unpredictable lately. Sentiment feels fragile, and nothing is clear-cut. That’s why I’ve slowed down instead of chasing moves. I’m still involved just in a calmer way. While prices are under pressure, I’m letting the $THQ  Bitget Launchpool do the work, earning rewards without forcing trades. In uncertain markets, steady progress beats rushing small wins add up when patience leads the strategy. ﻿#Solana  #Macro Insights#  #Altcoin Season#","gravity_id":"372102660","id":37322,"createdAt":"2025-12-19T11:40:27.401Z","updatedAt":"2025-12-19T12:30:27.751Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:23:00.045Z","text_content":"$SOL  is testing a strong weekly support zone around 120 after a deep pullback. If this level holds, buyers can step in for a solid bounce toward higher resistance zones. Holding above this area keeps the recovery structure intact.\n\n#Meme Alpha#","gravity_id":"372100124","id":37323,"createdAt":"2025-12-19T11:40:27.609Z","updatedAt":"2025-12-19T12:30:27.956Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:22:45.055Z","text_content":"Consensus Hong Kong 2026 is coming 🇭🇰\n\nOne of the most important global events for crypto, Web3, AI and institutional finance returns to Hong Kong — and ticket prices are about to increase.\n\n⏰ Prices go up on December 18 at 11 PM (HKT)\n💰 Save up to $1,000 by booking before the increase.\n\n🎟️ Exclusive discount for The Cryptonomist community\nCode: CRYTONOMIST20\n\nConsensus HK brings together:\n\nGlobal Web3 leaders & institutions\n\nBuilders, founders and investors\n\nThe future of blockchain, AI and digital assets\n\n🚀 Bonus: Solana will host its first official event of 2026, Solana Accelerate, during Consensus Hong Kong.\n\n👉 Secure your ticket now and don’t miss it. https://t.co/2mcHGIGpgU\n\n#ConsensusHK #Web3 #Crypto #Blockchain #AI #Solana #TheCryptonomist","gravity_id":"372099281","id":37324,"createdAt":"2025-12-19T11:40:27.818Z","updatedAt":"2025-12-19T12:30:28.160Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:22:45.050Z","text_content":"Prediction markets shouldn’t feel intimidating or exclusive.\nThey should feel social, simple, and rewarding.\n\nThat’s why @duel_duck  stood out to me 🦆\n\nBuilt on Solana, Duel Duck flips prediction markets into a user-driven earning game - where creators, traders, and leaders all win.\n\n🔹 Create your own prediction duels and earn commissions\n🔹 Battle it out with others to win rewards\n🔹 Copy top performers to boost your edge\n🔹 Become a leader and earn from your influence\n🔹 Web2-friendly UX that actually scales\n\nWith 100K+ active users already onboarded, Duel Duck proves one thing:\npeople don’t just want to predict — they want to participate.\n\nThis isn’t gambling.\nIt’s InfoFi powered by community, conviction, and creators.\n\nPredict.\nCreate.\nEarn.\n\nDuel Duck makes prediction markets fun again 🦆","gravity_id":"372102637","id":37325,"createdAt":"2025-12-19T11:40:28.025Z","updatedAt":"2025-12-19T12:00:29.462Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:20:00.108Z","text_content":"🚀 $SOL  shows early signs of a potential recovery.  Price recently reacted from the lower channel boundary and is attempting to stabilize, suggesting sellers may be losing immediate control.  📉 Technical View: • Pattern: Descending structure transitioning into a base formation near channel support • Bias: Bullish as long as price holds above the recent reaction low • Key Level: Lower channel support as the pivot, with descending resistance as the upside trigger  ✅Full analytics in telegram->   bit.ly/cryptolingrid   \r \r  ⚠️ This bullish scenario may fail if price slips back below the channel support and accelerates with expanding downside momentum.  #SOL  #Solana  #SOL Price Analysis#","gravity_id":"372102617","id":37326,"createdAt":"2025-12-19T11:40:28.228Z","updatedAt":"2025-12-19T11:50:28.218Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:58:28.320Z","text_content":"$SOL holding strong around $125 on the 4H chart after that big drop – bouncing off key support with RSI showing oversold conditions\nBulls defending the green line, but volume’s fading. Break above $130 could spark a rally, or more pain below $120? 🚀📉\n\n\n#SOL","gravity_id":"372100353","id":37362,"createdAt":"2025-12-19T12:00:27.369Z","updatedAt":"2025-12-19T13:10:28.908Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T11:58:00.089Z","text_content":"#SolanaFoundation  has deployed post-quantum digital signatures on testnet, marking a major step toward quantum-resistant blockchain security.\r \r \r The initiative, developed with Project Eleven, demonstrates end-to-end quantum-resistant transactions across wallets, validators, and core infrastructure.\r \r \r #Solana  joins Ethereum and Cardano in actively researching defenses against potential future quantum computing threats.\r \r \r $SOL  Co-founder Anatoly Yakovenko previously estimated a meaningful probability of quantum risks emerging within five years, framing this move as proactive risk mitigation. #Altcoin Season#","gravity_id":"372101895","id":37363,"createdAt":"2025-12-19T12:00:27.597Z","updatedAt":"2025-12-19T13:10:29.113Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T12:19:45.057Z","text_content":"Claude AI Predicts XRP, Solana and Ethereum Crypto Price Outlooks for 2025-2026\n\nhttps://thebitjournal.com/claude-ai-predicts-xrp-solana-and-ethereum-crypto-price-outlooks-for-2025-2026c/\n\n#ClaudeAI #CryptoPriceOutlook #CryptoPriceOutlook2026 #XRPpriceprediction ","gravity_id":"372103017","id":37364,"createdAt":"2025-12-19T12:20:02.855Z","updatedAt":"2025-12-19T13:30:28.138Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T12:58:45.051Z","text_content":"ICYMI: Solana spot trading is now live on dYdX.\n\nZero fees. Any Solana asset. Available to U.S. users.\n\nStart here 👉 https://dydx.trade/spot?utm_source=dYdXTwitter&utm_medium=GlobalSocial&utm_campaign=GlobalSocial ","gravity_id":"372100682","id":37447,"createdAt":"2025-12-19T13:01:02.443Z","updatedAt":"2025-12-19T13:30:27.123Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T12:54:17.385Z","text_content":"💪💪💪💪💪💪    Mangoceuticals announced a partnership with Cube Group to #launch  a #Solana  treasury strategy with capital of up to $100 million. ❤️    SOL    #crypto  $SOL","gravity_id":"372103201","id":37448,"createdAt":"2025-12-19T13:01:02.644Z","updatedAt":"2025-12-19T13:30:27.324Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T12:47:30.220Z","text_content":"$SOL  it is on the resistence agen, short time 126$","gravity_id":"372099774","id":37449,"createdAt":"2025-12-19T13:01:02.851Z","updatedAt":"2025-12-19T13:30:27.525Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T12:32:00.110Z","text_content":"$SOL  is showing a short-term recovery after the sharp drop, but price is now pausing near a local resistance zone. Holding above the recent higher low keeps the bounce valid, while a clean breakout can extend the move further. Failure to hold may lead to another retest of nearby support.\n\n#Altcoin Season#","gravity_id":"372103070","id":37450,"createdAt":"2025-12-19T13:01:03.255Z","updatedAt":"2025-12-19T13:30:27.925Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T13:25:45.229Z","text_content":"Kamino Targets #Solana’s Missing Piece: Predictable Borrowing $SOL\nhttps://captainaltcoin.com/kamino-targets-solanas-missing-piece-predictable-borrowing/","gravity_id":"372105018","id":37478,"createdAt":"2025-12-19T13:30:26.332Z","updatedAt":"2025-12-19T14:00:48.512Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T13:18:52.744Z","text_content":"💪💪💪💪💪💪  Mangoceuticals announced a partnership with Cube Group to #launch  a #Solana  treasury strategy with capital of up to $100 million. ❤️  $SOL   #crypto","gravity_id":"372100819","id":37479,"createdAt":"2025-12-19T13:30:26.534Z","updatedAt":"2025-12-19T14:00:48.717Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T13:18:19.727Z","text_content":"$SOLThey have set the algorithm to 5m timeframe with a 9 EMA indicator in the upward direction; it's not going below that. Yesterday it was set to the downside, today it's set to the upside. What a game Solana has set up! This coin reminds me of Luna; it will definitely disappear one day. It's not trustworthy.","gravity_id":"372099981","id":37480,"createdAt":"2025-12-19T13:30:26.737Z","updatedAt":"2025-12-19T14:00:48.923Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T13:10:45.111Z","text_content":"#BREAKING \n\nUS-listed company Mangoceuticals is planning to launch a $100 million crypto treasury strategy, with a focus on investing in $SOL.\n\n#Bitcoin $BTC","gravity_id":"372099927","id":37481,"createdAt":"2025-12-19T13:30:26.958Z","updatedAt":"2025-12-19T13:30:26.958Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T13:59:28.435Z","text_content":"The BoJ raised the uncollateralized overnight call rate from 0.5% to around 0.75%, adjusting the degree of monetary accommodation. The central bank said the move reflects greater confidence that price and wage developments are evolving broadly in line with its projections. The decision aligns with expectations that the BoJ was preparing to take another step away from ultra-loose policy.Investors responded positively to the decision, with Bitcoin advancing about 3% following the announcement. Ether ( $ETH  jumped about 4% while Solana ( $SOL  ) pushed even higher by 12:00 UTC.","gravity_id":"372106036","id":37482,"createdAt":"2025-12-19T14:00:23.346Z","updatedAt":"2025-12-19T14:40:28.866Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T13:43:45.110Z","text_content":"LIVE NOW -- Crypto Prices Are Down. Builders Aren’t! \n\nCrypto prices are down, but the most important players are still building. In this week’s Weekly Rollup, @RyanSAdams and @TrustlessState break down Coinbase’s push to become a financial super app, JPMorgan’s first tokenized money market fund on Ethereum, and why regulators are quietly opening the door for onchain settlement through DTCC pilots.\n\nThey also unpack Solana’s Firedancer finally going live, the growing fight over tokenholder rights at Aave and what Uniswap’s unification proposal gets right, and why tokenization and prediction markets are advancing faster than prices suggest. If you’re focused on signals instead of noise, this is the episode that matters.\n\n[TIMESTAMPS]\n\n0:00 Intro\n\n2:14 Markets\n- @0xNonceSense\n- @leshka_eth\n\n12:38 Bankless Announcements\n- @JustDeauIt\n\n20:12 @coinbase System Update\n- @base \n- @brian_armstrong \n- @jessepollak\n\n37:50 Aave Drama, v4 & the 2026 Master Plan\n- @aave\n- @DefiIgnas\n- @howdymerry\n- @haydenzadams\n- @StaniKulechov\n\n47:20 Solana BreakPoint\n- @solana\n- @phantom\n- @jerallaire\n- @theoneandomsy\n- @aeyakovenko\n\n52:48 @SECGov says DTCC can tokenize stocks\n- @Snapcrackle\n\n57:06 @jpmorgan launched their first ever tokenized money market fund - Ethereum\n- @ethereum \n- @JPMorganAM \n\n57:56 Do Kwon was sentenced to 15 years in prison\n\n59:43 New York Times put out another anti-crypto piece\n- @intangiblecoins\n- @EricBalchunas\n\n1:01:23 @netflix announced new Bitcoin comedy\n- @BitcoinArchive\n\n1:03:02 Closing & Disclaimers","gravity_id":"372100956","id":37488,"createdAt":"2025-12-19T14:00:25.121Z","updatedAt":"2025-12-19T14:20:28.561Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T13:55:45.073Z","text_content":"Solana leveraged prediction market public sale\n\nmy main challenge is that @intodotspace only got a waitlist so far and no product live?\n\nI understand that they got a strong team, good backers etc but its hard to get behind a presale without testing and using the product. \n\nI like the idea of prediction markets with leverage and I know about some great products launching soon within this story 👀 I might soon be diving much deeper into a specific prediction market.","gravity_id":"372105185","id":37513,"createdAt":"2025-12-19T14:00:47.286Z","updatedAt":"2025-12-19T14:40:29.068Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T13:55:45.044Z","text_content":"In a bold move that underscores the growing institutional embrace of cryptocurrency, Nasdaq-listed healthcare firm Mangoceuticals has announced a groundbreaking SOL investment strategy.\nhttps://bitcoinworld.co.in/mangoceuticals-sol-investment-treasury/ ","gravity_id":"372104547","id":37514,"createdAt":"2025-12-19T14:00:47.487Z","updatedAt":"2025-12-19T14:30:27.965Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T13:48:27.465Z","text_content":"🚨 Doginals scam 🚨\n\nBark Books and Shibo were operating together\nNow Books has suddenly stepped away\n\nHe claims he was never involved in the POX scam or others\nSays he didn’t know what was happening\nThat explanation doesn’t hold up\n\nHe’s now running solo spaces\nNo links no interaction with the same circle\nSomething clearly broke behind the scenes\n\nIt goes further\nBark and Shibo reportedly told people to block Books\nThat alone raises questions\n\nInfo shared by MastrXYZ points to deep visibility inside these groups\nNothing here is accidental\nMovements like this usually happen when pressure hits\n\nStay alert\nDoginals has serious trust issues\nDo your own checks before touching anything in this space\n $BTC  $SOL","gravity_id":"372100986","id":37515,"createdAt":"2025-12-19T14:00:47.722Z","updatedAt":"2025-12-19T14:30:28.168Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T13:46:45.030Z","text_content":"🔥 LATEST: Nasdaq-listed Mangoceuticals partners with Cube Group to form Mango DAT, targeting a $100M Solana digital asset treasury. ","gravity_id":"372104503","id":37516,"createdAt":"2025-12-19T14:00:47.931Z","updatedAt":"2025-12-19T14:30:28.374Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T13:34:16.090Z","text_content":"$SOLThere hasn't been even a single dollar pullback in the last 13 hours, which shows how terribly they are fooling people. For the past week, there's been a continuous downtrend of 10-12 dollars, followed by another 10-12 dollar uptrend. Meme coins are far better than this; if you lose, you lose, if you gain, you gain. These guys are just eating up people's money every day.","gravity_id":"372105065","id":37517,"createdAt":"2025-12-19T14:00:48.346Z","updatedAt":"2025-12-19T14:00:48.346Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T14:16:45.059Z","text_content":"The market drifts sideways with uneven moves 🚒\n\n📉 $BTC sits at $87,916.79 (-0.25%)\n📈 $ETH moves at $2,959.69 (+1.12%)\n📉 $XRP holds at $1.87 (-1.63%)\n📈 $SOL stands at $125.90 (+0.53%)\n📉 $TRX rests at $0.2784 (-0.18%)\n📉 $ARB trades at $0.1864 (-1.09%)\n\nIs the market stabilizing here, or slowly rolling over into deeper weakness? 🤔\n\nKeep track of every shift with Guarda Wallet 🔗 https://t.co/VDv3lPiP6E","gravity_id":"372105325","id":37519,"createdAt":"2025-12-19T14:20:02.787Z","updatedAt":"2025-12-19T15:10:28.915Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T14:29:54.227Z","text_content":"Fragmented liquidity across chains continues to push demand for aggregation layers that reduce execution friction\n\n\n$VOOI enters that space as a perp-focused DeFi hub, with BingX supporting the rollout through a Dec 25 listing carnival featuring $50,000 in rewards tied to simple spot and futures participation\n\n\nIn the broader market, $SOL sharp 7.8% drop was quickly absorbed, followed by a near symmetrical rebound, highlighting strong demand on dips rather than a shift in trend.","gravity_id":"372106260","id":37559,"createdAt":"2025-12-19T14:30:26.753Z","updatedAt":"2025-12-19T15:20:29.745Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T14:34:45.072Z","text_content":"INSIGHT: On Dec. 18, U.S. spot Bitcoin ETFs saw $161M in outflows\n\n• Ethereum ETFs logged $96.6M outflows for a sixth straight day\n• Solana: $13.2M inflows\n• XRP: $30.4M inflows. ","gravity_id":"372104806","id":37563,"createdAt":"2025-12-19T14:40:05.648Z","updatedAt":"2025-12-19T15:30:30.523Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T14:40:20.886Z","text_content":"$SOL  is sitting at a critical decision point IMO.\r \r Price is holding the $123–$125, if momentum builds, expect a clean break opening $140+.","gravity_id":"372105478","id":37581,"createdAt":"2025-12-19T14:40:27.450Z","updatedAt":"2025-12-19T15:40:28.353Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T14:30:17.304Z","text_content":"Don’t Miss Out on Future Airdrops! 💰\r \r Every trader has faced the friction of bridging into a token like $POL  or $SOL  just to buy a coin or NFT on its native chain.\r \r That friction often means missing out on token airdrops, similar to what OpenSea’s reward system is currently teasing.\r \r With Houdini Swap, those worries disappear through our cross-bridge functionality, saving you time, complexity, and the heavy fees that come with specialized DEXs.\r \r Airdrops are becoming increasingly popular, and now you can participate the easy way.\r \r #Altcoin Season#","gravity_id":"372106262","id":37582,"createdAt":"2025-12-19T14:40:27.886Z","updatedAt":"2025-12-19T15:20:29.541Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T14:50:02.564Z","text_content":"$SOL this wash trading scam is going to $10 before $1","gravity_id":"372105536","id":37599,"createdAt":"2025-12-19T14:52:45.273Z","updatedAt":"2025-12-19T15:40:27.953Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T14:43:19.829Z","text_content":"$SOL the rhythm of the rug pull is becoming very prodictable 💀","gravity_id":"372104864","id":37600,"createdAt":"2025-12-19T14:52:45.485Z","updatedAt":"2025-12-19T15:40:28.153Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:05:11.807Z","text_content":"$SOL\nSellside liquidity is taken, and price is bouncing from the lows\n\nNow pulling back into a key supply / OB zone\n\nIf this area holds → move toward higher liquidity makes sense\n\nSimple rule:\nLiquidity first, direction later","gravity_id":"372108040","id":37637,"createdAt":"2025-12-19T15:10:27.122Z","updatedAt":"2025-12-19T15:50:28.377Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:01:45.103Z","text_content":"$SOL is back testing the $110–$85 region again, but this area feels like a late-stage consolidation to me.\n\nOn the monthly chart, cup-and-handle structure is still developing, which is why I see this pullback as part of the final basing phase. \nTrade to Earn $WXT\n📅 Nov 26, 18:00 – Dec 25, 11:59 PM (UTC+8)\n\nKey highlights:\nInstant $WXT rewards for every trade\n2M USDT WXT Buyback boost\nUp to 2.4% rebate rate\n\n👉 Start trading now：\nhttps://www.weex.com/events/futures-trading/trade-to-earn-wxt?vipCode=0ivx","gravity_id":"372106456","id":37638,"createdAt":"2025-12-19T15:10:27.323Z","updatedAt":"2025-12-19T15:50:28.577Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:17:16.850Z","text_content":"$SOL  Ascending Triangle Bounce Zone   Solana is ready to rebound from the lower border of an ascending triangle pattern on the 2W chart  Target levels after pattern completion: 🎯 $250 🎯 $500 🎯 $1,000  Accumulation phase complete, breakout loading!","gravity_id":"372106587","id":37656,"createdAt":"2025-12-19T15:20:27.936Z","updatedAt":"2025-12-19T15:50:28.173Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:24:59.733Z","text_content":"$SOL  is sitting at a critical decision point IMO.  Price is holding the $123–$125, if momentum builds, expect a clean break opening $140+.  Failure to hold current support sends $SOL  back to the $100- $118 range for a deeper reset. ﻿#Altcoin Season#  #Solana  #Trading","gravity_id":"372106677","id":37678,"createdAt":"2025-12-19T15:30:28.723Z","updatedAt":"2025-12-19T16:00:37.690Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:22:58.215Z","text_content":"$SOLSolana is the only powerful and actively developing blockchain, recommended for people who are lost in the world of cryptocurrency for long-term investment. Do not destroy your money with the promises of scammers and fraudsters. Avoid buying unsupported and aimless currencies. No wise person throws himself into a swamp to find diamonds.","gravity_id":"372108208","id":37679,"createdAt":"2025-12-19T15:30:28.932Z","updatedAt":"2025-12-19T16:00:37.982Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:31:45.364Z","text_content":"$SOL  /USD Sell Trade Signal #sol    Entry: 126.84  Stop Loss: 129.88  Target 1: 123.70  Target 2: 121.98  Target 3: 120.12  Trade is active.","gravity_id":"372108286","id":37697,"createdAt":"2025-12-19T15:40:26.547Z","updatedAt":"2025-12-19T16:10:29.912Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:49:45.028Z","text_content":"DeFi, but make it best.\n\nSolana DeFi.","gravity_id":"372107412","id":37713,"createdAt":"2025-12-19T15:50:26.970Z","updatedAt":"2025-12-19T16:10:29.281Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:46:18.706Z","text_content":"🔥 LATEST: Nasdaq-listed Mangoceuticals partners with Cube Group to form Mango DAT, targeting a $100M $SOL   digital asset treasury.  ﻿#BTC Price Analysis#  #Macro Insights#   ﻿#SOL","gravity_id":"372109010","id":37714,"createdAt":"2025-12-19T15:50:27.174Z","updatedAt":"2025-12-19T16:10:29.492Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:46:00.080Z","text_content":"$SOL  is sitting on a major historical support zone where previous cycles started strong upside expansions. The structure shows similarities to past accumulation phases, with price compressing after a deep pullback. If this base holds and momentum builds, history suggests a powerful recovery move could follow toward higher resistance levels.","gravity_id":"372109008","id":37715,"createdAt":"2025-12-19T15:50:27.380Z","updatedAt":"2025-12-19T16:10:29.708Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:00:00.143Z","text_content":"Kamino Targets #Solana ’s Missing Piece: Predictable Borrowing  $SOL    https://captainaltcoin.com/kamino-targets-solanas-missing-piece-predictable-borrowing/","gravity_id":"372113062","id":37734,"createdAt":"2025-12-19T16:00:35.284Z","updatedAt":"2025-12-19T16:30:28.412Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:55:05.830Z","text_content":"A $SOL  whale snatched 41,000 SOL ($5M) as prices dipped below $120. This savvy investor previously scored $1.28M profit selling at $175, are they seeing a buying opportunity?  #Solana","gravity_id":"372113034","id":37735,"createdAt":"2025-12-19T16:00:35.584Z","updatedAt":"2025-12-19T16:30:28.617Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:52:45.051Z","text_content":"You can tokenize literally anything and trade it on Solana.","gravity_id":"372107429","id":37736,"createdAt":"2025-12-19T16:00:35.876Z","updatedAt":"2025-12-19T16:30:28.819Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T15:51:33.326Z","text_content":"$SOL  - Mcap 70.31B$ - 84%/ 927.4K votes Bullish  SC02 M5 - pending Long order. Entry lies within LVN + not affected by any weak zone, estimated stop-loss around 0.90%. The uptrend is in the 146th cycle, amplitude 5.57%.  #TradingSetup  #CryptoInsights","gravity_id":"372108449","id":37737,"createdAt":"2025-12-19T16:00:36.170Z","updatedAt":"2025-12-19T16:20:28.790Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:01:32.049Z","text_content":"$SOL  is getting a lot of attention right now  market cap around $70B and sentiment heavily tilted bullish.  On the lower timeframe, a potential long setup is forming. Price is sitting in a strong value area with no nearby weak zones, and risk looks fairly tight, with a stop just under 1%. The broader move is still trending upward, and momentum hasn’t really broken yet.  Nothing aggressive here  just a clean, controlled setup worth keeping an eye on. ﻿$PTB  #Macro Insights#  #Altcoin Season#","gravity_id":"372113069","id":37756,"createdAt":"2025-12-19T16:10:28.282Z","updatedAt":"2025-12-19T16:40:28.465Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:16:45.197Z","text_content":"Bitcoin Cash is now supported by NEAR Intents on mainnet, connecting $BCH like never before.\n\nUsers can now swap from 120+ native assets across 25+ chains → BCH (and back) without having to worry about bridging, gas juggling, or wallet switching. \nFor builders:\n\nEnable routes to and from Bitcoin Cash with NEAR Intents’ 1Click API—a single integration that abstracts routing and execution into one seamless flow to make your app instantly interoperable.\nFor the Bitcoin Cash ecosystem:\n\nProjects can now integrate NEAR Intents’ 1Click Swap directly into their products, giving users frictionless access to assets and liquidity across 25+ ecosystems like Zcash, Ethereum, Solana, Cardano.\nStart swapping: https://near-intents.org/ \n\nStart building: https://docs.near-intents.org/near-intents/integration/distribution-channels/1click-api","gravity_id":"372108617","id":37761,"createdAt":"2025-12-19T16:20:03.759Z","updatedAt":"2025-12-19T17:10:31.059Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:17:59.125Z","text_content":"Crypto Gaming is Bear Market Proof By Design   Market sentiment has clearly turned more bearish, with Bitcoin ( $BTC  ) slipping back to around $85,000 after failing to sustain a push above $95,000 the previous week. The move reinforced the sense that upside momentum remains limited as broader risk appetite continues to thin.  That pullback triggered roughly $576 million in liquidations, dragging most major altcoins lower in the process. $SOL   briefly fell to $120 before stabilizing near $121 during the Asian trading session, while #XRP  dropped to $1.77 and later recovered to approximately $1.84 at the time of writing.  Data from Coinglass showed no meaningful spike in trading volume during the selloff. The $576 million in liquidations reflected forced deleveraging across derivatives markets, clearing out leveraged long and short positions rather than signaling broad-based panic. ﻿#BTC Price Analysis#   ﻿#Meme Alpha#","gravity_id":"372110061","id":37766,"createdAt":"2025-12-19T16:20:06.274Z","updatedAt":"2025-12-19T17:20:28.843Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:13:59.417Z","text_content":"Charts are telling a familiar story in crypto. $SOL  climbing from $117.68 to $127.58 shows what steady builder confidence looks like, while $ASTER ’s jump from $0.6556 to $0.72 on heavy volume reminds us how fast hype can move markets.   At the same time, #Repsol   joining the Hedera Council shows the quieter side of growth  real companies running nodes and exploring decentralized identity. One is price action, the other is real-world utility. Long term, it’s when both start to align that real value is built.  ﻿#Macro Insights#  #Altcoin Season#  #CMC Launch: Aster#  #BingX","gravity_id":"372110029","id":37777,"createdAt":"2025-12-19T16:20:27.606Z","updatedAt":"2025-12-19T16:50:29.107Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:11:38.226Z","text_content":"$SOL is showing a clear rejection from the upper supply zone after a strong bullish run. The impulsive move has stalled, selling pressure has stepped in near resistance, and the lower-timeframe structure is starting to shift bearish. As long as price stays below the rejected zone, a corrective pullback toward the lower support area remains likely..........\n\n\nTrade Setup\nEntry Range: 125.0 – 126.5\nTarget 1: 123.5\nTarget 2: 122.0\nTarget 3: 120.4\nStop Loss: 127.8","gravity_id":"372108584","id":37778,"createdAt":"2025-12-19T16:20:27.811Z","updatedAt":"2025-12-19T16:40:28.263Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:27:53.157Z","text_content":"Solana $SOL  is going quantum! 🔒 The network is testing new post-quantum cryptography to future-proof its blockchain against potential quantum computing threats. A step ahead in securing the future of Web3. #Solana","gravity_id":"372108697","id":37797,"createdAt":"2025-12-19T16:30:27.164Z","updatedAt":"2025-12-19T17:30:29.204Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:39:50.341Z","text_content":"The #Solana  ETF have recorded a new daily positive net inflow on December 18 of $13.16M.\r They have kept a daily consecutive positive daily net inflows for 2 weeks now. \r $SOL  price  have dipped to mre than 6 month Lows of $117.3 and have rebounded today to $126 . #Altcoin Season#    You can have follow us on our X account to Build a strong Community across all our channels:\r \r \r   x.com/Cryptofeed_N","gravity_id":"372108792","id":37813,"createdAt":"2025-12-19T16:40:26.821Z","updatedAt":"2025-12-19T17:30:28.575Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:37:45.100Z","text_content":"Prediction markets usually reward platforms.\n@duel_duck flips that - and rewards the people who create the signal.\n\nDuel Duck feels less like betting\nand more like a creator-driven economy built on predictions.\n\n🔹 P2P prediction markets built on Solana\n🔹 Creators launch duels and earn from their influence\n🔹 Web2-friendly UX that actually scales users\n🔹 Fair game mechanics, not house-favored odds\n🔹 103,000+ active users already onboarded\n\nOn Duel Duck, you don’t just predict - you build leverage around your insight.\n\n🔹 Earn Duel points toward upcoming airdrops\n🔹 Battle others head-to-head to win\n🔹 Create duels and earn commissions\n🔹 Copy top performers to boost accuracy\n🔹 Become a leader and earn extra rewards\n\nThis is InfoFi in action -\nwhere attention turns into markets\nand conviction turns into income.\n\nDuel Duck isn’t just a prediction app.\nIt’s a creator-powered prediction economy","gravity_id":"372108777","id":37814,"createdAt":"2025-12-19T16:40:27.072Z","updatedAt":"2025-12-19T17:30:28.782Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:31:40.652Z","text_content":"How You Can Power Your Bags 💡  Liquidity providers don’t just earn fees, they power the entire market - from $SOL  to memecoins like $FARTCOIN .  Deep liquidity means:  🔸 Lower slippage for traders  🔸 More reliable pricing  🔸 Higher TVL  It’s a feedback loop: More liquidity → better UX → more volume → more fees → more liquidity.  More liquidity provides stability and reduces volatility, resulting in lower risk.  Meteora takes this further by optimizing where liquidity sits, using DLMMs to keep capital aligned with real demand, not idle pools.  That’s why LPs on Meteora have already earned $1.2B+ in fees.  Liquidity isn’t passive. It’s productive.  And once you understand how it works, you stop watching markets and start participating in them by becoming a liquidity provider yourself.  Start earning insane fees on your crypto journey now 👀  #DeFi","gravity_id":"372108720","id":37815,"createdAt":"2025-12-19T16:40:27.279Z","updatedAt":"2025-12-19T17:30:29.001Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:43:45.102Z","text_content":"Bitwise Files for Spot Sui ETF as Altcoin Product Push Accelerates\nBitwise has filed with the SEC to launch the first U.S. spot ETF tracking Sui (SUI), expanding its altcoin ETF strategy beyond Bitcoin, Ethereum, Solana, and XRP. \nhttps://www.coinspeaker.com/bitwise-files-for-spot-sui-etf-as-altcoin-product-push-accelerates/?fsp_sid=5590 ","gravity_id":"372108820","id":37818,"createdAt":"2025-12-19T16:50:03.375Z","updatedAt":"2025-12-19T17:40:27.605Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:46:45.117Z","text_content":"Final call, voting closes today.\nGov Vote 8 ends Dec 19 | 8 PM GMT.\nLast chance to set the next SHx bridge priority:\nSolana or XRPL first?\nVote now in the Gov Vote Tool → https://sghd.co/gv8","gravity_id":"372108851","id":37834,"createdAt":"2025-12-19T16:50:27.255Z","updatedAt":"2025-12-19T17:40:27.201Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:46:45.091Z","text_content":"Core growth infra on Solana.","gravity_id":"372110283","id":37835,"createdAt":"2025-12-19T16:50:27.465Z","updatedAt":"2025-12-19T17:40:27.403Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T16:51:08.587Z","text_content":"LATEST: Nasdaq-listed Mangoceuticals partners with Cube Group to form Mango DAT, targeting a $100M $SOL  digital asset treasury. ﻿#BTC Price Analysis#  #Macro Insights#","gravity_id":"372113443","id":37859,"createdAt":"2025-12-19T17:00:31.867Z","updatedAt":"2025-12-19T17:50:28.300Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T17:12:06.455Z","text_content":"$SOL - Mcap 70.31B$ - 84%/927.4K\nvotes Bullish\n\nSC02 M5 - pending Long order. Entry lies within LVN + not affected by any weak zone, estimated stop-loss around 0.90%.\nThe uptrend is in the 146th cycle, amplitude 5.57%.\n\n#TradingSetup #CryptoInsights","gravity_id":"372110484","id":37898,"createdAt":"2025-12-19T17:20:26.988Z","updatedAt":"2025-12-19T17:50:28.095Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T17:19:45.226Z","text_content":"Introducing the ultimate Portfolio Dashboard on Stabble! 📊 \n\nYour single source of truth: Real-time wallet balances, active CLMM positions, PnL tracking, and full deposit/withdrawal history—all in one sleek, clean interface.Manage your Solana DeFi empire like a pro. \nCheck it out now: https://clmm.stabble.org","gravity_id":"372111087","id":37911,"createdAt":"2025-12-19T17:30:27.390Z","updatedAt":"2025-12-19T17:50:27.891Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T17:31:45.119Z","text_content":"We aren't just building a better bot; we are engineering a smarter, fairer, and more resilient market ecosystem. We have stopped playing the old game and started rebuilding it from the ground up. \n\nBy replacing human impulse with sophisticated, autonomous code, we are creating a foundation where intelligence is the only authority and every participant thrives. $AIX $SOL","gravity_id":"372110642","id":37933,"createdAt":"2025-12-19T17:40:25.773Z","updatedAt":"2025-12-19T17:50:27.057Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T17:30:15.585Z","text_content":"$SOL is not only at its major support level, the same one that has held price for the past 2 years.\n\nBut there's also a bullish divergence forming on the 3D timeframe, exactly like what we saw before the major bottom in March.\n#SOL #Macro Insights# #Altcoin Season#","gravity_id":"372110635","id":37934,"createdAt":"2025-12-19T17:40:25.980Z","updatedAt":"2025-12-19T17:50:27.274Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T17:29:47.622Z","text_content":"The countdown is real... Off ramp your #BTC  $SOL","gravity_id":"372111161","id":37935,"createdAt":"2025-12-19T17:40:26.186Z","updatedAt":"2025-12-19T17:50:27.478Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T17:29:17.476Z","text_content":"🚨 AI Token Ava Plunges 96% After ‘Insiders’ Snipe 40% of Supply    #Solana  #AI  token Ava crashed nearly 96% after insiders dumped about 40% of the supply. SOL    #crypto  $SOL","gravity_id":"372110628","id":37936,"createdAt":"2025-12-19T17:40:26.394Z","updatedAt":"2025-12-19T17:50:27.688Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T17:47:42.212Z","text_content":"🚨 Historic moment: for the first time ever, Solana surpasses Ethereum in annual revenue 🤯 #Solana  $SOL","gravity_id":"372110739","id":37958,"createdAt":"2025-12-19T17:50:26.460Z","updatedAt":"2025-12-19T17:50:26.460Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T17:45:24.157Z","text_content":"$SOL Here we go again! Dump Dump Dump!!!","gravity_id":"372112287","id":37959,"createdAt":"2025-12-19T17:50:26.669Z","updatedAt":"2025-12-19T17:50:26.669Z"},{"crypto_id":"5426","crypto_name":"SOL","post_time":"2025-12-19T17:45:11.020Z","text_content":"Whale Alert: #Hyperliquid  Whale (0x3ed4)  Short  SOL with 20x leverage, entry price $125.5394, position value $13.98M. Source: CoinGlass  #crypto  $SOL","gravity_id":"372112285","id":37960,"createdAt":"2025-12-19T17:50:26.875Z","updatedAt":"2025-12-19T17:50:26.875Z"}]