[{"crypto_id":"1027","crypto_name":"ETH","news_id":"692f3aaf428027835450cf6a","news_date":"2025-12-02T20:19:46.082Z","news_title":"New Research Reveals How Eclipse's SVM Challenges Single-Threaded Ethereum Rollups","news_subtitle":"Eclipse combines Solana's parallel execution with Ethereum settlement, challenging single-threaded L2 design as Cointelegraph Research examines architectural trade-offs.","id":5,"createdAt":"2025-12-03T04:27:01.483Z","updatedAt":"2025-12-03T18:00:02.926Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"692fef1f4280278354f0535c","news_date":"2025-12-03T08:04:44.210Z","news_title":"Ethereum Sets TPS Record Ahead of Fusaka Upgrade","news_subtitle":"Layer-2 activity, led by Lighter’s high TPS, pushed Ethereum to a new 32,950 TPS network throughput record. Gas limit expansion to 60M and upcoming PeerDAS boost scalability, lowering costs and increasing data capacity. Fusaka adds security upgrades and passkey support, enhancing...","id":53,"createdAt":"2025-12-03T11:50:02.388Z","updatedAt":"2025-12-03T17:40:03.060Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693038f342802783542569d9","news_date":"2025-12-03T13:34:46.109Z","news_title":"Crypto Treasury Stocks Rebound Led by Ether-Focused Companies","news_subtitle":"Ethereum News Digital asset treasury stocks surged Tuesday as crypto markets recovered from early December selling pressure. Ether treasury companies led the gains, with several posting double-digit percentage increases as Ethereum rebounded from recent lows. Nasdaq-listed Ethere...","id":55,"createdAt":"2025-12-03T13:30:02.374Z","updatedAt":"2025-12-03T18:00:02.838Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693059c442802783543ed90a","news_date":"2025-12-03T15:39:43.053Z","news_title":"UK’s New Digital Asset Act Redefines Property Rights For Crypto Holders","news_subtitle":"The UK has formally rewritten centuries of property law with the Property (Digital Assets etc) Act 2025, creating a brand-new third category of personal property specifically for cryptocurrencies, stablecoins, and other digital assets. The legislation received Royal Assent on Dec...","id":66,"createdAt":"2025-12-03T15:50:02.671Z","updatedAt":"2025-12-03T18:00:03.182Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693074b44280278354731452","news_date":"2025-12-03T17:34:42.490Z","news_title":"Ethereum Hits New All-Time High for TPS Ahead of Fusaka Upgrade","news_subtitle":"The Ethereum ecosystem has set a new record for transactions per second. Combined activity across Ethereum and all its Layer 2 networks reached 32,950 TPS, passing last week’s high of 31,000. This increase comes ahead of today’s launch of the Fusaka upgrade, which is expected to ...","id":73,"createdAt":"2025-12-03T17:50:02.315Z","updatedAt":"2025-12-03T18:00:03.087Z"}]