[{"crypto_id":"1027","crypto_name":"ETH","news_id":"693074b44280278354731452","news_date":"2025-12-03T17:34:42.490Z","news_title":"Ethereum Hits New All-Time High for TPS Ahead of Fusaka Upgrade","news_subtitle":"The Ethereum ecosystem has set a new record for transactions per second. Combined activity across Ethereum and all its Layer 2 networks reached 32,950 TPS, passing last week’s high of 31,000. This increase comes ahead of today’s launch of the Fusaka upgrade, which is expected to ...","id":73,"createdAt":"2025-12-03T17:50:02.315Z","updatedAt":"2025-12-03T19:30:02.784Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6930819b42802783547cfb4c","news_date":"2025-12-04T06:09:44.202Z","news_title":"ETHZilla takes stake in Karus to tokenize AI-modeled auto-loan portfolios","news_subtitle":"ETHZilla acquires a 20% stake in AI startup Karus to launch tokenized, risk-tiered auto-loan portfolios and expand into the growing onchain debt market.","id":75,"createdAt":"2025-12-03T18:40:02.459Z","updatedAt":"2025-12-04T18:00:03.052Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69308d5642802783548583cc","news_date":"2025-12-03T19:19:46.073Z","news_title":"Ethereum Fusaka Upgrade Paves Way for Institutional Adoption","news_subtitle":"Fusaka upgrade enhances Ethereum scalability and efficiency for institutional adoption. Rollup fees drop 15–60%, benefiting high-volume tokenized and DeFi flows. Block gas limits rise fivefold and PeerDAS improves data availability and throughput. The Ethereum Fusaka upgrade is g...","id":77,"createdAt":"2025-12-03T19:30:02.695Z","updatedAt":"2025-12-03T23:40:02.964Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69308e7f4280278354867c98","news_date":"2025-12-04T03:29:44.521Z","news_title":"Startale USD Launches on Soneium as Sony Expands Web3 Payment Infrastructure","news_subtitle":"Stablecoin News Startale Group launched a dollar-pegged stablecoin called Startale USD on Sony's Ethereum layer-2 network Soneium on Wednesday, aiming to serve as the primary settlement currency for payments and rewards across the electronics giant's blockchain ecosystem. The tok...","id":78,"createdAt":"2025-12-03T19:40:02.857Z","updatedAt":"2025-12-04T18:00:02.957Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6930c9144280278354b3bd82","news_date":"2025-12-03T23:34:40.861Z","news_title":"Fusaka is activated: Ethereum enters a new era","news_subtitle":"On December 3, 2025, Ethereum crossed a major milestone with the activation of Fusaka, its most ambitious update in years. Promising increased scalability, reduced fees, and an improved user experience, this technical evolution is generating enthusiasm among investors and develop...","id":84,"createdAt":"2025-12-03T23:50:02.180Z","updatedAt":"2025-12-04T17:30:03.160Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6930f6cc4280278354d49f01","news_date":"2025-12-04T02:49:46.035Z","news_title":"Fusaka Upgrade Goes Live on Ethereum Mainnet","news_subtitle":"Ethereum’s Fusaka upgrade is live! Boosts scalability, efficiency, and security on the mainnet. #Ethereum #Fusaka #CryptoNews The post Fusaka Upgrade Goes Live on Ethereum Mainnet appeared first on CoinoMedia.","id":85,"createdAt":"2025-12-04T03:00:02.480Z","updatedAt":"2025-12-04T13:40:03.254Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69316e5742802783544748e5","news_date":"2025-12-04T14:19:46.029Z","news_title":"Ethereum Activates Fusaka: What This Upgrade Means for Users","news_subtitle":"This Article Was First Published on TurkishNY Radio. The Fusaka upgrade, the second major code overhaul in 2025 for the Ethereum network, has been successfully rolled out. The activation happened on December 3, 2025, a historic day for blockchain scalability and Layer-2 (L2) conn...","id":100,"createdAt":"2025-12-04T11:30:08.105Z","updatedAt":"2025-12-04T14:50:02.477Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6931905442802783545d95fc","news_date":"2025-12-04T13:44:51.125Z","news_title":"Ethereum Treasury Firm BitMine Adds $150M in Holdings","news_subtitle":"Ethereum News Ethereum treasury company BitMine purchased $150 million worth of Ethereum on Wednesday, maintaining its aggressive accumulation strategy through recent market turbulence. The firm continues to work toward its goal of holding 5% of total circulating supply. On-chain...","id":107,"createdAt":"2025-12-04T14:00:02.617Z","updatedAt":"2025-12-04T18:00:02.767Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69319e644280278354688a1d","news_date":"2025-12-04T14:44:51.099Z","news_title":"Ethereum Fusaka Upgrade Goes Live on Mainnet","news_subtitle":"Ethereum News Ethereum's second major upgrade of 2025 went live Wednesday, bringing enhanced data capacity, reduced transaction costs, and improved network usability. The Fusaka upgrade officially activated on mainnet at 9:49 p.m. UTC at Epoch 411392. The headline feature, peer d...","id":112,"createdAt":"2025-12-04T15:00:03.016Z","updatedAt":"2025-12-04T18:00:02.862Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69319e654280278354688c1d","news_date":"2025-12-04T14:44:51.099Z","news_title":"Ethereum Fusaka Upgrade Goes Live, Boosting Scalability Toward Instant Transactions","news_subtitle":"Quick Breakdown Fusaka was activated at Epoch 411392 on December 3, delivering PeerDAS for 8x data throughput. Reduced blob fees benefit Layer 2 rollups while cutting node data loads. The upgrade improves Ethereum’s usability by providing near-instant confirmations for users. Fus...","id":113,"createdAt":"2025-12-04T15:10:02.656Z","updatedAt":"2025-12-04T18:00:03.146Z"}]