[{"crypto_id":"1027","crypto_name":"ETH","news_id":"6942227a4280278354584a9f","news_date":"2025-12-17T20:14:51.093Z","news_title":"Ripple targets RLUSD expansion to Layer 2 networks with Wormhole","news_subtitle":"Ripple expands RLUSD to multiple L2s via Wormhole in 2026. Targets 24/7 trading liquidity across regulated, high-utility chains. Holds $1B+ supply and new $500M funding round. Ripple says RLUSD will extend beyond XRP Ledger and Ethereum and reach multiple Layer 2 networks in 2026...","id":664,"createdAt":"2025-12-17T21:10:04.209Z","updatedAt":"2025-12-18T00:30:03.302Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"694348a04280278354422968","news_date":"2025-12-18T07:54:46.085Z","news_title":"Ethereum vs Bitcoin: Technical Signals Point to a Major Trend Reversal","news_subtitle":"Ethereum may be entering a decisive phase against Bitcoin, as long-term technical indicators suggest a shift in relative strength after an extended period of underperformance. Bullish MACD Crossover Emerges on the 3-Week Timeframe The ETH/BTC trading pair has printed a bullish MA...","id":666,"createdAt":"2025-12-18T00:40:03.357Z","updatedAt":"2025-12-18T18:00:04.268Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6943532b4280278354482ea7","news_date":"2025-12-18T01:04:40.367Z","news_title":"ETHGas Raises $12M to Launch Ethereum Blockspace Market","news_subtitle":"ETHGas secures $12M seed round and $800M commitments to create a liquid, programmable Ethereum blockspace market. Blockspace futures enable pre-confirmations, high-throughput execution, and reduced gas volatility for developers and users. Open Gas Initiative sponsors gas for 127,...","id":669,"createdAt":"2025-12-18T01:20:02.634Z","updatedAt":"2025-12-18T18:00:03.304Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"694356b042802783544a53a0","news_date":"2025-12-18T09:39:40.540Z","news_title":"Ethereum could get faster in January with gas limit rise to 80M","news_subtitle":"Ethereum could become faster in the new year with the gas limit expected to rise from 60 million to 80 million following the next blob parameter-only hard fork on Jan. 7.","id":672,"createdAt":"2025-12-18T06:40:03.707Z","updatedAt":"2025-12-18T16:20:03.842Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6943b5a042802783549ebdbd","news_date":"2025-12-18T12:34:41.787Z","news_title":"Ethereum Gas Limit Increase Could Boost Speeds in January","news_subtitle":"Ethereum may boost speeds in January with an 80M gas limit after the blob parameter hard fork! Faster transactions ahead. #Ethereum #GasLimit #Crypto The post Ethereum Gas Limit Increase Could Boost Speeds in January appeared first on CoinoMedia.","id":675,"createdAt":"2025-12-18T08:21:11.526Z","updatedAt":"2025-12-18T18:00:03.627Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69440d834280278354d3c95b","news_date":"2025-12-18T14:19:43.503Z","news_title":"Ethereum Node Operation Gets a Major Break: Foundation Proposes 3 Key Solutions","news_subtitle":"BitcoinWorld Ethereum Node Operation Gets a Major Break: Foundation Proposes 3 Key Solutions Running an Ethereum node is about to get much easier. The Ethereum Foundation has just unveiled three crucial technical proposals designed to tackle one of the network’s growing pains: th...","id":688,"createdAt":"2025-12-18T14:30:03.549Z","updatedAt":"2025-12-18T18:00:02.971Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"694429a34280278354e725b4","news_date":"2025-12-18T17:24:51.090Z","news_title":"SoFi Launches SoFiUSD, Marking First U.S. Bank-Issued Stablecoin On Ethereum","news_subtitle":"SoFi has officially entered the stablecoin market with the launch of SoFiUSD, a fully reserved U.S. dollar stablecoin issued directly by its national bank subsidiary, SoFi Bank, N.A. The move positions SoFi as the first U.S. national bank to issue a stablecoin on a public blockch...","id":692,"createdAt":"2025-12-18T16:30:03.444Z","updatedAt":"2025-12-18T18:00:03.946Z"}]