[{"crypto_id":"1027","crypto_name":"ETH","news_id":"69530f274280278354ed66d7","news_date":"2025-12-30T11:40:44.498Z","news_title":"Bitmine Adds 44K ETH as Treasury Nears 3.5% of Ethereum Supply","news_subtitle":"Ethereum News Tom Lee's Bitmine Immersion Technologies has acquired another 44,463 Ethereum over seven days, pushing total holdings to 3.41% of circulating supply as the company advances toward its 5% accumulation target. The purchases occurred during year-end tax-loss selling th...","id":1115,"createdAt":"2025-12-29T23:50:03.079Z","updatedAt":"2025-12-30T18:00:02.432Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6952acba42802783549d7c71","news_date":"2025-12-30T11:40:44.498Z","news_title":"Japan Takes a Huge Step Regarding Bitcoin (BTC) and Altcoins! “A New Era Begins!”","news_subtitle":"Japan is preparing for a radical change in the taxation of cryptocurrencies like Bitcoin and Ethereum with its 2026 tax reform draft. Continue Reading: Japan Takes a Huge Step Regarding Bitcoin (BTC) and Altcoins! “A New Era Begins!”","id":1117,"createdAt":"2025-12-30T00:40:03.916Z","updatedAt":"2025-12-30T16:30:02.804Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6952aa6142802783549c0888","news_date":"2025-12-30T11:40:44.498Z","news_title":"Ethereum Staking Queue Surpasses Exit Queue, Hinting at Price Rally","news_subtitle":"The amount of Ether (ETH) waiting to be staked has exceeded the amount queued for...","id":1134,"createdAt":"2025-12-30T13:50:03.219Z","updatedAt":"2025-12-30T16:30:03.046Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69539718428027835455b018","news_date":"2025-12-30T17:50:46.043Z","news_title":"$1B ETH Staking Spree: BiMine Sparks Fresh Supply Squeeze on Ethereum","news_subtitle":"BitMine ETH staking spree supply squeeze intensifies as over $1B in ETH enters staking and tightens Ethereum’s liquid supply.","id":1137,"createdAt":"2025-12-30T15:10:03.193Z","updatedAt":"2025-12-30T18:00:02.924Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695386b242802783544be0d6","news_date":"2025-12-30T08:00:46.039Z","news_title":"Upbit Announces Crucial Ethereum Network Suspension: Proactive Pause for Hard Fork Security","news_subtitle":"BitcoinWorld Upbit Announces Crucial Ethereum Network Suspension: Proactive Pause for Hard Fork Security In a decisive move for blockchain security, South Korea’s premier cryptocurrency exchange, Upbit, has announced a temporary suspension of all Ethereum network deposits and wit...","id":1145,"createdAt":"2025-12-30T16:50:02.830Z","updatedAt":"2025-12-30T18:00:03.175Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695303774280278354e8223b","news_date":"2025-12-30T08:10:44.226Z","news_title":"Ethereum Validator Demand Turns Bullish as Entry Queue Overtakes Exits","news_subtitle":"Ethereum’s staking dynamics have shifted decisively, with validator entries overtaking exits for the first time in six months, signaling renewed confidence across the network. Entry Queue Surges, Exits Fade The chart shows a clear crossover: the entry queue (blue) has accelerated...","id":1146,"createdAt":"2025-12-30T16:50:03.085Z","updatedAt":"2025-12-30T18:00:03.423Z"}]