[{"crypto_id":"1027","crypto_name":"ETH","news_id":"694429a34280278354e725b4","news_date":"2025-12-18T17:24:51.090Z","news_title":"SoFi Launches SoFiUSD, Marking First U.S. Bank-Issued Stablecoin On Ethereum","news_subtitle":"SoFi has officially entered the stablecoin market with the launch of SoFiUSD, a fully reserved U.S. dollar stablecoin issued directly by its national bank subsidiary, SoFi Bank, N.A. The move positions SoFi as the first U.S. national bank to issue a stablecoin on a public blockch...","id":692,"createdAt":"2025-12-18T16:30:03.444Z","updatedAt":"2025-12-19T02:10:04.211Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"694461e1428027835428b579","news_date":"2025-12-18T20:19:44.168Z","news_title":"SoFi Bank Launches New SoFiUSD Stablecoin on Ethereum Blockchain","news_subtitle":"Stablecoin News SoFi Technologies launched SoFiUSD on Thursday, becoming the first nationally chartered bank to issue a stablecoin on a public blockchain. The fully reserved dollar-backed token deploys initially on Ethereum with potential expansion to additional networks, accordi...","id":700,"createdAt":"2025-12-18T20:30:02.210Z","updatedAt":"2025-12-19T18:00:03.353Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"694491ed428027835445cd7b","news_date":"2025-12-19T06:59:46.077Z","news_title":"ETHGas Raises $12M for 'Real-Time Ethereum' as Buterin Revives Gas Futures Talk","news_subtitle":"Ethereum News Ethereum blockspace trading platform ETHGas announced a $12 million seed round led by Polychain Capital as Ethereum co-founder Vitalik Buterin recently discussed on-chain gas futures markets. The funding supports the company's vision for reimagining blockspace alloc...","id":708,"createdAt":"2025-12-19T00:00:02.801Z","updatedAt":"2025-12-19T18:00:03.012Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"694548c04280278354d29aa3","news_date":"2025-12-19T12:44:46.028Z","news_title":"SoFi Bank Launches SoFiUSD Dollar-Backed Stablecoin for Fast Secure Payments and Settlements","news_subtitle":"SoFi Bank launches SoFiUSD, a fully backed stablecoin for fast secure payments and settlement. SoFiUSD operates on a public blockchain with instant transactions and full cash backing for safety. The stablecoin supports fintechs banks and enterprise platforms and may expand for gl...","id":731,"createdAt":"2025-12-19T14:30:04.178Z","updatedAt":"2025-12-19T14:40:02.957Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"694562864280278354e15d58","news_date":"2025-12-19T17:59:46.066Z","news_title":"Perps Platform Synthetix Returns to Ethereum Mainnet After 3 Years","news_subtitle":"Ethereum News Perpetuals trading platform Synthetix is moving back to Ethereum's mainnet after a three-year absence, with founder Kain Warwick stating the network can now handle high-frequency financial applications. Network congestion previously forced derivatives platforms to m...","id":732,"createdAt":"2025-12-19T14:52:21.525Z","updatedAt":"2025-12-19T18:00:03.688Z"}]