[{"crypto_id":"1027","crypto_name":"ETH","news_id":"69333ad24280278354f1f012","news_date":"2025-12-06T17:19:47.144Z","news_title":"Ethereum’s Fusaka Upgrade: Vitalik Buterin Addresses Update’s Significance","news_subtitle":"This article was first published on The Bit Journal: Will the activation of Ethereum’s Fusaka upgrade finally address the network’s transaction processing capacity? Read on to find out. Ethereum co-founder Vitalik Buterin has commended the recently activated Fusaka upgrade, which...","id":175,"createdAt":"2025-12-06T06:50:03.248Z","updatedAt":"2025-12-06T18:00:02.932Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69335a83428027835408daf5","news_date":"2025-12-06T10:04:51.034Z","news_title":"Fusaka Goes Live: Ethereum Cuts Layer-2 Fees by Up to 60 %","news_subtitle":"Ethereum activated the Fusaka upgrade today, reducing transaction costs on Layer-2 networks by roughly 40 % to 60 %. Fusaka is live on Ethereum mainnet!– PeerDAS now unlocks 8x data throughput for rollups– UX improvements via the R1 curve & pre-confirmatons– Prep for scaling the ...","id":182,"createdAt":"2025-12-06T10:10:02.610Z","updatedAt":"2025-12-06T18:00:03.081Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693330534280278354ea1058","news_date":"2025-12-06T07:49:46.078Z","news_title":"Vitalik Buterin Outlines 3 Key Ethereum Updates Shaping the Network’s Future","news_subtitle":"Vitalik Buterin detailed three upcoming protocol updates that will influence how Ethereum manages computation, security, and long-term scalability. The information was published in a new technical post on his official blog, highlighting renewed priorities for maintaining the netw...","id":183,"createdAt":"2025-12-06T10:30:03.355Z","updatedAt":"2025-12-06T18:00:03.253Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6933d463428027835475fcdc","news_date":"2025-12-06T12:29:51.101Z","news_title":"Ethereum’s Biggest Month Yet: 29 New Launches Signal a Rapidly Expanding Ecosystem","news_subtitle":"Ethereum has just wrapped up one of its most active months to date, delivering 29 launches, upgrades, and ecosystem milestones in a single stretch. The cycle began with the Fusaka upgrade on December 3rd, introducing 13 new EIPs that improved blob capacity, enhanced user experien...","id":191,"createdAt":"2025-12-06T14:10:03.298Z","updatedAt":"2025-12-06T18:00:03.397Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693325c64280278354e2a1f2","news_date":"2025-12-05T23:19:46.069Z","news_title":"WisdomTree Launches Europe’s First Fully Staked Ethereum ETP Holding Lido stETH","news_subtitle":"WisdomTree has introduced a major milestone for Ethereum investment products in Europe with the launch of the WisdomTree Physical Lido Staked Ether ETP (LIST). The product, which went live on December 4, 2025, is the first European ETP backed entirely by Lido’s stETH, giving inve...","id":198,"createdAt":"2025-12-06T15:00:03.437Z","updatedAt":"2025-12-06T16:30:03.029Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693458d34280278354c974d7","news_date":"2025-12-06T16:24:46.075Z","news_title":"Fusaka Sparks ETH Frenzy as Buyer Aggression Reaches 4-Month High","news_subtitle":"Analysts say a break above 1.0 in the buy/sell ratio could launch Ethereum toward the $3,500 to $4,000 level.","id":204,"createdAt":"2025-12-06T16:40:02.321Z","updatedAt":"2025-12-06T18:00:03.559Z"}]