[{"crypto_id":"1027","crypto_name":"ETH","news_id":"694c3ab74280278354113126","news_date":"2025-12-24T19:10:45.516Z","news_title":"Trend Research Buys 46K ETH, Now 3rd Largest Institutional Ethereum Holder","news_subtitle":"Ethereum News Trend Research purchased 46,379 Ethereum on Wednesday to raise its holdings to approximately 580,000 ETH, vaulting the private company into the top tier of institutional Ethereum (ETH) holders. Only two publicly listed companies currently report larger Ethereum bala...","id":933,"createdAt":"2025-12-24T19:20:03.038Z","updatedAt":"2025-12-25T18:00:03.358Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"694d0fff42802783549cadde","news_date":"2025-12-25T10:20:43.865Z","news_title":"Trip.com Enables Stablecoin Payments for Global Users","news_subtitle":"Trip.com now supports USDT and USDC payments globally with blockchains like Ethereum and Solana. Read original article on coincu.com","id":944,"createdAt":"2025-12-25T11:20:39.695Z","updatedAt":"2025-12-25T13:10:03.382Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"694cdec9428027835483a7aa","news_date":"2025-12-25T09:50:44.935Z","news_title":"Revolutionary Shift: Russia’s Top Stock Exchanges Poised to Launch Crypto Trading","news_subtitle":"BitcoinWorld Revolutionary Shift: Russia’s Top Stock Exchanges Poised to Launch Crypto Trading Get ready for a seismic shift in the global financial landscape. In a groundbreaking move, Russia’s two premier financial hubs—the Moscow Exchange (MOEX) and the Saint Petersburg Exchan...","id":945,"createdAt":"2025-12-25T11:20:39.922Z","updatedAt":"2025-12-25T16:20:02.804Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"694d3a2e4280278354b3022a","news_date":"2025-12-25T13:20:42.588Z","news_title":"Glamsterdam & Hegota Forks: Ultimate Guide to L1 Scaling Strategies","news_subtitle":"Ethereum Set for Major Scaling Advancements in 2026 The upcoming year promises transformative upgrades for Ethereum, targeted at significantly boosting its scalability and efficiency. Central to these developments is the Glamsterdam fork, scheduled for mid-2026, which aims to int...","id":949,"createdAt":"2025-12-25T13:40:03.024Z","updatedAt":"2025-12-25T18:00:03.746Z"}]