[{"crypto_id":"1027","crypto_name":"ETH","news_id":"6939931e4280278354de0eaa","news_date":"2025-12-11T03:14:42.436Z","news_title":"BlackRock Files for Staked Ethereum ETF with SEC Approval","news_subtitle":"BlackRock seeks SEC approval for a Staked Ethereum Trust ETF, causing Ethereum's market surge. Read original article on tokentopnews.com","id":375,"createdAt":"2025-12-10T15:50:02.553Z","updatedAt":"2025-12-11T15:30:03.040Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6939c1fc42802783541dd99b","news_date":"2025-12-11T01:59:42.185Z","news_title":"Vitalik Buterin Dismisses Ethereum Finality Concerns","news_subtitle":"Ethereum News Temporary loss of finalization poses no serious threat to Ethereum's network security, according to co-founder Vitalik Buterin, who addressed concerns following a recent Prysm client bug. The blockchain continues to function normally during finality delays, with the...","id":386,"createdAt":"2025-12-10T19:10:02.949Z","updatedAt":"2025-12-11T18:00:02.786Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6939feee42802783544499d6","news_date":"2025-12-10T23:14:51.054Z","news_title":"Gemini Secures Landmark CFTC License: A Game-Changer for Crypto Prediction Markets","news_subtitle":"BitcoinWorld Gemini Secures Landmark CFTC License: A Game-Changer for Crypto Prediction Markets In a landmark move for cryptocurrency regulation, the Gemini exchange has achieved a significant victory. The U.S. Commodity Futures Trading Commission (CFTC) has granted Gemini a Desi...","id":389,"createdAt":"2025-12-10T23:30:03.683Z","updatedAt":"2025-12-11T05:20:03.116Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693ac0424280278354cf9b0b","news_date":"2025-12-11T13:14:44.253Z","news_title":"Ethereum Drops 3.7% After Fed 'Hawkish Cut'","news_subtitle":"Ethereum's 3.7% pullback over the past 24 hours is the hangover from a 7% to 9% pre-Fed rally, not a reversal of the whale accumulation, ETF inflows, and structural supply tightening that drove the move higher in the first place. Ethereum Gave Back What It Gained, But the Buyers ...","id":404,"createdAt":"2025-12-11T13:20:02.587Z","updatedAt":"2025-12-11T18:00:03.000Z"}]