[{"crypto_id":"1027","crypto_name":"ETH","news_id":"693af17e4280278354edf5bf","news_date":"2025-12-11T17:14:40.950Z","news_title":"Coinbase Makes a Bold Move: $7B in Wrapped Assets Now Ride on Chainlink’s CCIP","news_subtitle":"Coinbase has taken a decisive step in its interoperability strategy, announcing that it will exclusively rely on Chainlink’s Cross-Chain Interoperability Protocol (CCIP) to bridge all wrapped assets, an ecosystem currently valued at roughly $7 billion. The move is one of the stro...","id":426,"createdAt":"2025-12-11T23:20:03.282Z","updatedAt":"2025-12-12T09:30:03.331Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693b8e82428027835469d3e7","news_date":"2025-12-12T03:39:42.804Z","news_title":"SEC Approves On-Chain Transition for U.S. Financial Markets","news_subtitle":"SEC Chairman endorses on-chain future, DTCC approved for tokenized stocks custody. Read original article on coincu.com","id":432,"createdAt":"2025-12-12T03:50:03.061Z","updatedAt":"2025-12-12T13:50:06.509Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693b07be42802783541a90f9","news_date":"2025-12-11T18:04:43.612Z","news_title":"Bhutan Debuts Gold-Backed TER Token on Solana Network","news_subtitle":"TER links tokenized gold held by DK Bank to Solana, blending sovereign oversight with on-chain distribution under Bhutan’s RWA strategy. The project uses regulated infrastructure from Gelephu Mindfulness City and Matrixdock, ensuring supervised issuance and redemption. TER builds...","id":444,"createdAt":"2025-12-12T08:40:03.384Z","updatedAt":"2025-12-12T08:40:03.384Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693bdf624280278354bb1f88","news_date":"2025-12-12T09:24:46.088Z","news_title":"Vitalik Buterin Proposes On-Chain Gas Futures for Ethereum","news_subtitle":"Ethereum's Vitalik Buterin proposes on-chain gas futures to stabilize unpredictable fees, impacting ETH and related assets. Read original article on theccpress.com","id":449,"createdAt":"2025-12-12T09:40:03.751Z","updatedAt":"2025-12-12T14:00:10.056Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693be1b54280278354bca678","news_date":"2025-12-12T09:34:42.381Z","news_title":"Trust Wallet Partners With Revolut for Instant Crypto Purchases in Europe","news_subtitle":"Trust Wallet has announced a new partnership with Revolut, allowing users across the European Economic Area (EEA) to purchase cryptocurrencies and have them delivered directly to their self-custodial Trust Wallet, eliminating the need to use centralized exchanges. According to th...","id":450,"createdAt":"2025-12-12T09:50:02.993Z","updatedAt":"2025-12-12T18:00:03.853Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693c0e3f4280278354d70b06","news_date":"2025-12-12T13:39:43.639Z","news_title":"DTCC Authorized To Launch Tokenization Service For U.S. Securities","news_subtitle":"The U.S. securities market is moving closer to large-scale tokenization after The Depository Trust & Clearing Corporation announced a major regulatory milestone. DTCC confirmed that its subsidiary, The Depository Trust Company (DTC), has received a No-Action Letter from the U.S. ...","id":454,"createdAt":"2025-12-12T13:00:03.034Z","updatedAt":"2025-12-12T18:00:03.569Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693c1ea84280278354dfd005","news_date":"2025-12-12T13:54:46.042Z","news_title":"Ethereum Gains 2% as ETF Inflows Hit $250M","news_subtitle":"Ethereum's 1-2% gain over the past 24 hours reflects a confluence of resumed institutional ETF buying, highly visible whale accumulation in the $3,000-$3,100 range, and improved order flow dynamics that have shifted the technical picture from one-way selling to defended support, ...","id":460,"createdAt":"2025-12-12T14:10:14.060Z","updatedAt":"2025-12-12T18:00:03.090Z"}]