[{"crypto_id":"1027","crypto_name":"ETH","news_id":"69403fb44280278354e1c34b","news_date":"2025-12-15T17:04:51.093Z","news_title":"Aevo's Ribbon Vaults Lose $2.7M in Oracle Exploit","news_subtitle":"Crypt News Legacy DeFi options vaults from Ribbon Finance were drained of approximately $2.7 million on Dec. 12. The attack targeted smart contracts that remained active on Ethereum despite Ribbon's 2023 rebrand to Aevo. Security analysts traced the exploit to a Dec. 6 oracle upg...","id":565,"createdAt":"2025-12-15T17:20:02.969Z","updatedAt":"2025-12-16T17:10:03.218Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69405aa942802783540fc90c","news_date":"2025-12-15T18:59:51.192Z","news_title":"BitMine Adds $321M in Ethereum to Corporate Treasury","news_subtitle":"Ethereum News BitMine Immersion Technologies purchased 102,259 Ethereum worth approximately $321.1 million last week as the firm continues accumulating toward its goal of holding 5% of the asset's total supply. The NYSE American-listed company disclosed Monday that its holdings n...","id":572,"createdAt":"2025-12-15T19:10:03.055Z","updatedAt":"2025-12-16T18:00:03.827Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69405aa942802783540fc90a","news_date":"2025-12-15T18:59:51.192Z","news_title":"JPMorgan Launches Ethereum Money Market Fund Tuesday","news_subtitle":"Ethereum News JPMorgan Chase will offer an Ethereum-based tokenized money market fund to qualified investors starting Tuesday. The private fund, called My OnChain Net Yield Fund (MONY), will be seeded with $100 million of the bank's capital before becoming accessible to eligible ...","id":573,"createdAt":"2025-12-15T19:10:03.332Z","updatedAt":"2025-12-16T18:00:04.116Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69405bd44280278354104db8","news_date":"2025-12-15T19:04:51.181Z","news_title":"Ripple Expands RLUSD Stablecoin to Ethereum L2 Networks","news_subtitle":"Ripple News Ripple is testing its RLUSD stablecoin on Optimism, Base, Ink, and Unichain ahead of plans to launch on layer-2 blockchains next year. The payments-focused blockchain firm tapped Wormhole and its Native Token Transfers token standard to enable cross-chain movement, ac...","id":574,"createdAt":"2025-12-15T19:20:03.208Z","updatedAt":"2025-12-16T18:00:03.541Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"694062de4280278354144940","news_date":"2025-12-15T19:34:51.061Z","news_title":"J.P. Morgan Launches Tokenized Money Market Fund on Ethereum","news_subtitle":"MONY makes J.P. Morgan the first GSIB to offer a public blockchain money market fund. Investors can subscribe, redeem, and hold fund tokens using cash or stablecoins. The fund combines U.S. Treasury safety with blockchain-enabled transparency and efficiency. J.P. Morgan Asset Man...","id":608,"createdAt":"2025-12-16T17:20:03.530Z","updatedAt":"2025-12-16T18:00:04.414Z"}]