[{"crypto_id":"1027","crypto_name":"ETH","news_id":"6935c54542802783540d0530","news_date":"2025-12-07T18:19:46.034Z","news_title":"UK Locks In Ethereum Property Rights as Futures Bets Rebuild","news_subtitle":"UK cements Ethereum property rights as digital assets gain legal clarity while ETH futures open interest rebuilds after October crash.","id":245,"createdAt":"2025-12-07T18:30:02.159Z","updatedAt":"2025-12-08T16:10:06.111Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6935d482428027835415ba71","news_date":"2025-12-08T00:14:40.422Z","news_title":"Ethereum Supply on Exchanges Plunges to Lowest Level Since 2015","news_subtitle":"Ethereum’s liquid supply has fallen to a historic low, marking one of the most important structural developments for the asset in nearly a decade. According to the latest data from Glassnode, only 8.7% of all ETH now remains on centralized exchanges. This is the lowest level reco...","id":248,"createdAt":"2025-12-07T19:40:03.551Z","updatedAt":"2025-12-08T03:20:03.146Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69361f7b42802783544255de","news_date":"2025-12-08T00:44:40.005Z","news_title":"Breakthrough: Brevis Launches the ProverNet Mainnet Beta to Revolutionize ZK Proofs","news_subtitle":"BitcoinWorld Breakthrough: Brevis Launches the ProverNet Mainnet Beta to Revolutionize ZK Proofs The world of zero-knowledge (ZK) proofs just got a major upgrade. Brevis, a leader in ZK verification, has officially launched the ProverNet mainnet beta. This isn’t just another tech...","id":252,"createdAt":"2025-12-08T01:00:02.819Z","updatedAt":"2025-12-08T01:20:03.405Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69362686428027835446162c","news_date":"2025-12-08T02:24:46.149Z","news_title":"South Korea Moves Toward Bank-Level Liability for Crypto Exchanges After Upbit Hack","news_subtitle":"South Korea is preparing to introduce one of its toughest digital-asset regulatory updates yet, as lawmakers push to impose bank-grade “no-fault” liability standards on cryptocurrency exchanges. The shift follows the November 27, 2025 Upbit hack, where attackers stole an estimate...","id":253,"createdAt":"2025-12-08T01:30:02.258Z","updatedAt":"2025-12-08T18:00:03.427Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"693643d5428027835455fed1","news_date":"2025-12-08T03:19:46.030Z","news_title":"Ethereum Supply Crunch Intensifies as Exchange Balances Hit Decade Low","news_subtitle":"Ethereum News Ethereum balances on centralized exchanges fell to 8.7% last Thursday, marking the lowest level since the network launched in mid-2015 and setting up conditions for a potential supply squeeze. The amount of Ether held on exchanges remained at 8.8% on Sunday, accordi...","id":256,"createdAt":"2025-12-08T03:30:03.009Z","updatedAt":"2025-12-08T18:00:02.902Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6936475d428027835457db3a","news_date":"2025-12-08T03:34:51.176Z","news_title":"Ethereum May Soon Get On-Chain Gas Futures Market as Vitalik Targets Fee Stability","news_subtitle":"Ethereum co-founder Vitalik Buterin has proposed the creation of an on-chain gas futures market to help users secure predictable transaction costs as Ethereum adoption accelerates. The idea, shared in a detailed post on X, aims to give traders, developers and institutions a relia...","id":258,"createdAt":"2025-12-08T03:50:02.867Z","updatedAt":"2025-12-08T18:00:03.078Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6936a0674280278354aa69cc","news_date":"2025-12-08T09:54:46.087Z","news_title":"Aztec Network Raises $61M in Community-First Token Sale","news_subtitle":"Aztec Token News Aztec Network closed its public AZTEC token sale on Saturday, collecting 19,476 Ethereum from more than 16,700 participants in what the privacy-focused Ethereum layer-2 developer claims represents a shift away from insider-dominated token launches. The sale ran f...","id":273,"createdAt":"2025-12-08T10:10:02.304Z","updatedAt":"2025-12-08T18:00:02.704Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6936f7234280278354e1b037","news_date":"2025-12-08T16:59:46.091Z","news_title":"BlackRock Files for Ethereum ETF That Earns Rewards for Investors","news_subtitle":"BlackRock, the world’s largest asset manager, has asked U.S. regulators to authorize a fund called ETHB, a product meant to […] The post BlackRock Files for Ethereum ETF That Earns Rewards for Investors appeared first on Coindoo.","id":289,"createdAt":"2025-12-08T16:20:06.086Z","updatedAt":"2025-12-08T18:00:03.250Z"}]