[{"crypto_id":"1027","crypto_name":"ETH","news_id":"69590041428027835432ba9c","news_date":"2026-01-04T10:00:49.715Z","news_title":"Ethereum Whale Stuns Market with $62.3M Withdrawal from Exchanges, Signaling Major Accumulation","news_subtitle":"BitcoinWorld Ethereum Whale Stuns Market with $62.3M Withdrawal from Exchanges, Signaling Major Accumulation A significant and mysterious Ethereum whale has executed a stunning $62.3 million withdrawal from multiple major cryptocurrency exchanges within a mere 12-hour window, a m...","id":1271,"createdAt":"2026-01-03T11:50:04.122Z","updatedAt":"2026-01-04T12:40:03.518Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69594b4042802783545a2a0c","news_date":"2026-01-03T23:30:41.221Z","news_title":"Bitmine Deepens Ethereum Staking Exposure With $259 Million Deposit","news_subtitle":"According to onchain data shown in the attached image, Bitmine significantly increased its Ethereum staking activity by depositing 82,560 ETH, valued at approximately $259 million, into the Ethereum proof-of-stake deposit contract earlier today. The transaction history displayed ...","id":1283,"createdAt":"2026-01-03T17:10:02.703Z","updatedAt":"2026-01-04T17:10:14.682Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69599d4c4280278354c5dd68","news_date":"2026-01-04T10:00:49.715Z","news_title":"Ethereum Breaks Above 21-Day MA Indicating New Uptrend","news_subtitle":"Ethereum (ETH) has recently broken above its 21-Day Moving Average (MA), a crucial technical level. According to crypto analyst CryptoMichNL, this move indicates that Ethereum may be starting a new uptrend. A break above the 21-Day MA typically signals the end of a bearish phase ...","id":1289,"createdAt":"2026-01-03T23:00:03.278Z","updatedAt":"2026-01-04T18:00:03.666Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6959e844428027835418057f","news_date":"2026-01-04T10:00:49.715Z","news_title":"Ethereum starts large gas limit increases in 2026 through BALs and ePBS","news_subtitle":"Ethereum co-founder Vitalik Buterin shared on X today that he believes zk-EVMs are going to become the main way Ethereum validates blocks between 2027 and 2030. “The trilemma has been solved – not on paper, but with live running code, of which one half (data availability sampling...","id":1293,"createdAt":"2026-01-04T04:30:02.611Z","updatedAt":"2026-01-04T18:00:02.589Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695a6b8842802783547977c8","news_date":"2026-01-04T14:20:41.303Z","news_title":"Ethereum Shows Signs of Trend Reversal as Descending Channel Breaks","news_subtitle":"The breakout comes after repeated defenses of the lower support zone, suggesting sellers are losing momentum while buyers gradually regain […] The post Ethereum Shows Signs of Trend Reversal as Descending Channel Breaks appeared first on Coindoo.","id":1304,"createdAt":"2026-01-04T14:00:03.498Z","updatedAt":"2026-01-04T15:50:08.771Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695a89fe428027835489ee80","news_date":"2026-01-04T15:40:43.841Z","news_title":"Vitalik Says Ethereum Enters New Era With PeerDAS and ZK","news_subtitle":"PeerDAS brings live data availability sampling to Ethereum, supporting higher throughput without sacrificing decentralization. ZK-EVMs reached alpha production performance, setting the path toward ZK-based block validation from 2027 onward. Erasure coding and sampling let light c...","id":1305,"createdAt":"2026-01-04T16:00:03.184Z","updatedAt":"2026-01-04T18:00:02.286Z"}]