[{"crypto_id":"1027","crypto_name":"ETH","news_id":"697a01894280278354346be9","news_date":"2026-01-29T11:55:42.728Z","news_title":"Ethereum Set to Launch AI Agent Standard ERC-8004 on Mainnet","news_subtitle":"Ethereum is preparing to deploy ERC-8004, a new smart contract standard built for trustless AI agent interaction. The post Ethereum Set to Launch AI Agent Standard ERC-8004 on Mainnet appeared first on TheCoinrise.com.","id":2181,"createdAt":"2026-01-28T12:50:04.040Z","updatedAt":"2026-01-29T12:40:03.712Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"697a4ee042802783548b4bce","news_date":"2026-01-29T11:55:42.728Z","news_title":"Fidelity Enters Onchain Finance With the Launch of Its First Stablecoin","news_subtitle":"Fidelity Investments is making a big move into onchain finance with its first stablecoin, called the Fidelity digital dollar The post Fidelity Enters Onchain Finance With the Launch of Its First Stablecoin appeared first on TheCoinrise.com.","id":2201,"createdAt":"2026-01-28T18:20:03.132Z","updatedAt":"2026-01-29T18:00:03.447Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"697a63fb428027835499fb8e","news_date":"2026-01-29T17:25:59.516Z","news_title":"Valour Secures FCA Approval, Marking a Major Breakthrough for Crypto ETPs UK","news_subtitle":"This article was first published on TurkishNY Radio. Valour, a part of DeFi Systems, has received official approval from the US Financial Conduct Authority (FCA) to begin offering its authorized crypto exchange-traded products to private investors. The decision is a major regulat...","id":2203,"createdAt":"2026-01-28T19:50:03.616Z","updatedAt":"2026-01-29T18:00:04.087Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"697a79134280278354a98d0c","news_date":"2026-01-28T20:52:53.204Z","news_title":"Optimism Governance Approves Revolutionary OP Token Buyback Plan, Boosting Investor Confidence","news_subtitle":"BitcoinWorld Optimism Governance Approves Revolutionary OP Token Buyback Plan, Boosting Investor Confidence In a landmark decision for decentralized finance, the Optimism governance community has overwhelmingly approved a pioneering plan to directly tie the value of its OP token ...","id":2204,"createdAt":"2026-01-28T21:20:03.624Z","updatedAt":"2026-01-29T18:00:03.769Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"697ab14e4280278354d1f96e","news_date":"2026-01-29T11:55:42.728Z","news_title":"Fidelity Plans to Launch New Ethereum Stablecoin","news_subtitle":"Fidelity introduces the Fidelity Digital Dollar on Ethereum, enhancing digital asset utility. Kanalcoin is the original publisher of Fidelity Plans to Launch New Ethereum Stablecoin.","id":2209,"createdAt":"2026-01-29T04:50:03.972Z","updatedAt":"2026-01-29T18:00:04.405Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"697b36e742802783545059b9","news_date":"2026-01-29T11:55:42.728Z","news_title":"Fidelity Plans FIDD Stablecoin Launch to Support Onchain Dollar Payments and Settlement","news_subtitle":"Fidelity launches FIDD to support onchain payments and dollar settlements under a regulated financial framework. The Fidelity Digital Dollar offers one to one redemption while operating on the Ethereum mainnet. Stablecoin growth pushes major asset managers to expand digital dolla...","id":2216,"createdAt":"2026-01-29T10:50:02.729Z","updatedAt":"2026-01-29T18:00:03.118Z"}]