[{"crypto_id":"1027","crypto_name":"ETH","news_id":"697c96774280278354904550","news_date":"2026-01-30T18:22:54.241Z","news_title":"Why Vitalik Buterin Just Pulled 16,384 ETH From His Holdings","news_subtitle":"Ethereum co-founder Vitalik Buterin just withdrew 16,384 ETH from his personal holdings. The funds will go toward projects the Ethereum Foundation can no longer take on. Buterin announced that the EF is entering a “period of mild austerity” over the next five years. The foundatio...","id":2246,"createdAt":"2026-01-30T11:50:02.960Z","updatedAt":"2026-01-31T14:40:02.671Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"697d706e42802783544dc647","news_date":"2026-01-31T03:22:54.611Z","news_title":"Vitalik Buterin Leads Ethereum Foundation through Strategic Tightening","news_subtitle":"Vitalik Buterin outlines Ethereum Foundation's shift to controlled financial tightening. Personal Ethereum is allocated towards open-source and verifiable infrastructure projects. Continue Reading:Vitalik Buterin Leads Ethereum Foundation through Strategic Tightening The post Vit...","id":2265,"createdAt":"2026-01-31T08:50:03.526Z","updatedAt":"2026-01-31T18:00:02.442Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"697d4d484280278354341bac","news_date":"2026-01-31T00:22:54.404Z","news_title":"Lido Launches stVaults for Liquid Staking on Ethereum as Linea, Nansen Partner","news_subtitle":"Key Points Lido launches stVaults on Ethereum mainnet with early adoption from networks, institutions, and node operators. stVaults enable customizable, modular Ethereum staking while continuing to issue stETH. Lido, a liquid staking protocol on Ethereum, has deployed stVaults on...","id":2266,"createdAt":"2026-01-31T08:50:03.871Z","updatedAt":"2026-01-31T18:00:02.794Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"697e12284280278354e3b512","news_date":"2026-01-31T14:22:56.764Z","news_title":"Binance Reports Key Factors in October Market Crash","news_subtitle":"Binance's report attributes October flash crash to macroeconomic shocks, market controls, and Ethereum congestion. Read original article on coincu.com","id":2276,"createdAt":"2026-01-31T16:50:03.042Z","updatedAt":"2026-01-31T18:00:03.145Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"697dbdc74280278354a7ef56","news_date":"2026-01-31T08:22:54.766Z","news_title":"Vitalik Buterin Announces Ethereum Foundation's Austerity Plan","news_subtitle":"Ethereum Foundation enters mild austerity for sustainability, says co-founder Vitalik Buterin. ETH faces market pressure. Read original article on coinlive.me","id":2277,"createdAt":"2026-01-31T16:50:03.398Z","updatedAt":"2026-01-31T18:00:03.849Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"697d1c0f428027835410eb93","news_date":"2026-01-30T20:42:53.164Z","news_title":"BREAKING: Binance Releases Statement Regarding Claims That the October 10 Crash Was Their Fault","news_subtitle":"Binance has issued a statement regarding the October 10th crash, which some believe is the reason the cryptocurrency market has failed to recover since then. Continue Reading: BREAKING: Binance Releases Statement Regarding Claims That the October 10 Crash Was Their Fault","id":2278,"createdAt":"2026-01-31T16:50:03.750Z","updatedAt":"2026-01-31T18:00:03.498Z"}]