[{"crypto_id":"1027","crypto_name":"ETH","news_id":"696b52994280278354c1fcff","news_date":"2026-01-17T17:32:53.494Z","news_title":"Ethereum Founder Vitalik Buterin Releases Statement on the Future of ETH","news_subtitle":"Ethereum founder Vitalik Buterin spoke about the future of ETH and offered some self-criticism. Here are all the details. Continue Reading: Ethereum Founder Vitalik Buterin Releases Statement on the Future of ETH","id":1827,"createdAt":"2026-01-17T09:30:03.186Z","updatedAt":"2026-01-18T09:40:02.868Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696c12c742802783544a504b","news_date":"2026-01-17T22:52:53.558Z","news_title":"FTX Creditors Set for March 31 Payouts After Feb. 14 Record Date","news_subtitle":"FTX creditor distributions are officially scheduled to begin on March 31, 2026, according to an update shared by Sunil, a representative closely following the FTX creditor process. The announcement provides long-awaited clarity for former FTX users still awaiting recovery of fund...","id":1857,"createdAt":"2026-01-17T23:10:02.814Z","updatedAt":"2026-01-18T18:00:02.578Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696c83474280278354a7f4a6","news_date":"2026-01-18T06:52:52.821Z","news_title":"Uniswap Governance Activates Fee Switch, Impacts UNI Supply","news_subtitle":"Uniswap governance activates the fee switch, affecting UNI token supply through significant market changes and burn mechanics. Read original article on tokentopnews.com","id":1864,"createdAt":"2026-01-18T09:50:03.907Z","updatedAt":"2026-01-18T18:00:03.203Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696ca8c94280278354bce508","news_date":"2026-01-18T09:32:53.543Z","news_title":"Moldova Plans EU-Aligned Crypto Law by 2026, Legalizes Ownership but Bans Payments","news_subtitle":"Moldova will introduce its first national cryptocurrency regulatory framework by the end of 2026, Finance Minister Andrian Gavriliță announced, marking a significant step toward formal oversight of the digital asset sector. As an EU candidate country, Moldova is designing the leg...","id":1867,"createdAt":"2026-01-18T10:40:03.954Z","updatedAt":"2026-01-18T18:00:03.523Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696cd0a14280278354d08d78","news_date":"2026-01-18T12:22:53.988Z","news_title":"Vitalik Buterin Warns Ethereum Protocol Complexity Threatens Core Decentralization Principles","news_subtitle":"Vitalik Buterin warns excessive Ethereum protocol complexity threatens trustlessness, proposes simplification after 15-year experimentation phase.","id":1871,"createdAt":"2026-01-18T15:10:03.288Z","updatedAt":"2026-01-18T16:40:04.404Z"}]