[{"crypto_id":"1027","crypto_name":"ETH","news_id":"695a6b8842802783547977c8","news_date":"2026-01-04T17:10:40.648Z","news_title":"Ethereum Shows Signs of Trend Reversal as Descending Channel Breaks","news_subtitle":"The breakout comes after repeated defenses of the lower support zone, suggesting sellers are losing momentum while buyers gradually regain […] The post Ethereum Shows Signs of Trend Reversal as Descending Channel Breaks appeared first on Coindoo.","id":1304,"createdAt":"2026-01-04T14:00:03.498Z","updatedAt":"2026-01-05T10:10:03.335Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695b2e0b42802783543f92a1","news_date":"2026-01-05T06:50:46.027Z","news_title":"Ethereum ready to solve blockchain trilemma: Vitalik Buterin","news_subtitle":"Vitalik Buterin outlined the four-year roadmap for ZK-EVMs and PeerDAS, claiming they’ve solved the long-standing blockchain trilemma with live, running code.","id":1311,"createdAt":"2026-01-05T03:30:02.858Z","updatedAt":"2026-01-05T13:20:03.475Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695a4d0e42802783546aa9e8","news_date":"2026-01-05T05:20:40.706Z","news_title":"Why JPMorgan’s Ethereum Fund Could Change How Money Market Funds Work","news_subtitle":"This Article was first published on TurkishNYR. JPMorgan has just tokenized a traditional money-market fund on the Ethereum network. JPMorgan’s fund, which it dubs the My OnChain Net Yield Fund (ticker MONY), seeded the new portfolio with $100 million of its own capital and is av...","id":1313,"createdAt":"2026-01-05T04:40:03.448Z","updatedAt":"2026-01-05T05:50:03.263Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695b76b54280278354858a85","news_date":"2026-01-05T08:30:42.880Z","news_title":"Bithumb Arbitrum Suspension: Essential Network Upgrade Halts 12 Asset Transfers on Jan. 8","news_subtitle":"BitcoinWorld Bithumb Arbitrum Suspension: Essential Network Upgrade Halts 12 Asset Transfers on Jan. 8 In a significant move for South Korean cryptocurrency traders, the major exchange Bithumb has announced a temporary suspension of deposits and withdrawals for twelve digital ass...","id":1322,"createdAt":"2026-01-05T08:50:03.397Z","updatedAt":"2026-01-05T12:40:03.704Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695b8bd1428027835490956a","news_date":"2026-01-05T11:20:43.261Z","news_title":"Ethereum Solves Trilemma With Live PeerDAS And ZKEVMs","news_subtitle":"It wants to stay decentralized, reach agreement without a central authority, and handle more activity without slowing down. This tension is often called the blockchain trilemma. According to Ethereum cofounder Vitalik Buterin, that balance is no longer theoretical. It is now runn...","id":1325,"createdAt":"2026-01-05T10:20:03.459Z","updatedAt":"2026-01-05T11:30:06.122Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695b9e8d42802783549a6db5","news_date":"2026-01-05T11:20:43.261Z","news_title":"Japan Finance Minister Backs Crypto on Stock Exchanges, Declares 2026 ‘Digital Year’","news_subtitle":"Japan wants in on the crypto ETF wave. Finance Minister Satsuki Katayama announced government support for integrating digital assets into the country’s stock and commodity exchanges. She made the statement during her New Year address at the Tokyo Stock Exchange on Monday. Katayam...","id":1331,"createdAt":"2026-01-05T11:40:04.125Z","updatedAt":"2026-01-05T11:50:03.594Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695ba59942802783549e2637","news_date":"2026-01-05T11:50:46.513Z","news_title":"Ethereum New Addresses Surge 110% After Fusaka Upgrade","news_subtitle":"A significant surge in the on-chain user activity has been witnessed soon after the Fusaka upgrade rolled out in early December, with new addresses going up over 110% in the last month. Glassnode data reveals that the network is now adding around 292,000 new addresses every day, ...","id":1334,"createdAt":"2026-01-05T12:00:02.770Z","updatedAt":"2026-01-05T16:50:03.891Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695bb14f4280278354a44f3f","news_date":"2026-01-05T12:40:45.288Z","news_title":"Neobanks Will Drive Ethereum Growth in 2026, Says Ether.fi CEO","news_subtitle":"Ethereum News Ethereum's next phase will be defined by financial products that feel familiar to everyday users rather than speculation-driven activity, according to Ether.fi CEO and co-founder Mike Silagadze. The network's 2026 growth will come from crypto-native neobanking produ...","id":1337,"createdAt":"2026-01-05T12:50:02.999Z","updatedAt":"2026-01-05T18:00:03.367Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695bb3a84280278354a56947","news_date":"2026-01-05T12:50:47.189Z","news_title":"BitMine Stakes $259M More ETH as Ethereum Entry Queue Nears 1M","news_subtitle":"Ethereum News BitMine Immersion Technologies deposited another 82,560 Ethereum worth roughly $259 million to Ethereum's staking system, intensifying congestion in the network's validator entry queue as institutional demand for yield builds. The Ether treasury firm sent multiple l...","id":1339,"createdAt":"2026-01-05T13:00:08.362Z","updatedAt":"2026-01-05T18:00:02.728Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695bbaac4280278354a8c006","news_date":"2026-01-05T13:20:41.814Z","news_title":"SlowMist Warns MetaMask Users of Sophisticated Fake 2FA Phishing Scam","news_subtitle":"Blockchain security firm SlowMist has raised the alarm over a new and highly convincing phishing campaign targeting MetaMask users. Unlike earlier scams that relied on obvious fake links or direct wallet drainers, this attack is more subtle. It exploits user trust by copying Meta...","id":1344,"createdAt":"2026-01-05T13:30:03.506Z","updatedAt":"2026-01-05T16:50:03.554Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695bc8bd4280278354af6139","news_date":"2026-01-05T14:20:41.563Z","news_title":"Grayscale ETHE Staking Rewards: A Transformative Milestone for U.S. Crypto Investors","news_subtitle":"BitcoinWorld Grayscale ETHE Staking Rewards: A Transformative Milestone for U.S. Crypto Investors In a landmark move for the digital asset industry, Grayscale Investments announced on March 15, 2025, that it will begin distributing staking rewards from its Ethereum Trust (ETHE) d...","id":1348,"createdAt":"2026-01-05T14:30:02.896Z","updatedAt":"2026-01-05T18:00:03.681Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695be98e4280278354c175f7","news_date":"2026-01-05T16:40:44.418Z","news_title":"Ethereum Stablecoin Volume Doubled to New ATH of $8T in Q4 2025","news_subtitle":"Ethereum News Stablecoin transfer volume on Ethereum surpassed $8 trillion in the fourth quarter of 2025, marking a new all-time high, Token Terminal reported on Monday. The $8 trillion milestone is almost double the transfer volume figure for the second quarter, which was just o...","id":1354,"createdAt":"2026-01-05T17:00:02.336Z","updatedAt":"2026-01-05T18:00:03.044Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695be9944280278354c17dd3","news_date":"2026-01-05T16:40:44.418Z","news_title":"Grayscale Makes History With First U.S. Ethereum ETP Staking Payout","news_subtitle":"Grayscale has taken a major step in the evolution of crypto investment products, announcing the first-ever distribution of Ethereum staking rewards by a U.S.-listed spot crypto ETP. The payout was made through its flagship Ethereum product, now renamed the Grayscale Ethereum Stak...","id":1355,"createdAt":"2026-01-05T17:00:03.404Z","updatedAt":"2026-01-05T18:00:04.002Z"}]