[{"crypto_id":"1027","crypto_name":"ETH","news_id":"696940e742802783543dc0a2","news_date":"2026-01-15T19:32:53.617Z","news_title":"Shiba Inu Marketing Lead Explains SOU Compensation Framework Post-Shibarium Hack","news_subtitle":"Lucie announces SHIB Owes You (SOU) recovery system following Shibarium exploit. The dual-layer framework uses Ethereum NFTs and BSC fundraising to compensate affected users as burn activity increases.","id":1777,"createdAt":"2026-01-15T20:30:03.810Z","updatedAt":"2026-01-16T13:20:03.822Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6969acb84280278354750cc2","news_date":"2026-01-16T03:12:54.748Z","news_title":"Zero Knowledge Proof: Powering Private and High-Performance Computation Across Blockchains","news_subtitle":"Blockchain networks often struggle with a major challenge: platforms like Ethereum cannot perform complex computations without high gas fees and exposing sensitive information publicly. Zero Knowledge Proof (ZKP) addresses this issue through ZK Wrappers, cryptographic tools that ...","id":1787,"createdAt":"2026-01-16T04:20:04.013Z","updatedAt":"2026-01-16T13:10:03.776Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696a0a794280278354ca887c","news_date":"2026-01-16T09:52:54.416Z","news_title":"KBC Crypto Trading Launch: Belgian Bank’s Bold Move into Bitcoin and Ethereum Services","news_subtitle":"BitcoinWorld KBC Crypto Trading Launch: Belgian Bank’s Bold Move into Bitcoin and Ethereum Services In a landmark development for European finance, Belgian banking giant KBC has confirmed plans to offer Bitcoin (BTC) and Ethereum (ETH) trading services starting February 16, 2025,...","id":1793,"createdAt":"2026-01-16T10:10:03.456Z","updatedAt":"2026-01-16T18:00:03.842Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696a36ff4280278354e379d3","news_date":"2026-01-16T13:02:53.692Z","news_title":"Belgium’s KBC Bank to Offer Bitcoin Trading to Retail Customers","news_subtitle":"KBC will launch Bitcoin and Ethereum trading on Bolero in February 2026, as CoinCodex projects 2027 downside.","id":1804,"createdAt":"2026-01-16T13:20:03.542Z","updatedAt":"2026-01-16T18:00:04.131Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696a39574280278354e4ab8e","news_date":"2026-01-16T13:12:53.597Z","news_title":"Ethereum Active Users Double as Transactions Hit ATH, Glassnode Reports","news_subtitle":"Ethereum News Activity retention on the Ethereum network has nearly doubled over the past month, jumping from just over 4 million to around 8 million addresses in January. Crypto on-chain analytics platform Glassnode reported Thursday that month-over-month activity retention show...","id":1805,"createdAt":"2026-01-16T13:30:02.140Z","updatedAt":"2026-01-16T18:00:02.975Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696a53224280278354f2fa3d","news_date":"2026-01-16T15:02:53.558Z","news_title":"ETH Spot ETF Buying Outpaces New Supply: Stunning $474.6M Weekly Inflow Signals Major Institutional Shift","news_subtitle":"BitcoinWorld ETH Spot ETF Buying Outpaces New Supply: Stunning $474.6M Weekly Inflow Signals Major Institutional Shift In a stunning development for digital asset markets, weekly ETH spot ETF buying has decisively outpaced new Ethereum supply, marking a pivotal shift in instituti...","id":1809,"createdAt":"2026-01-16T15:20:02.246Z","updatedAt":"2026-01-16T18:00:03.552Z"}]