[{"crypto_id":"1027","crypto_name":"ETH","news_id":"695e6e95428027835459494a","news_date":"2026-01-08T10:02:48.519Z","news_title":"Morgan Stanley Files for Ethereum ETF With SEC, Signaling Major Institutional Push","news_subtitle":"Morgan Stanley has taken another major step into digital assets by filing with the US SEC to launch an Ethereum exchange-traded fund (ETF). The proposed product, named the Morgan Stanley Ethereum Trust, comes from Morgan Stanley Investment Management, which oversees more than $1....","id":1423,"createdAt":"2026-01-07T14:50:03.584Z","updatedAt":"2026-01-08T14:50:03.761Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695e8ab84280278354693335","news_date":"2026-01-08T10:02:48.519Z","news_title":"Morgan Stanley Files Ethereum Trust With SEC","news_subtitle":"Morgan Stanley just filed for an Ethereum Trust Another Wall Street giant dives deeper into crypto! #Ethereum #MorganStanley #CryptoNews The post Morgan Stanley Files Ethereum Trust With SEC appeared first on CoinoMedia.","id":1427,"createdAt":"2026-01-07T16:50:04.215Z","updatedAt":"2026-01-08T16:30:05.819Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695f8edb42802783547d929e","news_date":"2026-01-08T11:02:48.269Z","news_title":"Ethereum Finalizes Fusaka Scaling Milestone with BPO-2 Implementation","news_subtitle":"Quick Breakdown Ethereum developers successfully executed the BPO-2 fork on Wednesday, January 7, 2026, marking the final planned phase of the Fusaka upgrade cycle. The update increases the network’s data availability capacity by raising the target blob count to 14 and the maximu...","id":1454,"createdAt":"2026-01-08T11:20:04.146Z","updatedAt":"2026-01-08T18:00:03.718Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695eb28f4280278354a36e27","news_date":"2026-01-08T13:32:48.986Z","news_title":"Morgan Stanley Plans Innovative ETH Spot ETF With Staking","news_subtitle":"Morgan Stanley strengthens its presence in cryptos. The American bank has filed a form with the SEC to create a spot Ethereum ETF, including a staking component. A first at this institutional level, which occurs as market interest in crypto products intensifies. Read us on Google...","id":1463,"createdAt":"2026-01-08T15:00:04.303Z","updatedAt":"2026-01-08T18:00:04.444Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"695f0946428027835407347e","news_date":"2026-01-08T01:32:49.828Z","news_title":"Ethereum Fusaka Upgrade Triumphantly Completes Final BPO-2 Stage, Slashing Future Fees","news_subtitle":"BitcoinWorld Ethereum Fusaka Upgrade Triumphantly Completes Final BPO-2 Stage, Slashing Future Fees In a landmark development for blockchain scalability, the Ethereum network has successfully finalized the Fusaka upgrade with the BPO-2 fork, a critical enhancement poised to signi...","id":1465,"createdAt":"2026-01-08T15:20:04.476Z","updatedAt":"2026-01-08T18:00:04.079Z"}]