[{"crypto_id":"1027","crypto_name":"ETH","news_id":"6970c51f4280278354c56e11","news_date":"2026-01-21T20:12:55.442Z","news_title":"Ethereum Founder Vitalik Buterin Proposes a New Solution to Enhance ETH Network Security! Here Are the Details","news_subtitle":"Vitalik Buterin has put forward a remarkable proposal to enhance the security and strengthen the decentralization of the Ethereum network. Continue Reading: Ethereum Founder Vitalik Buterin Proposes a New Solution to Enhance ETH Network Security! Here Are the Details","id":1996,"createdAt":"2026-01-21T12:40:03.189Z","updatedAt":"2026-01-22T12:30:03.875Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6971e3104280278354d44df3","news_date":"2026-01-22T08:42:53.615Z","news_title":"Taiko’s Shasta Upgrade: A Revolutionary 22x Cut in Ethereum Rollup Costs","news_subtitle":"BitcoinWorld Taiko’s Shasta Upgrade: A Revolutionary 22x Cut in Ethereum Rollup Costs In a major development for Ethereum scaling, the layer-2 project Taiko has unveiled plans for its transformative Shasta upgrade, a move poised to dramatically slash rollup operational costs by a...","id":2025,"createdAt":"2026-01-22T09:00:03.291Z","updatedAt":"2026-01-22T18:00:02.994Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6970f8d24280278354ee1d90","news_date":"2026-01-22T02:42:53.860Z","news_title":"Vitalik Buterin Introduces Novel Technique to Bolster Ethereum’s Integrity","news_subtitle":"Vitalik Buterin, the mind behind Ethereum, has unveiled a fresh staking methodology that seeks to enhance both security and decentralization of the network. This innovative plan was detailed in a technical paper on the Ethereum Research forum, where Buterin articulated the concep...","id":2029,"createdAt":"2026-01-22T11:20:03.679Z","updatedAt":"2026-01-22T16:10:03.424Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69722e1242802783540e1858","news_date":"2026-01-22T16:02:56.546Z","news_title":"Ethereum Staking Could Get Simpler With DVT, Says Buterin","news_subtitle":"Ethereum News Ethereum co-founder Vitalik Buterin has proposed integrating distributed validator technology directly into the blockchain protocol, arguing the approach would simplify staking operations while reducing reliance on single node infrastructure. The Wednesday post to E...","id":2035,"createdAt":"2026-01-22T14:20:03.127Z","updatedAt":"2026-01-22T18:00:02.614Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6971c49a4280278354bbc78e","news_date":"2026-01-22T06:32:53.692Z","news_title":"Ethereum Staking Breakthrough: Buterin’s Crucial DVT Proposal to Slash Validator Penalties","news_subtitle":"BitcoinWorld Ethereum Staking Breakthrough: Buterin’s Crucial DVT Proposal to Slash Validator Penalties In a pivotal move for the world’s leading smart contract platform, Ethereum founder Vitalik Buterin has formally proposed a fundamental upgrade to its consensus mechanism. His ...","id":2041,"createdAt":"2026-01-22T16:20:04.156Z","updatedAt":"2026-01-22T16:50:04.423Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6972539442802783542b6d5b","news_date":"2026-01-22T16:42:53.504Z","news_title":"Nasdaq Seeks Approval to Lift Limits on Crypto ETFs","news_subtitle":"Nasdaq has taken a major step toward expanding crypto-linked derivatives in the United States with the SEC The post Nasdaq Seeks Approval to Lift Limits on Crypto ETFs appeared first on TheCoinrise.com.","id":2044,"createdAt":"2026-01-22T17:00:03.499Z","updatedAt":"2026-01-22T18:00:03.740Z"}]