[{"crypto_id":"1027","crypto_name":"ETH","news_id":"696d519542802783542f26aa","news_date":"2026-01-19T11:12:53.446Z","news_title":"Japan Considers Flat 20% Crypto Tax by 2026","news_subtitle":"Japan plans to cut crypto tax rate to 20% by 2026, impacting Ethereum and Bitcoin. The article Japan Considers Flat 20% Crypto Tax by 2026 first featured on theccpress.com.","id":1881,"createdAt":"2026-01-18T21:50:04.032Z","updatedAt":"2026-01-19T18:00:03.425Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696d8e7d4280278354507b8f","news_date":"2026-01-19T01:52:59.771Z","news_title":"Ethereum Protocol Complexity Risks Core Values, Buterin Warns","news_subtitle":"Ethereum News Ethereum co-founder Vitalik Buterin argues protocol complexity threatens the network's core principles despite strong decentralization metrics. He published his concerns Sunday on X, warning that backward compatibility priorities have created unsustainable technical...","id":1887,"createdAt":"2026-01-19T02:10:02.493Z","updatedAt":"2026-01-19T18:00:02.088Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696d8e7d4280278354507b87","news_date":"2026-01-19T01:52:59.771Z","news_title":"Ethereum Validator Exits Drop to Zero as Entry Demand Surges","news_subtitle":"Ethereum News Ethereum's validator departure queue reached zero while entry requests climbed past 2.6 million Ethereum, indicating heightened staking confidence and diminished selling momentum. Exit demand dropped from September 2025's 2.67 million token peak, according to Ethere...","id":1888,"createdAt":"2026-01-19T02:10:02.799Z","updatedAt":"2026-01-19T18:00:02.425Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696dfef94280278354a8b26c","news_date":"2026-01-19T09:52:53.677Z","news_title":"Crypto Traders Pivot to Range Strategies as Bitcoin and Ethereum Volatility Cools","news_subtitle":"Quick Breakdown Matrixport data shows falling implied volatility in Bitcoin and Ethereum, signalling reduced appetite for breakout trades. Traders are monetizing range-bound markets through options strategies rather than chasing directional moves. The setup suggests consolidation...","id":1905,"createdAt":"2026-01-19T12:30:03.184Z","updatedAt":"2026-01-19T13:10:04.843Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696e2b844280278354beea6e","news_date":"2026-01-19T13:02:56.153Z","news_title":"K33 Launches Crypto-Backed Loans for Nordic Investors","news_subtitle":"K33 has officially rolled out a new crypto-backed lending service, giving clients a way to access liquidity without selling their long-term digital asset holdings. The product allows eligible users to borrow against Bitcoin or Ether, positioning K33 among the first regulated prov...","id":1909,"createdAt":"2026-01-19T13:20:03.143Z","updatedAt":"2026-01-19T14:30:03.110Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696e2b874280278354beeefc","news_date":"2026-01-19T13:02:56.153Z","news_title":"Ethereum Wants to End “Trust Me” Wallets in 2026","news_subtitle":"This article was first published on The Bit Journal. Ethereum co-founder Vitalik Buterin is pushing back on that reality, calling 2026 the year the ecosystem stops treating this as normal. The protocol has stayed trustless, but the default user path drifted into something closer ...","id":1910,"createdAt":"2026-01-19T13:20:03.470Z","updatedAt":"2026-01-19T14:30:03.444Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696e3e424280278354c8645c","news_date":"2026-01-19T14:22:56.136Z","news_title":"Ethereum DAOs face overhaul as Vitalik warns token voting has failed","news_subtitle":"Ethereum (ETH) co-founder Vitalik Buterin has outlined proposals for restructuring decentralized autonomous organizations (DAOs) in the cryptocurrency ecosystem, according to statements published by the developer. Buterin stated that the Ethereum ecosystem requires more DAOs but ...","id":1915,"createdAt":"2026-01-19T14:40:03.303Z","updatedAt":"2026-01-19T18:00:02.769Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"696e3e434280278354c864e9","news_date":"2026-01-19T14:22:56.136Z","news_title":"Binance Australia Restores AUD Deposits, Withdrawals After 2-Year Pause","news_subtitle":"Binance Australia has resumed Australian dollar (AUD) deposits and withdrawals, which had been suspended for almost two years in mid-2023 as the exchange was subjected to pressure and banking issues. Binance Australia resumed the service for its verified customers in January 2026...","id":1916,"createdAt":"2026-01-19T14:40:03.627Z","updatedAt":"2026-01-19T18:00:03.096Z"}]