[{"crypto_id":"1027","crypto_name":"ETH","news_id":"6966a4ef42802783545165fb","news_date":"2026-01-14T16:42:59.662Z","news_title":"Polygon Labs Buys Coinme and Sequence in $250M Push Into Payments","news_subtitle":"What Did Polygon Agree to Buy? Polygon Labs has agreed to acquire U.S.-based crypto payments firm Coinme and wallet infrastructure provider Sequence in transactions valued at more than $250 million, according to a report by Fortune. The deals give the Ethereum scaling network dir...","id":1690,"createdAt":"2026-01-13T20:20:04.708Z","updatedAt":"2026-01-14T18:00:02.829Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6966b0a242802783545871e7","news_date":"2026-01-13T20:52:48.281Z","news_title":"Polygon Labs Invests $250M to Build Open Money Stack","news_subtitle":"Polygon Labs, the firm behind the Layer-1 blockchain, often dubbed the Ethereum killer, is making a big move to boost global The post Polygon Labs Invests $250M to Build Open Money Stack appeared first on TheCoinrise.com.","id":1691,"createdAt":"2026-01-13T21:10:04.187Z","updatedAt":"2026-01-14T18:00:02.559Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"6966948342802783544830ef","news_date":"2026-01-14T14:52:49.353Z","news_title":"Coinlocally Faces Heightened Scrutiny as Safety Reviews and User Complaints Raise Red Flags","news_subtitle":"Coinlocally currently operates without valid regulatory authorization, a factor commonly viewed as a significant risk indicator within the trading industry. Read original article on coinwy.com","id":1707,"createdAt":"2026-01-14T12:40:04.126Z","updatedAt":"2026-01-14T18:00:03.094Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69679b044280278354f4fd13","news_date":"2026-01-14T13:32:50.323Z","news_title":"BitMine Stakes 186K ETH as Total Reaches 1.53M Tokens","news_subtitle":"Ethereum News Ethereum digital asset treasury BitMine recently deposited 186,560 tokens worth approximately $625 million to the Beacon Chain, bringing the firm's total staked holdings to 1,530,784 Ethereum valued at roughly $5.13 billion. The latest deposit represents 4% of the 3...","id":1709,"createdAt":"2026-01-14T13:52:18.152Z","updatedAt":"2026-01-14T18:00:02.290Z"},{"crypto_id":"1027","crypto_name":"ETH","news_id":"69675e164280278354d45e71","news_date":"2026-01-14T09:12:50.065Z","news_title":"DZ Bank gains MiCAR approval for meinKrypto retail trading","news_subtitle":"Germany’s second-largest banking group, DZ Bank, has received authorization under the European Union’s Markets in Crypto-Assets Regulation (MiCAR), enabling it to launch its crypto trading platform, meinKrypto. The approval was granted by Germany’s financial regulator, the Federa...","id":1720,"createdAt":"2026-01-14T15:40:04.061Z","updatedAt":"2026-01-14T18:00:03.366Z"}]