[{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T17:58:07.370Z","text_content":"Market activity has cooled into a pause rather than a push. $DOGE is consolidating after a roughly 3% dip over five days, with price stabilizing near recent levels. In contrast, Lighter LIT adds a utility focused angle as a zk rollup DEX backed by a16z, now live on BingX with zero fee trading and a 50K USDT Listing Carnival running until Jan 6, 2026. Will structured incentives help LIT gain traction as the market resets?","gravity_id":"372420501","id":57761,"createdAt":"2025-12-30T18:00:14.276Z","updatedAt":"2025-12-30T22:30:15.494Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T18:13:17.074Z","text_content":"$DOGE has completed a sharp pullback and is now stabilizing above the 0.120–0.121 demand zone. Sellers attempted to push price lower, but downside continuation failed, showing weakening selling pressure.\nOn lower timeframes, price is forming a tight base with repeated defenses of the same support area. This kind of structure often precedes a short-term expansion move once liquidity builds.\n\nAs long as  $DOGE holds above 0.120, upside recovery toward nearby resistance levels remains valid. A clean breakdown below this zone would invalidate the setup.\n\nSupport Zones:\n• 0.1230 – 0.1205 (intraday demand)\n• 0.1188 – 0.1165 (major structure support)\nResistance Zones:\n• 0.1265 – 0.1285 (local supply)\n• 0.1350 – 0.1450 (major recovery zone)\nWait for dips, manage risk properly, and secure profits step by step as targets start hitting.","gravity_id":"372421426","id":57785,"createdAt":"2025-12-30T18:20:13.211Z","updatedAt":"2025-12-30T22:40:14.961Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T18:42:55.439Z","text_content":"Market Analysis: Assessing DOGE’s $0.12 Support Level  Dogecoin ($DOGE ) has entered a stabilization phase at the $0.12 horizontal support. Despite significant drawdown, the asset is showing signs of sell-side exhaustion. From a market structure perspective, this zone represents a major liquidity pocket where historical demand has been dense. Stability at this juncture is necessary to confirm a local bottom and facilitate a transition into a constructive accumulation range.  #DOGE  #Memecoins  #SupportLevel  #MarketAnalysis  #CryptoTrendSeer","gravity_id":"372422625","id":57834,"createdAt":"2025-12-30T18:50:13.247Z","updatedAt":"2025-12-30T22:50:15.188Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T18:58:11.705Z","text_content":"$DOGE  / $USD - Update \r \r Awaiting big bids down at 0.091c. See you there.","gravity_id":"372420878","id":57849,"createdAt":"2025-12-30T19:00:13.543Z","updatedAt":"2025-12-31T01:40:14.982Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T19:28:45.061Z","text_content":"Chasing the Top Meme Coins That Will Explode in 2026? Join APEMARS Early Access Before Mog Coin and Dogecoin Catch Up\n\nhttps://deythere.com/looking-for-the-meme-coins-that-will-explode-apemars-mog-and-doge/\n\n#apemars #Crypto #SponsoredArticle ","gravity_id":"372422928","id":57896,"createdAt":"2025-12-30T19:30:13.015Z","updatedAt":"2025-12-31T01:50:15.142Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T20:06:31.367Z","text_content":"$DOGE doge alone doge alone","gravity_id":"372423360","id":57938,"createdAt":"2025-12-30T20:10:13.719Z","updatedAt":"2025-12-31T03:30:16.131Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T20:10:45.103Z","text_content":"2025 Milestones\n\nThey say a giant can only be truly seen from a distance so let’s take a step back and review some of the major developments that the Internet Computer has seen this year.\n\n1/7\nChain Fusion Developments - Bitcoin \n\nIn 2025, ckBTC supply doubled from ~200 to ~400 BTC. This demonstrates growing, real BTC usage on ICP enabling more efficient, scalable Bitcoin operations.\n\nCheck out this graphic explanation of BTC on ICP:\nhttps://t.co/vnaNEvnrBK \n\nFor a simple explanation on why Bitcoin DeFi is massive, watch this:\nhttps://t.co/y6306JT5vJ\n\n2/7\nChain Fusion Developments - Solana\n\nICP canisters can now call any Solana smart contract via a native RPC canister. This enables seamless cross-chain apps where ICP acts as a secure compute and orchestration layer for Solana.\n\nThis demo shows how to control SOL assets from ICP smart contracts:\nhttps://t.co/cMeSQq2qZ1\n\n3/7\nChain Fusion Developments - Dogecoin\n\nThe Internet Computer now supports a native Dogecoin canister, enabling trust-minimized DOGE interactions onchain. \n\nhttps://internetcomputer.org/docs/building-apps/chain-fusion/dogecoin/overview \n\n4/7\nGovernance upgrades\n\nDisbursing maturity, an address book, and privacy mode reduce friction for everyday governance participation. Together with many other governance enhancements that happened this year, they make the Network Nervous System (NNS) more user-friendly without compromising decentralization.\n\n5/7\nEnhanced Privacy\n\nInternet Identity 2.0  delivers a more powerful, flexible, and privacy-preserving authentication system. It strengthens ICP’s position as the only blockchain offering true passwordless, Web3-native identity at scale.\n\nLearn more about II 2.0: https://t.co/T0DNZo4Jsm\n\n6/7\nICP Ninja & AI dApps\n\nThis year, we made it possible for you to add LLMs & AI workers to your dapp in just a few minutes.\n\nOn ICP Ninja, you can now find libraries in three languages used on the Internet Computer: Motoko, Rust and TypeScript but also examples of chatbot integrations you can clone:\nhttps://t.co/jZy4Rorttm\n\n7/7\n\nEND of THREAD Part I","gravity_id":"372423399","id":57950,"createdAt":"2025-12-30T20:20:07.199Z","updatedAt":"2025-12-31T06:00:15.150Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T20:16:35.831Z","text_content":"I think this is the last dip for DOGE before the major bullish wave.\n#DOGE #Dogecoin  $DOGE","gravity_id":"372424347","id":57954,"createdAt":"2025-12-30T20:20:13.073Z","updatedAt":"2025-12-31T06:20:14.349Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T20:27:58.700Z","text_content":"I'm bearish on $DOGE . Tokenomics of DOGE  is awful. They create more tokens than BTC and all other MEME coins. They should begin to burn like most coins that are performing well since they began to burn.","gravity_id":"372423478","id":57961,"createdAt":"2025-12-30T20:30:13.474Z","updatedAt":"2025-12-31T06:50:15.183Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T21:16:47.307Z","text_content":"$DOGE what a fraud.!! After ETFs approval, it doesn't show any interest for anyone. \nIt was supposed to be back to 0.40 or higher but the reality is much harder...","gravity_id":"372425473","id":58029,"createdAt":"2025-12-30T21:20:13.578Z","updatedAt":"2025-12-31T07:20:14.751Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T22:30:38.352Z","text_content":"$DOGE  – Ascending Triangle Breakout Watch  $DOGE  is trading at $0.123 USDT, coiling within an ascending triangle pattern. The chart highlights a bullish setup, with projection suggesting upside toward $0.14 USDT if buyers can break through resistance.  Momentum is building — higher lows are pressing against horizontal resistance, a classic breakout structure. A confirmed move above $0.125–$0.126 would strengthen the bullish case, while failure to hold support at $0.1199 could drag price back toward $0.1138.  📌 Key Levels:  Current price: $0.123  Support: $0.1199 → $0.1138  Breakout zone: $0.125–$0.126  Upside target: $0.14  This is a triangle breakout setup — DOGE is tightening, and the next move could be explosive. Traders should watch for volume confirmation as price approaches resistance.  #DOGE  #Macro Insights#  #Altcoin Season#  #Bullish","gravity_id":"372425968","id":58108,"createdAt":"2025-12-30T22:40:13.181Z","updatedAt":"2025-12-31T07:30:15.489Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T22:41:47.969Z","text_content":"#Dogecoin  Stabilizes at $0.12 as Losses Pile Up — Here Is Whether $DOGE  Can Hold This Level\r  ▶️ View full breakdown here: https://blocknews.com/dogecoin-stabilizes-at-0-12-as-losses-pile-up-here-is-whether-doge-can-hold-this-level/   #Macro Insights#  #Altcoin Season#  #Meme Alpha#","gravity_id":"372430050","id":58118,"createdAt":"2025-12-30T22:50:13.414Z","updatedAt":"2025-12-31T08:00:17.539Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-30T22:54:24.378Z","text_content":"$DOGE this dog has been sleeping for a while just remember eventually he needs to wake up and when he does, he’s going to want to go for a run. 🐕🐾🐾🐾🐾🐾 the question is is he going to break his leash when he goes out?","gravity_id":"372429161","id":58123,"createdAt":"2025-12-30T23:00:12.338Z","updatedAt":"2025-12-31T08:10:16.189Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T01:45:57.543Z","text_content":"$DOGE looks like we are going to 10$ soon","gravity_id":"372432252","id":58258,"createdAt":"2025-12-31T01:50:13.380Z","updatedAt":"2025-12-31T08:20:15.944Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T01:59:02.261Z","text_content":"$DOGE  ALERT BULLISH!!! Tesla appears to be preparing once again for Dogecoin payments, after a well-known Dogecoin developer discovered newly added DOGE checkout code inside Tesla’s revamped website. This has sparked that Elon Musk may finally enable Dogecoin payments for vehicles. the price is compressed like a spring . IT WILL POP ANYTIME!!!!","gravity_id":"372432327","id":58263,"createdAt":"2025-12-31T02:00:13.208Z","updatedAt":"2025-12-31T08:20:15.788Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T03:31:13.717Z","text_content":"$DOGE Time to push! :)","gravity_id":"372432870","id":58363,"createdAt":"2025-12-31T03:40:13.529Z","updatedAt":"2025-12-31T04:00:14.370Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T06:02:55.035Z","text_content":"$DOGE #ltrbt old token","gravity_id":"372434704","id":58520,"createdAt":"2025-12-31T06:10:14.709Z","updatedAt":"2025-12-31T08:50:15.462Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T06:20:47.469Z","text_content":"$DOGE  ,\r Dogecoin launched in 2013 as a meme coin and remains a Scrypt-based, inflationary digital currency popular for tipping and micro-payments. By end of 2025 its strong community and ongoing merchant integrations keep it widely traded, but prices stay volatile — always do your own research before investing. #Macro Insights#  #DOGE  #Crypto    https://transscreen.ru/en/CMK_news28720","gravity_id":"372434797","id":58540,"createdAt":"2025-12-31T06:30:13.404Z","updatedAt":"2025-12-31T09:22:49.851Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T06:55:38.983Z","text_content":"DODGE  Price Prediction: $0.12 The Lowest $DOGE   Can Go?  Key Highlights Support Level: DOGE has held steady at $0.12 since Dec. 23.  Consolidation: Price action shows sideways movement around $0.12 amid broader market slowdown.  Recent Performance (CoinGecko Data):  24h: -3%  7d: -6.3%  14d: -4.8%  1m: -17.5%  Since Dec. 2024: -61.2%  Market Sentiment: Traders question if $0.12 is the bottom, or if further dips are ahead.  Analysis #Dogecoin  ’s current footing at $0.12 has become a focal point for traders, with the token consolidating at this level despite ongoing market weakness. The steep decline since December 2024 highlights the challenges DOGE faces in regaining momentum.  While some analysts see $0.12 as a critical support zone, others warn that continued bearish sentiment could push DOGE lower. The next moves will depend heavily on overall crypto market recovery, liquidity inflows, and investor confidence. #BNBChain#  #Altcoin Season#","gravity_id":"372435038","id":58588,"createdAt":"2025-12-31T07:10:14.602Z","updatedAt":"2025-12-31T10:00:16.703Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T07:25:21.664Z","text_content":"Price looks pretty squeezed right now, and a short-term downtrend over the next couple of months wouldn’t be surprising.\n\n\nIf buyers manage to break the current downtrend and push price higher, the next levels should get targeted in sequence, just like on the chart.\n\n\nWorth keeping an eye on $DOGE as this structure plays out.\n\n\n#Meme Alpha# #Altcoin Season# #BNBChain#","gravity_id":"372435267","id":58615,"createdAt":"2025-12-31T07:30:13.823Z","updatedAt":"2025-12-31T10:00:16.546Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T07:30:00.175Z","text_content":"🚀 $DOGE  stabilizing after a selloff and attempting to base near support.  If this base continues to hold, a corrective push toward the upper channel zone could unfold.  📉 Technical View: • Pattern: descending channel with a potential base formation • Bias: bullish as long as support continues to defend recent lows • Key Level: lower channel support and the first descending resistance above  ✅Full analytics in telegram->  bit.ly/cryptolingrid   \r  \r ⚠️ This bullish scenario may be invalidated if price loses the channel support and accelerates below the recent reaction low.  #DOGE  #Dogecoin  #Doge Price Analysis#  #Meme Alpha#","gravity_id":"372435307","id":58627,"createdAt":"2025-12-31T07:41:22.957Z","updatedAt":"2025-12-31T10:10:15.817Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T08:04:45.161Z","text_content":"Crypto Updates: Join the New Meme Coin Surge Early via the APEMARS Whitelist Before It Ends, as Dogecoin and Bonk Hold Strong\n\nhttps://deythere.com/apemars-leads-as-the-top-new-meme-coin-as-dogecoin-and-bonk-gain/\n\n#apemars #Crypto #SponsoredArticle ","gravity_id":"372435571","id":58659,"createdAt":"2025-12-31T08:10:14.462Z","updatedAt":"2025-12-31T11:10:15.004Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T08:10:45.329Z","text_content":"$DOGE  ALERT!!! BREAKOUT FORMING!!!\r \r \r DOGE oversold RSI signals a potential rally to $0.25, analysts argue, as record ETF inflows and fading headwinds build a bullish case!!","gravity_id":"372435621","id":58674,"createdAt":"2025-12-31T08:20:14.270Z","updatedAt":"2025-12-31T11:10:14.847Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T08:31:28.173Z","text_content":"$DOGE  Is Compressing — And The Next Move Won’t Be Quiet   $DOGE  is currently coiling inside a tight consolidation after a sharp sell-off, signaling a classic liquidity-driven setup on the 4H timeframe. Price has swept prior lows and is now hovering above a clearly defined demand zone, where selling pressure is slowing and volatility is compressing.    This structure often precedes an explosive expansion. The inability of bears to push price decisively lower suggests weakening downside momentum, while repeated rejections to the downside point to absorption by stronger hands. If $DOGE  holds this demand and reclaims the short-term range high, a momentum shift toward the upside becomes likely, with a move back into the previous supply zone as the primary target.    However, a clean breakdown below demand would invalidate the setup and open the door for deeper continuation. DOGE is at a decision point, expansion is coming.    #BTC Price Analysis#  #Altcoin Season#  #DOGE","gravity_id":"372436745","id":58692,"createdAt":"2025-12-31T08:40:13.705Z","updatedAt":"2025-12-31T11:20:16.155Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T08:26:28.804Z","text_content":"DOGE Is Quiet And That’s the Signal Most People Miss  I’m watching $DOGE  trade around $0.123 with very little emotion on the chart, and that’s exactly the point: it’s compression. #DOGE  price has flattened, volatility has dried up, and DOGE is sitting in a zone where speculative interest has cooled, but liquidity hasn’t left.  What matters to me here is structure, not headlines. DOGE is holding a multi-week base while volume remains steady near $900M daily, which tells me this market isn’t abandoning the asset; it’s waiting. In past cycles, DOGE has never signaled its next move loudly; it moves when attention fades and positioning becomes lopsided.  As long as DOGE holds above the $0.12 support band, downside looks controlled. A reclaim of $0.13–$0.135 would be the first sign that momentum is rotating back in. Until then, this is patience territory and historically, that’s when DOGE has surprised the most.","gravity_id":"372435724","id":58693,"createdAt":"2025-12-31T08:40:13.962Z","updatedAt":"2025-12-31T11:20:16.310Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T08:25:42.171Z","text_content":"$DOGE  Determination of the nearest levels (1h): Support (0.12231); Resistance (0.12539).  https://www.tradingview.com/chart/DOGEUSDT/9unAoilC-DOGE/   Public reporting on current and previous notes - https://docs.google.com/spreadsheets/d/11D97htOm9TWjKGbf3dpMnrFNRJsmsfZIJvW58ZD7qbo/edit?gid=0#gid=0 \r \r \r #Trading  #Analysis","gravity_id":"372436717","id":58694,"createdAt":"2025-12-31T08:40:14.214Z","updatedAt":"2025-12-31T11:10:14.691Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T08:56:30.555Z","text_content":"🔥 $DOGE  — Consolidation at Strong Support 🔥  DOGE is trading at $0.1229, with a 1.27% drop in the last 24 hours. The price has been in a consolidation phase, sitting on strong support at $0.1229, which has held multiple times.  Key Levels:  Support: $0.1229 — key level to watch for potential rebounds.  Resistance: $0.1350–$0.1400 — a crucial resistance zone to break for bullish momentum.  Fundamental Insight:  Market Sentiment: DOGE remains largely driven by social media trends and community support.  Volume: At $863.89M, the market is not showing extreme activity, indicating caution among traders.  Conclusion: DOGE is consolidating near $0.1229, and any upward move will depend on breaking resistance at $0.1350–$0.1400.  #DOGE  #MemeCoins","gravity_id":"372438133","id":58724,"createdAt":"2025-12-31T09:00:15.284Z","updatedAt":"2025-12-31T11:40:15.580Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T09:29:00.098Z","text_content":"$DOGE  is trading around $0.123 on the 4H chart, continuing to range after a prolonged downtrend. Price is holding above the $0.121–0.122 support zone, but momentum remains weak. A break above $0.128–0.130 is needed for a bullish shift, while failure to hold current support could lead to another leg lower.\n#Meme Alpha#","gravity_id":"372437363","id":58758,"createdAt":"2025-12-31T09:30:13.227Z","updatedAt":"2025-12-31T11:50:15.691Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T10:08:00.091Z","text_content":"$DOGE  is trading near $0.123 on the 4H chart after a prolonged downtrend, showing signs of stabilization around the $0.121–0.122 support zone. Price action is tight and low-momentum, suggesting consolidation rather than a strong trend. A push above $0.128–0.130 is needed to shift bias bullish, while losing current support could send DOGE toward the next lower demand area.\n\n#Macro Insights#","gravity_id":"372441036","id":58821,"createdAt":"2025-12-31T10:10:13.787Z","updatedAt":"2025-12-31T11:50:15.381Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T10:06:28.476Z","text_content":"🔥🔥An investigation found that many of Elon Musk's Department of Government Efficiency cost-savings were incorrect or not as big as claimed.\n $DOGE trades at $0.1232 today, down 0.08%. Get the latest DOGE analysis and price outlook as sellers dominate the market.\n#Meme Alpha#","gravity_id":"372438656","id":58822,"createdAt":"2025-12-31T10:10:13.947Z","updatedAt":"2025-12-31T11:50:15.536Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T10:16:41.036Z","text_content":"Bitget has leveled up this time, cutting the crazy 48-hour trade series to Crazy24h, with even better rewards. Now, a single large trade is enough to earn $BGB  rewards. I’m also looking at other altcoins for the New Year. $DOGE  is on my radar, but it faces mixed sentiment: bearish traders dominate, though technical signals hint at a short-term bounce around $0.13–$0.18. ETF rumors keep long-term hopes alive, but near-term volatility is likely. ﻿#Macro Insights#  #Altcoin Season#","gravity_id":"372438714","id":58836,"createdAt":"2025-12-31T10:20:14.766Z","updatedAt":"2025-12-31T12:00:15.792Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T11:11:19.294Z","text_content":"$DOGE   near $0.11–$0.12 is being called an incredible risk/reward zone by analysts 👀  clear downside & upside potential exist if support holds. Always DYOR before making moves!      #Crypto  #CryptoTrading","gravity_id":"372437977","id":58924,"createdAt":"2025-12-31T11:20:14.475Z","updatedAt":"2025-12-31T12:30:15.678Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T10:55:17.264Z","text_content":"🌌 Finora AI Analysis for $DOGE  #DOGEUSDT  | 30m\r \r - The overall structure is bearish, with multiple indicators and price action confirming downside pressure\r - Price is trading just above the lowest point of the recent swing, so further downside is likely unless there’s a clear reversal signal\r - If price breaks below 0.12256 with momentum, a move toward 0.12064 or even 0.12010 is probable\r - Any bounce near 0.12256 should be watched closely for bearish continuation patterns or rejection at 0.12376 or 0.12537, which could offer short opportunities\r - For a high-probability short, look for price to retest and reject the 0.12376 level (with wicks or bearish engulfing on lower timeframes) before entering, targeting 0.12064 and 0.12010\r - My bias would only turn bullish if price closes decisively above 0.12537 and shows strong follow-through\r - Stop-losses for shorts should be kept above swing highs like 0.12376 or 0.12537 in case of sudden reversal\r \r This is not investment advice, only an educational report.\r \r 📊 Get detailed free analysis of any coin on any timeframe you want. Try Finora AI - Your Trade Buddy for free → tinyurl.com/FinoraBot","gravity_id":"372437885","id":58925,"createdAt":"2025-12-31T11:20:14.731Z","updatedAt":"2025-12-31T12:30:15.836Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T08:46:56.105Z","text_content":"Dogecoin — Compression Before Expansion   $DOGE  is compressing tightly above a well-defined demand zone, signaling that a decisive move is approaching. Price action shows repeated failures to break higher, but sellers are also struggling to push price lower with conviction. This stalemate often precedes volatility expansion. The recent liquidity sweep to the downside appears engineered to trap shorts, while structure remains intact above key support.   If $DOGE  holds this zone, a relief move toward prior resistance becomes highly probable. However, a clean breakdown below demand would flip the structure bearish and expose deeper downside targets. Volume behavior suggests accumulation rather than panic selling, giving bulls a slight edge in the near term.    $DOGE  is at a technical inflection point where patience pays. The next impulsive move will define direction, but the current setup favors a reaction higher before any major continuation.    #DOGE  #Altcoin Season#  #BTC Price Analysis#","gravity_id":"372437068","id":58926,"createdAt":"2025-12-31T11:20:16.026Z","updatedAt":"2025-12-31T11:20:16.026Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T11:23:14.297Z","text_content":"$DOGE closing out 2025 at ~$0.123 on the 4H chart – holding the key support after a wild ride down. Bulls defending hard, EQL in sight. 2026 moon incoming? 🚀\nMuch consolidation, very accumulate.\n\n\n#DOGE","gravity_id":"372439028","id":58944,"createdAt":"2025-12-31T11:30:13.489Z","updatedAt":"2025-12-31T13:10:18.533Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T11:22:28.199Z","text_content":"#Dogecoin at $0.123 shows resilience despite recent market consolidation holding above key support near $0.12 $DOGE memecoin continues to benefit from retail sentiment and high liquidity during short term rallies.\n\n\nMeanwhile $BGB at $3.5 is testing a breakout range signaling accumulation from strategic holders the Bitget 24 hour event could catalyze volume spikes creating opportunities for traders to capitalize on short term momentum while staying aware of macro volatility.\n\n\nBoth assets remain sensitive to #BTC driven swings but active participation in the event may tilt intraday dynamics favorably.\n\n\n#DOGE #Altcoin Season# #Meme Alpha#","gravity_id":"372440012","id":58945,"createdAt":"2025-12-31T11:30:13.746Z","updatedAt":"2025-12-31T13:10:18.760Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T11:21:01.658Z","text_content":"$DOGE  Did Elon abandon you❓","gravity_id":"372439020","id":58946,"createdAt":"2025-12-31T11:30:14.004Z","updatedAt":"2025-12-31T12:40:16.619Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T11:44:31.109Z","text_content":"$DOGE CALL TO ACTION! All people of the whole world! Let's start now!","gravity_id":"372440100","id":58979,"createdAt":"2025-12-31T11:50:13.848Z","updatedAt":"2025-12-31T13:30:15.270Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T11:58:34.366Z","text_content":"$DOGE  ranking top trending on coinmarketcap  DOGE is moving sideways for now, trading around $0.123 and holding a tight range after weeks of gradual downside. Volatility is low, volume is steady, and price action suggests consolidation rather than panic.  Sentiment across the meme coin space remains muted, with DOGE still down sharply from its 2021 highs, but support around $0.120–$0.123 continues to hold. Longer-term forecasts for 2026 are mixed, ranging from cautious to optimistic, largely depending on whether broader market momentum returns.  For now, DOGE isn’t about hype, it’s about patience and watching whether this quiet phase turns into the base for the next move.","gravity_id":"372441548","id":59002,"createdAt":"2025-12-31T12:00:14.263Z","updatedAt":"2025-12-31T14:20:15.312Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T11:52:34.972Z","text_content":"$DOGE   divergence:  DOGE is down for a pretty simple combo of no fresh catalysts + broken technicals + thinner liquidity:  • ETF “drought” = weak institutional bid: New DOGE-related products haven’t pulled meaningful inflows, so price action is still mostly retail-driven. With funding negative and open interest way off 2024 highs, traders aren’t paying up for upside.  • Technical domino effect: DOGE lost the $0.123 neckline (head-and-shoulders breakdown) and the 50/200 EMA “death cross” (Dec 9) added fuel to the selloff. RSI isn’t deeply oversold yet, so sellers may still have room.  • Altcoin liquidity crunch: Overall volumes have cooled hard, and thin liquidity magnifies moves. Futures participation is also fading (OI down), which usually means less dip-buying pressure in the short term.  Key levels: • Support zone: $0.117, then $0.11 (next major retracement/support area) • Resistance to reclaim: $0.123  What to watch 👀: Jan 9 SEC deadline on the 21Shares DOGE ETF amendment — a rejection could keep pressure on, while any surprise progress could spark a quick relief bounce (especially if fear stays elevated).","gravity_id":"372441519","id":59003,"createdAt":"2025-12-31T12:00:14.438Z","updatedAt":"2025-12-31T14:20:15.469Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T11:51:36.005Z","text_content":"The Most Watched Polymarket Bet 🚀  One question dominates attention, when will POLY hit the market?  Alongside wild markets from $TRUMP  pricing to $DOGE  use case predictions.  Still, the POLY airdrop timing remains the real catalyst.  Logic suggests volume, activity, and participation will be rewarded.  Now it’s only a matter of time.  #Altcoin Season#","gravity_id":"372439171","id":59004,"createdAt":"2025-12-31T12:00:14.598Z","updatedAt":"2025-12-31T13:40:15.253Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T12:01:53.486Z","text_content":"I was trading $DOGE  earlier, nothing serious, just warming up.   Then I checked the bitget Crazy 24H leaderboard and realized how simple it was, volume is everything. One solid push could unlock the 400 #BGB  reward.   What surprised me most? None of the top 10 had hit it yet. With under 7 hours left, it genuinely feels wide open.  $VELO  #Macro Insights#","gravity_id":"372439217","id":59025,"createdAt":"2025-12-31T12:10:14.766Z","updatedAt":"2025-12-31T14:30:14.898Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T12:36:33.050Z","text_content":"$DOGE  is repeatedly testing this trendline. If the trendline breaks and the 1D candle closes below it, then next support area is $0.08.   #Meme Alpha#  #DOGE","gravity_id":"372440382","id":59068,"createdAt":"2025-12-31T12:40:14.690Z","updatedAt":"2025-12-31T14:40:14.318Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T12:30:00.163Z","text_content":"$DOGE  brought fun and visibility to crypto. $LF   Labs brings functionality that helps crypto work for businesses, merchants, and everyday transactions.  Fun introduces people. Utility keeps them.","gravity_id":"372440337","id":59069,"createdAt":"2025-12-31T12:40:14.959Z","updatedAt":"2025-12-31T14:40:14.475Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T12:48:53.314Z","text_content":"The past year in crypto taught me one thing clearly: consistency beats noise.\n\nThere were volatile moments, wrong entries, good exits, and lessons that only time in the market can teach. Having access to solid tools, smooth execution, and a platform that doesn’t complicate things made the learning curve more manageable on #BingX\n\nGoing into the new year, the focus is simple: trade smarter, manage risk better, and stay patient. No rush, no chasing,  just steady growth and better decisions. If you’re still here, still learning, and still refining your process, you’re already ahead.\n\nWishing everyone clarity, discipline, and progress this new year. Let’s keep building, one trade at a time.\n#BingX  $DOGE  #Macro Insights#   $BTC","gravity_id":"372441822","id":59078,"createdAt":"2025-12-31T12:50:06.538Z","updatedAt":"2025-12-31T14:50:14.962Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T13:18:18.852Z","text_content":"$DOGE well every cycle, doge experiences a period when retailers believe it's done.\nWe are now in that period.","gravity_id":"372441986","id":59134,"createdAt":"2025-12-31T13:20:14.196Z","updatedAt":"2025-12-31T16:00:23.642Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T13:32:36.800Z","text_content":"$DOGE\n\n\"They talk about 'whales, but the real whales are themselves: Binance, Coinbase, and the others, along with the CEOs of coins like ADA, DOT, Ethereum, SOL, etc. Together with the U.S. government, they are looting the market. They hold all the cards and manipulate the game in whatever direction they want, exploiting small investors.\"","gravity_id":"372439703","id":59172,"createdAt":"2025-12-31T13:40:13.579Z","updatedAt":"2025-12-31T16:10:16.328Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T13:41:53.552Z","text_content":"With the broader market still mixed, $DOGE is trading around $0.1230, reflecting steady liquidity but muted momentum, while $ADA at ~$0.3398 continues to hold its range as investors weigh long-term network development against near-term catalysts. This kind of environment often shifts attention toward emerging infrastructure plays rather than purely sentiment-driven moves. Against that backdrop, the Lighter (LIT) Listing Carnival on BingX is currently live, featuring $50,000 in LIT rewards. Lighter is positioned as a zk-rollup–based perpetuals protocol on Ethereum, focused on transparent order-book trading and verifiable execution, a narrative that aligns with growing interest in scalable, trust-minimized DeFi derivatives. The event offers participants a way to engage with the ecosystem early, while observing how real usage and liquidity develop around the token post-listing.\n#BTC Price Analysis# #Macro Insights# #Altcoin Season#","gravity_id":"372444067","id":59192,"createdAt":"2025-12-31T13:50:12.545Z","updatedAt":"2025-12-31T16:10:16.166Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T14:30:05.368Z","text_content":"🚨 DOGEUSDT – Major Support Zone | LONG Only With Confirmation 🐕📈\n\nDOGE is currently trading at a key higher-timeframe support zone, where smart money waits for confirmation, not blind entries.\n\nThis is a critical decision area — not a place to force trades.\n\n🔍 Market Structure\n\nPrice is still below the 300 SMA, so macro trend remains cautious.\n\nHowever, the current zone (0.12 – 0.13) is a strong historical demand area.\n\nIf buyers step in with volume, a relief move is possible.\n\n📉 RSI Insight\n\nRSI is around 37, showing weakness but no extreme oversold condition.\n\nThis supports a wait-and-react strategy, not panic trading.\n\n🎯 Trading Signal – LONG SETUP ONLY\n\n📌 LONG Entry (Confirmation Required)\n\nEntry: Daily close and hold above 0.135\n\nStop Loss: Below 0.120\n\nTargets:\n\n🎯 TP1: 0.160\n\n🎯 TP2: 0.190\n\n🎯 TP3: 0.250+ (HTF liquidity zone)\n\n📌 If confirmation fails → NO TRADE\nCapital protection is also a winning trade.\n\n🧠 Trader’s Note\n\nThis zone can produce fake moves\n\nLet price confirm direction first\n\nDiscipline > leverage > emotions\n\n📌 The market rewards patience, not predictions.\n\n— DIZANEX\n\n#DOGEUSDT #CryptoAnalysis  $DOGE","gravity_id":"372443356","id":59264,"createdAt":"2025-12-31T14:30:13.188Z","updatedAt":"2025-12-31T16:20:16.330Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T14:21:44.991Z","text_content":"DOGE Is Quiet And That’s the Signal Most People Miss  I’m watching DOGE$DOGE  trade around $0.123 with very little emotion on the chart, and that’s exactly the point: it’s compression. #DOGE  price has flattened, volatility has dried up, and DOGE is sitting in a zone where speculative interest has cooled, but liquidity hasn’t left.   What matters to me here is structure, not headlines. DOGE is holding a multi-week base while volume remains steady near $900M daily, which tells me this market isn’t abandoning the asset; it’s waiting. In past cycles, DOGE has never signaled its next move loudly; it moves when attention fades and positioning becomes lopsided.   As long as DOGE holds above the $0.12 support band, downside looks controlled. A reclaim of $0.13–$0.135 would be the first sign that momentum is rotating back in. Until then, this is patience territory and historically, that’s when DOGE has surprised the most   #Macro Insights#   ##DOGE","gravity_id":"372443308","id":59265,"createdAt":"2025-12-31T14:30:13.453Z","updatedAt":"2025-12-31T16:20:16.490Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T14:43:54.413Z","text_content":"$DOGE What is the utility of DOGE?","gravity_id":"372444415","id":59304,"createdAt":"2025-12-31T14:50:13.263Z","updatedAt":"2025-12-31T16:50:15.578Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T14:42:41.312Z","text_content":"$DOGE  ⚠️📉 DOGE at a decision point: $0.12 is now the key support level traders are watching. As volatility tightens, the next move from this zone is unlikely to be random. https://cubeface.com/dogecoin-support-at-0-12-and-risk-reward-zone/  #DOGE  #CryptoTrading  #MarketUpdate","gravity_id":"372444410","id":59305,"createdAt":"2025-12-31T14:50:13.518Z","updatedAt":"2025-12-31T16:40:15.381Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T14:53:55.231Z","text_content":"$DOGE at $0.12323 on NYE – holding strong above $0.12 despite the dips!\nChart shows bears tried hard but we’re bouncing back. Much consolidation, very range, wow potential breakout soon? 🚀\n\n\n#DOGE","gravity_id":"372443476","id":59323,"createdAt":"2025-12-31T15:00:14.220Z","updatedAt":"2025-12-31T16:50:15.420Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T15:13:18.700Z","text_content":"$DOGE\nNo daily volume .... \nIt's not FINANCIAL ADVICE 🤭","gravity_id":"372443588","id":59357,"createdAt":"2025-12-31T15:20:13.623Z","updatedAt":"2025-12-31T17:00:17.988Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T16:02:32.767Z","text_content":"$DOGE Huge breakout session loading, be prepared for the big surprise anytime soon.","gravity_id":"372445496","id":59443,"createdAt":"2025-12-31T16:10:14.461Z","updatedAt":"2025-12-31T17:00:17.827Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T16:14:38.748Z","text_content":"$DOGE   fell 2.80% in the past 24h, underperforming Bitcoin (-0.86%) and Ethereum (-1.5%). Here are the main factors:  Weak Technical Structure – Price broke below key $0.128 support, triggering algorithmic selling  Muted ETF Impact – $DOGE   ETFs saw $2.16M inflows this week, failing to offset bearish sentiment Token Unlock Pressure – 95M $DOGE   ($11.6M) entering circulation through Jan 5  Meme Coin Rotation – Capital shifted to newer Solana-based memes like BONK (+12% vs DOGE’s #DOGE  #Dogecoin","gravity_id":"372445557","id":59460,"createdAt":"2025-12-31T16:20:14.471Z","updatedAt":"2025-12-31T17:30:15.483Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T16:13:45.051Z","text_content":"$DOGE trading volume fell 25% to $682M as year-end holiday slowdown hits crypto markets. Prices stayed range-bound, with traders eyeing a potential breakout in 2026.\n\nhttps://36crypto.com/dogecoin-faces-trading-volume-decline-as-2025-draws-to-a-close/","gravity_id":"372446562","id":59461,"createdAt":"2025-12-31T16:20:14.812Z","updatedAt":"2025-12-31T17:10:15.300Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T16:26:33.692Z","text_content":"$DOGE  hovering around $0.1208 slipping into a red zone with bearish pressure after the downswing. It’s stuck between $0.1207 and $0.1228 – the market shows a 1.14% drop lately but the trend suggests a potential continuation of the loss. Drop below $0.1207, and it could slide more; surge past $0.1228, and it may shoot up sharply.\n\n#DOGE","gravity_id":"372448009","id":59475,"createdAt":"2025-12-31T16:30:14.540Z","updatedAt":"2025-12-31T17:30:15.153Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T16:21:00.056Z","text_content":"$DOGE  has completed a major liquidity sweep and is now moving sideways in a clear consolidation phase. Price is holding near key support, suggesting selling pressure is fading and a base is forming for the next directional move.\n\n#Meme Alpha#","gravity_id":"372444978","id":59476,"createdAt":"2025-12-31T16:30:14.817Z","updatedAt":"2025-12-31T17:30:15.321Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T16:37:51.693Z","text_content":"I’m watching $DOGE  closely here. \r \r Price is compressing inside the falling wedge and still stuck below the 0.127–0.130 area, while momentum keeps diverging. \r \r For me, nothing changes until that zone is reclaimed and holds. Acceptance there would open the door higher. If it keeps rejecting, this stays consolidation, not a trend shift yet.\r \r 🚨Macro-driven events can invalidate technical setups, so manage risk accordingly #BTC Price Analysis#  #Macro Insights#  #Altcoin Season#","gravity_id":"372447058","id":59490,"createdAt":"2025-12-31T16:40:13.460Z","updatedAt":"2025-12-31T17:40:15.813Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T16:42:59.930Z","text_content":"$DOGE  ,\r Dogecoin trading volume plunged 23% as 2025 closed quietly, with overall crypto activity hitting year-low levels on Dec 31, 2025. Low liquidity could boost #Dogecoin  volatility; traders will watch for macro catalysts or exchange-driven flows ahead. \r \r #Macro Insights#  #Crypto    https://transscreen.ru/en/CMK_news28731","gravity_id":"372445702","id":59506,"createdAt":"2025-12-31T16:50:14.134Z","updatedAt":"2025-12-31T17:40:15.655Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T16:59:27.122Z","text_content":"Despite the $DOGE  current price of $0.1188, on-chain metrics show a worrying divergence. Whale wallets have been largely dormant this month, and exchange inflows are slightly increasing, suggesting that large holders are still offloading positions before the year ends. While the \"DEX Mode\" feature seen in the interface suggests a move toward more utility, retail engagement for the \"Meme King\" is at a 12-month low. The -1.83% drop on the 4h chart confirms that intraday buyers are failing to defend the local EMA levels.  Short-term: Expect continued sideways \"choppiness\" or a final liquidity hunt toward $0.1080 to flush out remaining long positions. Mid-term: Recovery depends heavily on a macro rotation back into high-beta assets in Q1 2026. Unless a major payment integration is announced, $DOGE   will likely underperform compared to utility-driven chains. Stay disciplined and avoid catching falling knives.  #Dogecoin  #OnChain  🐕","gravity_id":"372446802","id":59524,"createdAt":"2025-12-31T17:00:16.531Z","updatedAt":"2025-12-31T17:50:16.110Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T16:57:17.137Z","text_content":"$DOGE is closing out 2025 on a somber note. Currently trading at $0.1188, $DOGE   is pinned significantly below its 4h MA 50 ($0.1248) and MA 100 ($0.1275). The 24h chart reveals a more systemic issue: the price is trending well under the heavy resistances of $0.1410 and $0.1742. We've seen a consistent bleed throughout December, with today's candle showing a -3.56% drop. From a veteran’s perspective, the lack of volume on bounces suggests this is a structural downtrend rather than a temporary dip.  Short-term: I expect a test of the psychological support at $0.1100. If this floor breaks, we might see a quick slide to $0.1050. Mid-term: The trend remains bearish until $DOGE   can reclaim and hold above the $0.1500 zone. For now, the \"path of least resistance\" is unfortunately downward.  #DOGE  #TechnicalAnalysis  📊","gravity_id":"372448171","id":59525,"createdAt":"2025-12-31T17:00:16.691Z","updatedAt":"2025-12-31T17:50:16.270Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T17:09:14.238Z","text_content":"Sentiment for $DOGE   has shifted to \"Fear\" as we hit the $0.1188 mark. The 24h chart is particularly discouraging, showing a series of \"lower highs\" and \"lower lows\" since the mid-2025 peak near $0.40. The retail crowd, which usually drives DOGE, seems exhausted by the lack of parabolic moves. The current -3.56% daily performance reflects a market that is pricing in a dull start to 2026. The original meme coin is struggling to maintain its relevance against newer, faster-moving assets.  Short-term: A \"capitulation wick\" down to $0.1000 is a high-probability scenario if Bitcoin faces any year-end volatility. Mid-term: I am looking for a base to form around the $0.11 - $0.12 range. If the 200-day MA at $0.1742 continues to act as a hard ceiling, we might be in for a prolonged accumulation phase lasting several months.  #DOGE  #MarketSentiment  🕯️","gravity_id":"372446865","id":59536,"createdAt":"2025-12-31T17:10:13.414Z","updatedAt":"2025-12-31T17:50:15.787Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T17:00:50.962Z","text_content":"Even DOGE ⚠️ I warned you there would be a final drop.\nI said it clearly before it happened.\nGo to my profile and see for yourself 👀\nIf you’re not following me, you’re missing a lot. 🚀\n $DOGE #DOGE #ElonMusk","gravity_id":"372448196","id":59537,"createdAt":"2025-12-31T17:10:13.676Z","updatedAt":"2025-12-31T17:50:15.949Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T17:15:27.193Z","text_content":"$DOGE Time for a new year rally! :)","gravity_id":"372446902","id":59552,"createdAt":"2025-12-31T17:20:13.552Z","updatedAt":"2025-12-31T17:50:15.625Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T17:37:47.628Z","text_content":"$DOGE fell 2.80% in the past 24h, underperforming Bitcoin (-0.86%) and Ethereum (-1.5%). Here are the main factors:\n\nWeak Technical Structure - Price broke below key $0.128 support, triggering algorithmic selling\n\nMuted ETF Impact -  $DOGE ETFs saw\n$2.16M inflows this week, failing to offset\nbearish sentiment\nToken Unlock Pressure - 95M  $DOGE\n($11.6M) entering circulation through Jan 5\n\nMeme Coin Rotation - Capital shifted to newer Solana-based memes like BONK (+12% vs DOGE's #DOGE #Dogecoin","gravity_id":"372449020","id":59588,"createdAt":"2025-12-31T17:40:13.916Z","updatedAt":"2025-12-31T17:50:14.874Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T17:32:00.074Z","text_content":"$DOGE  is respecting a long-term range on the weekly chart, bouncing from strong support after a deep correction. If this structure repeats, a powerful upside move toward previous highs could unfold next.\n#Meme Alpha#","gravity_id":"372446991","id":59589,"createdAt":"2025-12-31T17:40:14.181Z","updatedAt":"2025-12-31T17:50:15.147Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T17:31:41.040Z","text_content":"$DOGE just a little further and dogoin fals of a cliff, 0,1009 euro cent, wil be 0,07","gravity_id":"372445995","id":59590,"createdAt":"2025-12-31T17:40:14.455Z","updatedAt":"2025-12-31T17:50:15.411Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T17:50:09.410Z","text_content":"$DOGE monthly : another month for nothing but the long term bullish structure is still in play. Let see what January is going to deliver","gravity_id":"372449094","id":59607,"createdAt":"2025-12-31T17:50:14.376Z","updatedAt":"2025-12-31T17:50:14.376Z"},{"crypto_id":"74","crypto_name":"DOGE","post_time":"2025-12-31T17:40:45.099Z","text_content":"less than 24hrs left in 2025, whats next for Doge in 2026? (plz no spoilers @australia)","gravity_id":"372448395","id":59608,"createdAt":"2025-12-31T17:50:14.642Z","updatedAt":"2025-12-31T17:50:14.642Z"}]