[{"crypto_id":"74","crypto_name":"DOGE","news_id":"69668d7c428027835443ae9c","news_date":"2026-01-13T18:22:49.567Z","news_title":"XRP, SOL, Dogecoin Granted Bitcoin Legal Status in Senate Draft Bill","news_subtitle":"Crypto News New Senate Banking Committee draft legislation would establish regulatory parity between XRP, Solana, Dogecoin and Bitcoin by creating non-ancillary asset classification. Tokens included in exchange-traded products by Jan. 1, 2026 would gain exemption from securities ...","id":1686,"createdAt":"2026-01-13T18:40:06.020Z","updatedAt":"2026-01-14T18:00:08.411Z"},{"crypto_id":"74","crypto_name":"DOGE","news_id":"696746a44280278354c81ca7","news_date":"2026-01-14T07:42:49.355Z","news_title":"Dogecoin Reclaims Key Levels After Sharp Volume-Backed Breakout","news_subtitle":"Dogecoin (DOGE) staged a strong rebound over the past 24 hours, surging from a local low near $0.1367 to an intraday peak just below $0.150, according to the latest 4-hour chart. The move marks a decisive break above a descending trendline that had capped multiple recovery attemp...","id":1700,"createdAt":"2026-01-14T07:50:11.831Z","updatedAt":"2026-01-14T18:00:09.196Z"},{"crypto_id":"74","crypto_name":"DOGE","news_id":"696767734280278354d909c0","news_date":"2026-01-14T09:52:49.128Z","news_title":"DOGE Regulatory Status at Stake in Thursday's Senate Banking Committee Vote","news_subtitle":"A Senate bill could exempt Dogecoin from SEC securities laws based on its existing ETF trading status. The Banking Committee votes Thursday on legislation that would allow exchanges to list DOGE without regulatory risk.","id":1704,"createdAt":"2026-01-14T10:10:14.226Z","updatedAt":"2026-01-14T18:00:08.938Z"},{"crypto_id":"74","crypto_name":"DOGE","news_id":"6967b72f428027835404e28d","news_date":"2026-01-14T15:32:59.837Z","news_title":"Senate CLARITY Draft Redefines Crypto Regulation Framework","news_subtitle":"The draft grants non-security status to tokens in ETFs by 2026, placing XRP, SOL and DOGE alongside Bitcoin and Ethereum. It draws a firm SEC–CFTC split, adds disclosure rules, and protects developers’ accurate public communications. Exchanges face stricter custody, surveillance,...","id":1723,"createdAt":"2026-01-14T15:50:08.174Z","updatedAt":"2026-01-14T18:00:08.668Z"}]