[{"crypto_id":"1","crypto_name":"BTC","news_id":"6935b7374280278354f1c0c6","news_date":"2025-12-07T17:19:46.095Z","news_title":"Indiana Proposes Groundbreaking Digital Asset Legislation for Retirement Plans","news_subtitle":"An overview of Indiana's House Bill 1042 proposing digital asset regulations in public retirement plans. Read original article on aicryptocore.com","id":243,"createdAt":"2025-12-07T17:30:03.645Z","updatedAt":"2025-12-08T03:00:04.336Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6935be3a4280278354087435","news_date":"2025-12-08T12:09:46.278Z","news_title":"There May Be a Hidden Meaning Behind Ripple’s (XRP) Billion-Dollar Purchases – Here’s the Real Goal","news_subtitle":"What's Ripple's (XRP) ulterior motive behind its recent acquisitions of so many startups this year? Here are the likely scenarios. Continue Reading: There May Be a Hidden Meaning Behind Ripple’s (XRP) Billion-Dollar Purchases – Here’s the Real Goal","id":244,"createdAt":"2025-12-07T18:00:04.247Z","updatedAt":"2025-12-08T15:40:04.427Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69361bf84280278354402cc3","news_date":"2025-12-08T00:29:42.065Z","news_title":"Bitcoin in Retirement Funds? Another State Pushes Landmark Crypto Legislatio","news_subtitle":"Indiana advances a proposal that introduces Bitcoin and other digital assets into state-managed retirement programs by adding crypto ETFs as standard investment options. The bill expands investment authority for several public pension systems and strengthens protections related t...","id":251,"createdAt":"2025-12-08T00:40:03.460Z","updatedAt":"2025-12-08T10:00:14.108Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6936417a428027835454e1a0","news_date":"2025-12-08T03:09:44.234Z","news_title":"K33 Research Sees December Rebound After Deep Bitcoin Drop","news_subtitle":"Bitcoin News Bitcoin's steepest correction since the last bear market may be ending, with K33 Research pointing to December as a potential turning point for the cryptocurrency. Analyst Vetle Lunde said the firm sees more evidence supporting a rebound than another collapse. Bitcoi...","id":255,"createdAt":"2025-12-08T03:20:03.570Z","updatedAt":"2025-12-08T18:00:04.527Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"693643d5428027835455fece","news_date":"2025-12-08T03:19:46.030Z","news_title":"Bitcoin On-Chain Metrics Flash 2022 Bear Market Warning Signs, Says Glassnode","news_subtitle":"Bitcoin News Multiple on-chain metrics now resemble conditions seen at the start of the 2022 bear market, according to Glassnode's latest weekly newsletter highlighting elevated buyer stress and rising supply held at a loss. The data provider's supply quantiles cost basis tracks ...","id":257,"createdAt":"2025-12-08T03:30:03.996Z","updatedAt":"2025-12-08T18:00:03.842Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69369f394280278354a998cc","news_date":"2025-12-08T09:49:44.148Z","news_title":"Casascius Coins Worth $180M Moved After 13 Years Dormant","news_subtitle":"Bitcoin News Two physical Casascius coins holding 1,000 Bitcoin each were activated on Friday, moving a combined $180 million after more than 13 years of inactivity. On-chain data shows one coin was minted in October 2012 when Bitcoin traded at $11.69, while the other dates to De...","id":274,"createdAt":"2025-12-08T10:10:03.366Z","updatedAt":"2025-12-08T16:50:04.418Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6936f0164280278354dbd12b","news_date":"2025-12-08T15:34:43.993Z","news_title":"Bitcoin Risks $76K Drop If Key Support Breaks, Says Analyst","news_subtitle":"Bitcoin News Bitcoin is holding a crucial Fibonacci support level that analysts warn must be defended to prevent a potential decline to $76,000, matching lows last seen in April. Crypto analyst Daan Crypto Trades identified the 0.382 Fibonacci retracement zone as the key technica...","id":287,"createdAt":"2025-12-08T15:50:03.538Z","updatedAt":"2025-12-08T18:00:04.084Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6936f0164280278354dbd128","news_date":"2025-12-08T15:34:43.993Z","news_title":"Bitcoin Rebounds Above $91K Ahead of Fed Decision and Jobs Report","news_subtitle":"Bitcoin News Bitcoin rose to approximately $91,950 on Sunday, extending its recovery from December's $85,000 low as traders prepare for the Federal Reserve's final rate decision and key employment data. The world's largest cryptocurrency gained 1.8% on the day and has recovered 5...","id":288,"createdAt":"2025-12-08T15:50:03.769Z","updatedAt":"2025-12-08T18:00:04.627Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"693701ab4280278354e87808","news_date":"2025-12-08T16:49:46.489Z","news_title":"AI News: Small-Cap Rallies and TAO Halving Signal AI Comeback","news_subtitle":"TL;DR: Macro: BTC reclaims $90K as altcoins, including the AI sector, rebound. Sector: AI mcap +$870M; TAO, NEAR, and tiny caps drive gains. News: Telegram Cocoon, AgentFlux, and TAO halving strengthen AI narrative. Bitcoin (BTC) is back above the $90K threshold after a tumultuou...","id":291,"createdAt":"2025-12-08T17:00:16.338Z","updatedAt":"2025-12-08T18:00:04.801Z"}]