[{"crypto_id":"1","crypto_name":"BTC","news_id":"694c2efe42802783540b63a4","news_date":"2025-12-24T18:20:43.236Z","news_title":"Bitcoin ETF Bleeding Reveals Institutional Retreat, Says Glassnode","news_subtitle":"Bitcoin News Sustained outflows from Bitcoin and Ethereum exchange-traded funds indicate institutional investors are disengaging from crypto markets, according to analytics platform Glassnode. The 30-day simple moving average of net flows into US spot Bitcoin and Ethereum ETFs ha...","id":929,"createdAt":"2025-12-24T18:40:02.081Z","updatedAt":"2025-12-25T18:00:04.139Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694c2efe42802783540b62c8","news_date":"2025-12-24T18:20:43.236Z","news_title":"Bitcoin's Muted Year-End Price Rally May Prevent Q1 Crash — Anthony Pompliano","news_subtitle":"Bitcoin News Bitcoin's absence of an explosive year-end price rally could prevent a significant crash in the first quarter of 2026, according to Bitcoin entrepreneur Anthony Pompliano. The compressed volatility may disappoint short-term holders but provides downside protection ag...","id":930,"createdAt":"2025-12-24T18:40:03.717Z","updatedAt":"2025-12-25T18:00:04.470Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694c3ab74280278354113109","news_date":"2025-12-24T19:10:45.516Z","news_title":"Trump Media Shifts $174M in Bitcoin Holdings Across Crypto Wallets","news_subtitle":"Bitcoin News Trump Media and Technology Group transferred approximately 2,000 Bitcoin, valued at $174 million, across multiple wallets following reports of increased cryptocurrency holdings. The company now holds 11,542 Bitcoin after purchasing 451 coins, according to blockchain ...","id":934,"createdAt":"2025-12-24T19:20:04.032Z","updatedAt":"2025-12-25T18:00:03.952Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694c8103428027835437074a","news_date":"2025-12-25T00:10:41.662Z","news_title":"Metaplanet Shareholders Approve Framework for Buying Even More Bitcoin","news_subtitle":"Bitcoin News Metaplanet moved closer to its target of holding 210,000 Bitcoin worth $18.5 million by the end of 2027 after shareholders voted to approve equity-related proposals enabling additional purchases. The Japanese company's strategy director Dylan LeClair said Wednesday t...","id":939,"createdAt":"2025-12-25T00:20:04.236Z","updatedAt":"2025-12-25T18:00:04.672Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694c81034280278354370747","news_date":"2025-12-25T00:10:41.662Z","news_title":"Bitcoin Treasury Firm Matador Gets Regulatory Approval for $58M Share Sale","news_subtitle":"Bitcoin News The Ontario Securities Commission has cleared Matador Technologies to raise $58 million through share sales, which the company will use to expand its Bitcoin treasury toward a goal of owning 1,000 Bitcoin by the end of 2026. The Bitcoin financial services firm said T...","id":940,"createdAt":"2025-12-25T01:00:04.352Z","updatedAt":"2025-12-25T16:30:05.099Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694d66b54280278354cbf5a5","news_date":"2025-12-25T16:30:44.369Z","news_title":"Elon Musk Predicts Huge US Economic Growth, Boosts Bitcoin Sentiment","news_subtitle":"Bitcoin News Elon Musk projects that the U.S. economy could achieve double-digit growth within 12 to 18 months, with triple-digit growth possible by 2030 if applied intelligence drives economic expansion. The forecast sparked optimism among Bitcoiners who monitor macroeconomic si...","id":956,"createdAt":"2025-12-25T16:40:04.561Z","updatedAt":"2025-12-25T18:00:04.861Z"}]