[{"crypto_id":"1","crypto_name":"BTC","news_id":"694859e74280278354229efe","news_date":"2025-12-22T01:54:46.062Z","news_title":"Tether Moves Toward Consumers With New Self-Custodial Wallet","news_subtitle":"The shift surfaced quietly through a hiring move. On December 20, Paolo Ardoino confirmed that the company is assembling a […] The post Tether Moves Toward Consumers With New Self-Custodial Wallet appeared first on Coindoo.","id":804,"createdAt":"2025-12-21T21:40:05.791Z","updatedAt":"2025-12-22T02:00:06.059Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694867f6428027835429c3ee","news_date":"2025-12-21T23:09:41.990Z","news_title":"4 January Events That Could Shake Crypto Markets","news_subtitle":"A series of macroeconomic and regulatory events scheduled for January and early February are shaping expectations for heightened volatility across crypto markets. Current positioning data suggests traders are preparing for sharp moves, even as broader social sentiment remains cau...","id":805,"createdAt":"2025-12-21T21:50:05.433Z","updatedAt":"2025-12-22T02:10:05.724Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6948a60f42802783544bcfcf","news_date":"2025-12-22T01:59:41.872Z","news_title":"Bitcoin Demand Slowdown Signals Crypto Entering Bear Market, Says CryptoQuant","news_subtitle":"Bitcoin News Bitcoin has entered a bear market cycle as demand growth slowed significantly since October 2025, according to analysts at crypto market analysis platform CryptoQuant. The analytics firm cited multiple factors, including ETF outflows, contracting institutional demand...","id":811,"createdAt":"2025-12-22T02:10:04.265Z","updatedAt":"2025-12-22T18:00:06.915Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6948a4ea42802783544b1b21","news_date":"2025-12-22T01:54:46.062Z","news_title":"Stacks Links with Circle for USDC Stablecoin Integration","news_subtitle":"Stacks connects to Circle's xReserve, enabling USDC-backed stablecoins for enhanced Bitcoin DeFi liquidity. Read original article on kanalcoin.com","id":812,"createdAt":"2025-12-22T02:10:04.631Z","updatedAt":"2025-12-22T10:30:06.161Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6948a61142802783544bd15a","news_date":"2025-12-22T01:59:41.872Z","news_title":"US Regulator Approves Banks for Crypto Services","news_subtitle":"US federal regulator allows banks to engage in crypto, impacting BTC, ETH, USDC. Read original article on nftenex.com","id":813,"createdAt":"2025-12-22T02:10:05.359Z","updatedAt":"2025-12-22T02:10:05.359Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6948a73d42802783544c922f","news_date":"2025-12-22T02:04:42.748Z","news_title":"Bitcoin Price Hasn't Bottomed Yet Despite Fear Indicators, Says Santiment","news_subtitle":"Bitcoin News Crypto traders have not shown enough fear on social media to confirm a market bottom, according to Santiment founder Maksim Balashevich, who suggested Bitcoin could still slide to around $75,000. The crypto market sentiment platform founder stated the crowd is not sc...","id":814,"createdAt":"2025-12-22T02:20:09.953Z","updatedAt":"2025-12-22T18:00:05.479Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6948a73d42802783544c9230","news_date":"2025-12-22T02:04:42.748Z","news_title":"Bitcoin's Post-Quantum Migration Needs 5-10 Years, Casa Co-Founder Says","news_subtitle":"Bitcoin News Migrating Bitcoin to post-quantum standards will require at least five to 10 years, according to Bitcoin core developer and Casa co-founder Jameson Lopp, who emphasized the protocol's decentralized consensus model creates unique upgrade challenges. The extended timel...","id":815,"createdAt":"2025-12-22T02:20:10.329Z","updatedAt":"2025-12-22T18:00:06.540Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6948aac842802783544e8812","news_date":"2025-12-22T02:19:51.052Z","news_title":"BlackRock's Bitcoin ETF Pulled $25B Despite Being Down 9.6% YTD","news_subtitle":"Bitcoin News BlackRock's iShares Bitcoin Trust ranked sixth among all ETFs in 2025 inflows while posting the only negative return in the top 25 funds. IBIT attracted roughly $25 billion in investor capital despite its annual performance sitting at minus 9.6% as of midday Friday. ...","id":816,"createdAt":"2025-12-22T02:30:04.424Z","updatedAt":"2025-12-22T18:00:05.998Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69491c6f4280278354ac8424","news_date":"2025-12-22T10:24:44.120Z","news_title":"Complete List of Licensed Crypto Traders in Indonesia for 2023","news_subtitle":"Indonesia’s Crypto Market Clarifies Regulatory Landscape with Official Whitelist Indonesia’s Financial Services Authority (OJK) has published an official whitelist detailing 29 licensed digital asset trading platforms, underscoring the nation’s intensified regulatory approach tow...","id":830,"createdAt":"2025-12-22T10:40:05.544Z","updatedAt":"2025-12-22T16:10:05.587Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69496d4b4280278354dee99c","news_date":"2025-12-22T16:09:46.084Z","news_title":"Bitcoin Treasury Metaplanet Approves Dividend Shares for Institutions","news_subtitle":"Bitcoin News Metaplanet cleared five proposals Monday that restructure its capital framework, allowing Japan's largest corporate Bitcoin holder to issue dividend-paying preferred shares targeting institutional investors. The company's Bitcoin strategy director, Dylan LeClair, con...","id":847,"createdAt":"2025-12-22T16:20:05.678Z","updatedAt":"2025-12-22T18:00:07.093Z"}]