[{"crypto_id":"1","crypto_name":"BTC","news_id":"693dcde642802783542f574c","news_date":"2025-12-13T20:34:40.914Z","news_title":"SEC Releases Essential Guide to Crypto Custody and Wallets for Investors","news_subtitle":"SEC Publishes Crypto Wallet and Custody Guidelines, Marking a Shift in Regulatory Approach The U.S. Securities and Exchange Commission (SEC) has released a comprehensive investor bulletin highlighting best practices and potential risks associated with various methods of cryptocur...","id":502,"createdAt":"2025-12-13T20:50:04.533Z","updatedAt":"2025-12-14T18:00:10.072Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"693e2f2d4280278354640a32","news_date":"2025-12-14T03:29:46.081Z","news_title":"OCC Approves BitGo, Fidelity for National Trust Bank Status","news_subtitle":"The OCC conditionally approves BitGo and Fidelity Digital Assets as national trust banks, enhancing their digital asset services. Read original article on tokentopnews.com","id":509,"createdAt":"2025-12-14T04:20:04.610Z","updatedAt":"2025-12-14T17:50:05.000Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"693e3e6842802783546bdaca","news_date":"2025-12-14T04:34:44.017Z","news_title":"Strategy Inc. Increases Bitcoin Holdings by 10,624 BTC","news_subtitle":"Strategy Inc. adds 10,624 BTC, solidifying its position as a top Bitcoin holder. Read original article on theccpress.com","id":510,"createdAt":"2025-12-14T04:50:04.028Z","updatedAt":"2025-12-14T18:00:09.666Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"693da161428027835413aaa2","news_date":"2025-12-13T17:24:46.061Z","news_title":"Brazil’s Biggest Bank Recommends Bitcoin Allocation of Up to 3%","news_subtitle":"Itaú Unibanco, the largest private bank in Brazil and all of Latin America, has taken another major step toward institutional crypto adoption by formally recommending that clients allocate a portion of their portfolios to Bitcoin. The guidance comes from Itaú Asset, the bank’s as...","id":518,"createdAt":"2025-12-14T12:10:05.132Z","updatedAt":"2025-12-14T12:50:05.263Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"693eb13d4280278354c72ce9","news_date":"2025-12-14T12:44:41.849Z","news_title":"HashKey’s Bold Strategy: Pioneering Hong Kong’s First Crypto IPO","news_subtitle":"Introduction HashKey, a leading digital asset platform in Hong Kong, is preparing to list 240.57 million shares in what could be the city’s first fully crypto-native IPO under new virtual asset regulations. This move marks a pivotal moment for Hong Kong’s ambitions to establish i...","id":521,"createdAt":"2025-12-14T13:00:04.191Z","updatedAt":"2025-12-14T18:00:09.357Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"693eb4c84280278354c90866","news_date":"2025-12-14T12:59:46.084Z","news_title":"A New Update Proposal for Ethereum is Being Discussed: Here Are the Details","news_subtitle":"A community optimization proposal that could bring some important innovations to Ethereum has begun to be discussed. Here's what you need to know. Continue Reading: A New Update Proposal for Ethereum is Being Discussed: Here Are the Details","id":522,"createdAt":"2025-12-14T13:10:02.847Z","updatedAt":"2025-12-14T18:00:09.893Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"693ef8b9428027835410357a","news_date":"2025-12-14T17:49:41.647Z","news_title":"Michael Saylor's Strategic Bitcoin Acquisition Amid Market Fear","news_subtitle":"Michael Saylor leads Strategy in acquiring 10,624 BTC as market sentiment dips to extreme fear. Read original article on theccpress.com","id":529,"createdAt":"2025-12-14T18:00:09.784Z","updatedAt":"2025-12-14T18:00:09.784Z"}]