[{"crypto_id":"1","crypto_name":"BTC","news_id":"694dec4f42802783542fa38b","news_date":"2025-12-26T02:00:44.549Z","news_title":"Bitcoin and Ethereum ETFs Saw $232M Exit Ahead of Christmas Holiday","news_subtitle":"Bitcoin and Ethereum News Exchange-traded funds tracking Bitcoin and Ethereum experienced combined withdrawals of $232 million on Dec. 24 as market participants scaled back positions ahead of the Christmas break. The session reflected broader caution during a period marked by thi...","id":973,"createdAt":"2025-12-26T02:30:02.689Z","updatedAt":"2025-12-26T18:00:03.660Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694e39a8428027835474213d","news_date":"2025-12-26T07:30:46.462Z","news_title":"CMC Market Pulse: All I Want For Christmas Is A Green Candle","news_subtitle":"Market Overview 📉 *Data as of 6:45 AM UTC on December 26, 2025. Bitcoin (BTC) finished the week up 2.37%, while Ethereum (ETH) underperformed again, moving up 1.76% in the same period. Total crypto market cap rose 2.39% to close the week at $3T, up from $2.93T in the week before...","id":981,"createdAt":"2025-12-26T07:40:02.212Z","updatedAt":"2025-12-26T18:00:04.040Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694e3c024280278354755f30","news_date":"2025-12-26T14:00:44.503Z","news_title":"Remittix Faces Transparency Questions as Anonymous Team and Roadmap Changes Emerge","news_subtitle":"Remittix (RTX), a project claiming to build a crypto-to-fiat remittance network, is now under growing scrutiny due to uncertainty surrounding its development team and roadmap commitments. Read original article on coinwy.com","id":989,"createdAt":"2025-12-26T10:10:04.657Z","updatedAt":"2025-12-26T16:50:04.036Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694e6631428027835489d300","news_date":"2025-12-26T10:40:46.027Z","news_title":"Revolutionary: How Lugano Embraces Bitcoin Payments for Everything from Taxes to Burgers","news_subtitle":"BitcoinWorld Revolutionary: How Lugano Embraces Bitcoin Payments for Everything from Taxes to Burgers Imagine paying your local taxes with the same digital currency you use for a coffee. This is now a reality in Lugano, Switzerland. The city has taken a monumental leap, integrati...","id":990,"createdAt":"2025-12-26T10:50:04.102Z","updatedAt":"2025-12-26T16:50:03.946Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694e6ae042802783548bf5fd","news_date":"2025-12-26T11:00:45.529Z","news_title":"Bitcoin bulls face make-or-break test in Lugano’s real-world payments push","news_subtitle":"Residents can now pay Lugano taxes, fines and city invoices in Bitcoin or USDT, with instant conversion to Swiss francs. On the granite steps outside Lugano’s city hall, the most common question used to be about permit forms or parking…","id":992,"createdAt":"2025-12-26T11:10:06.072Z","updatedAt":"2025-12-26T16:50:03.799Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694eba8b4280278354b65545","news_date":"2025-12-26T17:40:44.666Z","news_title":"Ethereum Rally to $4,878 in 2026 Could Be Bull Trap, Analyst Warns","news_subtitle":"Ethereum News Crypto analyst Benjamin Cowen suggests Ethereum faces significant headwinds preventing it from reclaiming its $4,878 peak during 2026. The assessment comes as broader market conditions show signs of weakness, particularly in Bitcoin performance. Speaking on the Bank...","id":999,"createdAt":"2025-12-26T16:50:02.519Z","updatedAt":"2025-12-26T18:00:04.559Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694ebce74280278354b77d1c","news_date":"2025-12-26T17:40:44.666Z","news_title":"Bitcoin Drives SEC Crypto Filing Surge as Regulatory Clarity Emerges","news_subtitle":"Bitcoin News Blockchain-related mentions in SEC filings surged throughout 2025, reaching approximately 8,000 references by August and maintaining elevated levels through November. Bitcoin dominated the increase as traditional asset managers expanded crypto offerings following spo...","id":1000,"createdAt":"2025-12-26T17:00:03.554Z","updatedAt":"2025-12-26T18:00:04.252Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694eba8b4280278354b65543","news_date":"2025-12-26T17:40:44.666Z","news_title":"Crypto Sentiment Stays in Fear for 14 Days Despite $88K Bitcoin","news_subtitle":"Crypto News Market sentiment remains deeply negative as the Crypto Fear & Greed Index extends its Extreme Fear reading to a full two weeks. The prolonged pessimism represents one of the longest stretches since the sentiment tracker launched in February 2018. The index is at 27, c...","id":1001,"createdAt":"2025-12-26T17:00:03.650Z","updatedAt":"2025-12-26T18:00:04.457Z"}]