[{"crypto_id":"1","crypto_name":"BTC","news_id":"69491c6f4280278354ac8424","news_date":"2025-12-22T18:49:42.900Z","news_title":"Complete List of Licensed Crypto Traders in Indonesia for 2023","news_subtitle":"Indonesia’s Crypto Market Clarifies Regulatory Landscape with Official Whitelist Indonesia’s Financial Services Authority (OJK) has published an official whitelist detailing 29 licensed digital asset trading platforms, underscoring the nation’s intensified regulatory approach tow...","id":830,"createdAt":"2025-12-22T10:40:05.544Z","updatedAt":"2025-12-23T10:30:05.053Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6949b142428027835426a3f7","news_date":"2025-12-22T20:59:43.902Z","news_title":"Strategy Pauses Bitcoin Buys, Adds $748M to Dividend Reserve","news_subtitle":"Bitcoin News Michael Saylor's Bitcoin (BTC) treasury company Strategy did not acquire additional Bitcoin last week, ending a two-week accumulation streak after adding $748 million to its USD reserve. The reserve, established in early December, now stands at $2.19 billion, up from...","id":849,"createdAt":"2025-12-22T21:10:05.446Z","updatedAt":"2025-12-23T18:00:06.133Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6949da4342802783543bf7c3","news_date":"2025-12-22T23:54:41.964Z","news_title":"Bitcoin Price Drops Below $88K Ahead of $28.5B Options Expiry","news_subtitle":"Bitcoin News Bitcoin slipped under $88,000 during U.S. trading on Monday after climbing above $90,000 earlier in the session. Ethereum also retreated below $3,000 as crypto assets moved steadily lower through the afternoon. Over $28.5 billion in Bitcoin and Ethereum options are s...","id":854,"createdAt":"2025-12-23T00:10:02.286Z","updatedAt":"2025-12-23T18:00:05.568Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694a610d4280278354aa0fab","news_date":"2025-12-23T09:29:45.017Z","news_title":"Arizona Lawmaker Proposes Bills to Exempt Virtual Currency From State and Property Taxes","news_subtitle":"Arizona lawmaker proposes bills to exempt virtual currency from state taxes and redefine digital asset treatment. The new proposal would block cities and counties from taxing blockchain node operators across Arizona. Crypto tax changes in Arizona would require voter approval duri...","id":868,"createdAt":"2025-12-23T09:50:06.110Z","updatedAt":"2025-12-23T17:10:06.143Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694a68144280278354ad8570","news_date":"2025-12-23T13:59:46.555Z","news_title":"Potential Market Bottom Signaled by Bitcoin Miner Capitulation","news_subtitle":"VanEck's analysis suggests Bitcoin miner capitulation could mark a market bottom, as historical patterns show. Read original article on coinwy.com","id":873,"createdAt":"2025-12-23T13:40:11.210Z","updatedAt":"2025-12-23T17:10:06.318Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694aae634280278354d4ca66","news_date":"2025-12-23T15:54:46.097Z","news_title":"Arizona Lawmakers Move to Strip State Taxes From Cryptocurrency Activities","news_subtitle":"Arizona lawmakers push bills aiming to eliminate state cryptocurrency taxes. Proposal shields blockchain node operators from city and county fees. Measures could position Arizona as leading crypto tax haven nationally. Arizona lawmakers have returned with a renewed push to overha...","id":882,"createdAt":"2025-12-23T15:10:05.177Z","updatedAt":"2025-12-23T17:10:05.747Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694acbb14280278354e5ad3d","news_date":"2025-12-23T17:04:46.031Z","news_title":"BlackRock Features Bitcoin ETF as a Top 2025 Investment Theme","news_subtitle":"Bitcoin News The asset manager has positioned its iShares Bitcoin Trust ETF (IBIT) alongside Treasury bills and Magnificent 7 tech stocks as one of three major investment themes for 2025. BlackRock's homepage now prominently displays the Bitcoin product, signaling strong institut...","id":889,"createdAt":"2025-12-23T17:20:04.596Z","updatedAt":"2025-12-23T18:00:05.163Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694acbb14280278354e5ad43","news_date":"2025-12-23T17:04:46.031Z","news_title":"Bitcoin Perpetual Futures Contracts Heat Up as 2025 Draws to a Close","news_subtitle":"Bitcoin News Perpetual open interest for Bitcoin climbed from 304,000 to 310,000 tokens as the price briefly touched $90,000 on Monday. The increase signals renewed interest in leveraged positions ahead of year-end trading. Funding rates jumped from 0.04% to 0.09%, indicating der...","id":890,"createdAt":"2025-12-23T17:20:05.369Z","updatedAt":"2025-12-23T18:00:05.967Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"694acbb14280278354e5ad35","news_date":"2025-12-23T17:04:46.031Z","news_title":"Bitcoin Hashrate Drop Signals Potential BTC Price Bottom — VanEck","news_subtitle":"Bitcoin News Bitcoin's hashrate declined 4% over the month ending Dec. 15, which VanEck analysts view as a historically bullish contrarian signal. When hashrate compression persists over extended periods, positive forward returns tend to occur more frequently and with greater mag...","id":891,"createdAt":"2025-12-23T17:20:06.154Z","updatedAt":"2025-12-23T18:00:06.378Z"}]