[{"crypto_id":"1","crypto_name":"BTC","news_id":"69349f274280278354177451","news_date":"2025-12-07T08:54:43.423Z","news_title":"Bitcoin Accumulation Trend Score Climbs Toward Peak as Whales Intensify Buying","news_subtitle":"Bitcoin’s accumulation activity is accelerating again, with Glassnode’s Bitcoin Accumulation Trend Score now approaching its maximum reading. This signals strong and coordinated buying across nearly all major whale cohorts, a pattern that typically emerges during periods of renew...","id":218,"createdAt":"2025-12-06T21:40:04.014Z","updatedAt":"2025-12-07T09:20:04.104Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69352136428027835484a8a7","news_date":"2025-12-07T06:39:46.054Z","news_title":"South Korea Revisits Crypto Exchange Liability Amid Hacking Risks","news_subtitle":"South Korea proposes no-fault liability for virtual asset operators to enhance user protection. Read original article on coincu.com","id":227,"createdAt":"2025-12-07T07:00:06.202Z","updatedAt":"2025-12-07T11:10:03.983Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69353afc428027835493ab29","news_date":"2025-12-07T08:29:44.316Z","news_title":"Indiana Advances Bill Mandating Crypto ETF Options in Public Plans","news_subtitle":"Indiana House Bill 1042 requires cryptocurrency ETFs in public retirement options, impacting Bitcoin demand. Read original article on aicryptocore.com","id":228,"createdAt":"2025-12-07T08:50:03.424Z","updatedAt":"2025-12-07T17:50:04.326Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6935458f4280278354996866","news_date":"2025-12-07T09:14:51.128Z","news_title":"Grayscale Launches Chainlink ETP with $64M AUM","news_subtitle":"Grayscale's launch of the Chainlink ETP, GLNK, attracting $64M in assets under management, signifies a pivotal moment in crypto investment. Read original article on coinlive.me","id":230,"createdAt":"2025-12-07T09:30:03.004Z","updatedAt":"2025-12-07T18:00:04.631Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69355f4e4280278354a92988","news_date":"2025-12-07T11:04:42.911Z","news_title":"France’s BPCE Unveils In-App Crypto Trading for BTC, ETH, SOL & USDC","news_subtitle":"French Banking Giant BPCE to Launch Crypto Trading for Retail Customers BPCE, one of France’s largest banking groups, is set to introduce cryptocurrency trading within its retail banking services, marking a significant move by a traditional European bank into the digital asset sp...","id":236,"createdAt":"2025-12-07T11:20:03.069Z","updatedAt":"2025-12-07T18:00:04.408Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"693575894280278354b62ad6","news_date":"2025-12-07T12:39:30.788Z","news_title":"CFTC Authorizes Leveraged Spot Crypto Trading on U.S. Platforms","news_subtitle":"Discover the CFTC's groundbreaking decision to approve leveraged spot crypto trading, advancing U.S. market participation and regulatory clarity. Read original article on coinlive.me","id":240,"createdAt":"2025-12-07T14:40:03.214Z","updatedAt":"2025-12-07T17:20:03.874Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6935b7374280278354f1c0c6","news_date":"2025-12-07T17:19:46.095Z","news_title":"Indiana Proposes Groundbreaking Digital Asset Legislation for Retirement Plans","news_subtitle":"An overview of Indiana's House Bill 1042 proposing digital asset regulations in public retirement plans. Read original article on aicryptocore.com","id":243,"createdAt":"2025-12-07T17:30:03.645Z","updatedAt":"2025-12-07T18:00:04.554Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6935be3a4280278354087435","news_date":"2025-12-07T17:49:41.057Z","news_title":"There May Be a Hidden Meaning Behind Ripple’s (XRP) Billion-Dollar Purchases – Here’s the Real Goal","news_subtitle":"What's Ripple's (XRP) ulterior motive behind its recent acquisitions of so many startups this year? Here are the likely scenarios. Continue Reading: There May Be a Hidden Meaning Behind Ripple’s (XRP) Billion-Dollar Purchases – Here’s the Real Goal","id":244,"createdAt":"2025-12-07T18:00:04.247Z","updatedAt":"2025-12-07T18:00:04.247Z"}]