[{"crypto_id":"1","crypto_name":"BTC","news_id":"69306db142802783544e290d","news_date":"2025-12-03T17:04:44.316Z","news_title":"Bank of America Opens Wealth Portfolios to Crypto","news_subtitle":"BofA will allow 1–4% crypto allocations and let advisers proactively recommend four major spot Bitcoin ETFs starting Jan 2026. The policy shifts Merrill and Private Bank clients from request-only crypto discussions to full adviser-led recommendations. Move aligns BofA with peers ...","id":70,"createdAt":"2025-12-03T17:20:03.888Z","updatedAt":"2025-12-04T14:20:03.870Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69308e7f4280278354867c93","news_date":"2025-12-04T03:29:44.521Z","news_title":"CleanSpark Mines 587 Bitcoin in November as Power Capacity Hits 1.4 Gigawatts","news_subtitle":"Bitcoin News CleanSpark reported mining 587 Bitcoin in November, an 11% increase from October, while expanding its contracted power capacity to more than 1.4 gigawatts as the company scales operations amid challenging market conditions for cryptocurrency miners. The Bitcoin minin...","id":79,"createdAt":"2025-12-03T19:40:03.712Z","updatedAt":"2025-12-04T18:00:03.583Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69308fa84280278354874ecd","news_date":"2025-12-04T03:29:44.521Z","news_title":"American Bitcoin Shares Recover Partially After First Major Unlock Triggers 35% Drop","news_subtitle":"Crypto News American Bitcoin shares recovered some ground Wednesday after a lockup period ended for certain investors, sending the stock tumbling 35% from Monday's close as insiders took profits following a private placement completed in June. Shares in the Bitcoin mining firm, c...","id":81,"createdAt":"2025-12-03T20:40:03.008Z","updatedAt":"2025-12-04T16:30:02.997Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69312f0b428027835419324c","news_date":"2025-12-04T06:49:46.058Z","news_title":"CryptoQuant Says Strategy's $1.44B Cash Reserve Signals Bitcoin Bear Market Prep","news_subtitle":"Bitcoin News Michael Saylor's Bitcoin treasury firm established a $1.44 billion reserve this week in a move that analytics firm CryptoQuant says reveals the company is preparing for a potential bear market. Strategy built the cash cushion to cover preferred stock dividends and de...","id":92,"createdAt":"2025-12-04T07:00:05.395Z","updatedAt":"2025-12-04T18:00:03.631Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6930cef14280278354b82b39","news_date":"2025-12-04T13:54:46.058Z","news_title":"CME Group Debuts Bitcoin Volatility Index","news_subtitle":"CME Group launches a Bitcoin volatility index to enhance trading strategies for institutional investors. Read original article on aicryptocore.com","id":106,"createdAt":"2025-12-04T13:40:03.844Z","updatedAt":"2025-12-04T14:10:04.337Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"693194ff42802783546102b1","news_date":"2025-12-04T14:04:46.069Z","news_title":"Bitcoin Eyes Relief Bounce After Extreme Deleveraging Phase","news_subtitle":"Bitcoin News Bitcoin could extend its recent rebound following an 8% daily gain on Wednesday, with crypto analysts pointing to signs that suggest a local bottom may already be established. Bitfinex analysts highlighted extreme deleveraging and seller exhaustion as key stabilizati...","id":109,"createdAt":"2025-12-04T14:20:03.778Z","updatedAt":"2025-12-04T18:00:03.677Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69319755428027835462ee7e","news_date":"2025-12-04T14:14:44.058Z","news_title":"IREN Rebounds 7% After $3.6B Fundraising Announcement","news_subtitle":"Crypto News IREN shares recovered Wednesday after the Bitcoin miner revealed plans to raise $3.6 billion through combined share sales and convertible debt offerings. The company aims to deploy computing infrastructure to meet surging artificial intelligence demand. IREN stock jum...","id":110,"createdAt":"2025-12-04T14:30:04.616Z","updatedAt":"2025-12-04T18:00:03.537Z"}]