[{"crypto_id":"1","crypto_name":"BTC","news_id":"692fa9f94280278354a293e8","news_date":"2025-12-03T03:09:43.325Z","news_title":"Crypto Market Rebounds Above $3T as Vanguard Lifts ETF Ban","news_subtitle":"Crypto News The total cryptocurrency market capitalization rose to $3.06 trillion on Tuesday as traders responded to surging Federal Reserve rate-cut expectations and a burst of U.S. ETF activity following Vanguard's decision to lift its long-standing ban on Bitcoin ETF purchases...","id":8,"createdAt":"2025-12-03T04:33:54.572Z","updatedAt":"2025-12-03T18:00:03.356Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"692f4c3842802783545d9e4f","news_date":"2025-12-02T20:29:42.662Z","news_title":"Bank of America Backs Bitcoin ETFs, Lifts Adviser Restrictions","news_subtitle":"Bitcoin News Bank of America has established formal guidelines recommending that wealth management clients allocate between 1% and 4% of their portfolios to digital assets, ending restrictions that prevented over 15,000 advisers from proactively discussing Bitcoin products with c...","id":52,"createdAt":"2025-12-03T11:40:03.642Z","updatedAt":"2025-12-03T18:00:03.441Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69303c79428027835427df40","news_date":"2025-12-03T13:34:46.109Z","news_title":"American Bitcoin Shares Drop 38% as Lockup Period Expires","news_subtitle":"Crypto News ABTC plunged 38.83% on Tuesday after a portion of shares were freed from their lockup period, triggering a wave of selling from early investors who gained liquidity for the first time. The Nasdaq-listed Bitcoin mining and accumulation firm, co-founded by Eric and Dona...","id":59,"createdAt":"2025-12-03T14:20:02.753Z","updatedAt":"2025-12-03T18:00:03.532Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69303a1f42802783542641a3","news_date":"2025-12-03T13:24:45.485Z","news_title":"Bitcoin Rebounds to $93K as Analysts Target $100K Recovery","news_subtitle":"Bitcoin News Bitcoin recovered to $93,000 after a leverage flush on Sunday dropped prices to $84,500, with analysts now predicting that macro tailwinds could push the crypto above six figures. The rebound has renewed optimism across crypto markets as technical indicators suggest ...","id":61,"createdAt":"2025-12-03T14:30:03.421Z","updatedAt":"2025-12-03T18:00:03.612Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69301cd94280278354121019","news_date":"2025-12-03T14:19:46.668Z","news_title":"UK finally amends property law to recognize cryptocurrencies and other digital assets","news_subtitle":"The UK has established a law recognizing digital assets as property.","id":67,"createdAt":"2025-12-03T15:50:03.359Z","updatedAt":"2025-12-03T17:10:03.405Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69306db142802783544e290d","news_date":"2025-12-03T17:04:44.316Z","news_title":"Bank of America Opens Wealth Portfolios to Crypto","news_subtitle":"BofA will allow 1–4% crypto allocations and let advisers proactively recommend four major spot Bitcoin ETFs starting Jan 2026. The policy shifts Merrill and Private Bank clients from request-only crypto discussions to full adviser-led recommendations. Move aligns BofA with peers ...","id":70,"createdAt":"2025-12-03T17:20:03.888Z","updatedAt":"2025-12-03T18:00:03.680Z"}]