[{"crypto_id":"1","crypto_name":"BTC","news_id":"6956d71b4280278354a13ebe","news_date":"2026-01-02T18:10:46.063Z","news_title":"Bitcoin Treasury Firm Strategy Shares Posts 6-Month Losing Streak","news_subtitle":"Crypto News MSTR declined every month from July through December 2025, marking the first six-month consecutive loss since the company adopted Bitcoin as a treasury reserve asset in August 2020. Crypto analyst Chris Millas highlighted the unusually persistent slump in a Thursday p...","id":1225,"createdAt":"2026-01-01T20:30:04.107Z","updatedAt":"2026-01-02T20:50:04.256Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6957140c4280278354c47e20","news_date":"2026-01-02T18:10:46.063Z","news_title":"Tether Adds 8,888 Bitcoin, Now Has Fifth-Largest BTC Wallet","news_subtitle":"Tether News USDT issuer Tether purchased 8,888 Bitcoin on New Year's Eve, increasing its disclosed Bitcoin holdings to more than 96,000 coins to close out 2025. CEO Paolo Ardoino announced the acquisition, which places the stablecoin company's Bitcoin address as the fifth-largest...","id":1231,"createdAt":"2026-01-02T00:50:05.230Z","updatedAt":"2026-01-03T00:40:03.985Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69576f7d42802783540cff71","news_date":"2026-01-02T18:10:46.063Z","news_title":"CMC Market Pulse: New Year, New Charts","news_subtitle":"Market Overview 📉 *Data as of 6:45 AM UTC on January 2, 2026. Bitcoin (BTC) drifted downwards, moving down 0.23%, while Ethereum (ETH) moved up 1.83% in the same week. Total crypto market cap rose slightly, moving up 0.33% to close the week at $3.01T, up from $3.00T in the week ...","id":1236,"createdAt":"2026-01-02T07:20:05.237Z","updatedAt":"2026-01-03T07:00:05.222Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6957d8eb42802783543f21aa","news_date":"2026-01-02T18:10:46.063Z","news_title":"Will AI-Accelerated Quantum Computing Break Bitcoin in 2026?","news_subtitle":"By the end of 2025, \"Quantum Panic\" had reached a fever pitch. In the last year alone, there have been massive leaps forward in hardware stability and AI-driven error correction, leading many to ask: Is Bitcoin’s \"Q-Day” — the day its cryptography fails — scheduled for 2026? To u...","id":1247,"createdAt":"2026-01-02T14:50:05.323Z","updatedAt":"2026-01-03T14:40:05.281Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6957db474280278354403214","news_date":"2026-01-03T00:30:43.417Z","news_title":"Global Crypto Reporting Rules Enter First Enforcement Phase in 2026","news_subtitle":"As of January 1, 2026, the Organisation for Economic Co-operation and Development has officially launched the first global data collection phase of its Crypto-Asset Reporting Framework (CARF), marking a major step toward standardized international tax oversight of digital assets....","id":1251,"createdAt":"2026-01-02T16:30:05.130Z","updatedAt":"2026-01-03T15:20:04.876Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6957f51142802783544da0b5","news_date":"2026-01-02T18:10:46.063Z","news_title":"South Korea Exchange Ready for Crypto ETFs Despite Regulatory Standstill","news_subtitle":"South Korea Crypto News Korea Exchange chairman Jeong Eun-bo announced operational readiness for crypto exchange-traded funds at the New Year trading ceremony, though regulatory approval remains uncertain. The exchange operator is positioning itself to launch Bitcoin and Ethereum...","id":1252,"createdAt":"2026-01-02T16:50:03.933Z","updatedAt":"2026-01-03T16:50:03.886Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6957f51142802783544da0aa","news_date":"2026-01-02T18:10:46.063Z","news_title":"Crypto Fear & Greed Index Exits 'Extreme' Territory After 21-Day Low","news_subtitle":"Crypto News The widely tracked crypto sentiment gauge recorded a fear score of 34 on Friday, climbing from Extreme Fear levels for the first time since Dec. 12. Bitcoin traded at $89,995 despite the improved sentiment reading, remaining below the $90,000 threshold. The Crypto Fea...","id":1253,"createdAt":"2026-01-02T16:50:04.706Z","updatedAt":"2026-01-03T16:50:04.190Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6957f76642802783544eb8eb","news_date":"2026-01-02T18:10:46.063Z","news_title":"Polymarket Traders Give Bitcoin Just 21% Odds of Hitting $150K in 2026","news_subtitle":"Bitcoin News Bitcoin faces skeptical betting markets for 2026 despite analyst projections above $150,000, according to Polymarket prediction data. Traders assigned a 21% probability to Bitcoin reaching that price point before 2027, with $120,000 receiving 45% odds as the safer pr...","id":1259,"createdAt":"2026-01-03T01:00:41.005Z","updatedAt":"2026-01-03T16:50:04.481Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6958a2904280278354de7014","news_date":"2026-01-03T13:50:43.151Z","news_title":"Reddit User Shares Seven-Year Quest To Recover Bitcoin Password Via Custom Tool Development","news_subtitle":"Bitcoin holder develops custom recovery software to crack BIP38-encrypted wallet after seven years of failed attempts.","id":1274,"createdAt":"2026-01-03T14:50:05.517Z","updatedAt":"2026-01-03T18:00:05.079Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69580c7e42802783547a034d","news_date":"2026-01-03T01:20:41.944Z","news_title":"Ethereum Could Be Near a Major Breakout Against Bitcoin: Here is Why","news_subtitle":"Crypto trader Merlijn The Trader believes Ethereum is approaching a move that could catch much of the market off guard. His analysis focuses on the long-term ETH/BTC ratio, comparing the current structure with past cycles that preceded explosive Ethereum outperformance. According...","id":1276,"createdAt":"2026-01-03T16:50:03.396Z","updatedAt":"2026-01-03T17:40:05.222Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6959317642802783544bea76","news_date":"2026-01-03T15:10:43.200Z","news_title":"Bitfarms Exits Latin America After $30 Million Paraguay Facility Sale to Focus on U.S. Expansion","news_subtitle":"Bitfarms completes Latin America exit and focuses all energy operations in North America. Proceeds from Paraguay sale will fund AI and high performance computing infrastructure. The company now has 341 MW active capacity and 430 MW under development in the US. Bitcoin mining comp...","id":1279,"createdAt":"2026-01-03T17:00:04.781Z","updatedAt":"2026-01-03T18:00:05.377Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6958fb9442802783543083d9","news_date":"2026-01-03T13:20:43.168Z","news_title":"How Strategy Uses Market Weakness to Expand Its Bitcoin Position","news_subtitle":"This article was first published on TurkishNY Radio. When Bitcoin prices fall, most companies pull back and protect cash. Strategy does the opposite. Strategy Bitcoin buying accelerates during market downturns, turning volatility into a deliberate accumulation window rather than ...","id":1280,"createdAt":"2026-01-03T17:00:05.084Z","updatedAt":"2026-01-03T18:00:05.507Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6958a98642802783540081f0","news_date":"2026-01-03T05:30:42.736Z","news_title":"Bitcoin ETF Inflows Surge with $463.9M Haul as BlackRock Leads Stunning Reversal","news_subtitle":"BitcoinWorld Bitcoin ETF Inflows Surge with $463.9M Haul as BlackRock Leads Stunning Reversal In a powerful reversal of fortune for digital asset markets, U.S.-listed spot Bitcoin exchange-traded funds (ETFs) attracted a substantial $463.89 million in net new capital on January 2...","id":1281,"createdAt":"2026-01-03T17:00:05.504Z","updatedAt":"2026-01-03T18:00:05.629Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6959549e42802783547f7f13","news_date":"2026-01-03T17:40:43.291Z","news_title":"Cardano wallets under threat? suspicious phishing campaign surfaces","news_subtitle":"A phishing campaign is targeting Cardano users through fake emails promoting a fraudulent Eternl Desktop application download. The attack leverages professionally crafted messages referencing NIGHT and ATMA token rewards through the Diffusion Staking Basket program to establish c...","id":1284,"createdAt":"2026-01-03T17:50:03.644Z","updatedAt":"2026-01-03T18:00:04.767Z"}]