[{"crypto_id":"1","crypto_name":"BTC","news_id":"6973843e42802783543e5a26","news_date":"2026-01-24T07:22:53.578Z","news_title":"Nasdaq Removes Position Limits on Bitcoin and Ethereum ETF Options","news_subtitle":"Bitcoin and Ethereum News Nasdaq has filed a rule change with the Securities and Exchange Commission to remove limits on options tied to spot Bitcoin and Ethereum exchange-traded funds. The proposal lifts existing 25,000-contract limits on options linked to products from BlackRoc...","id":2076,"createdAt":"2026-01-23T14:40:03.226Z","updatedAt":"2026-01-24T14:30:05.121Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6973995742802783544e4013","news_date":"2026-01-24T07:22:53.578Z","news_title":"Binance Alpha News: ELSA and FIGHT Launch Drive Activity Amid Broader Market Weakness","news_subtitle":"Binance Alpha held steady with a market cap of $15.98B this week while the broader crypto market shed nearly 1%. Two new token launches, HeyElsa (ELSA) on Jan. 20 and FIGHT on Jan. 22, tested updated airdrop mechanics, including a dynamic threshold system. Despite Bitcoin capitul...","id":2079,"createdAt":"2026-01-23T16:10:05.852Z","updatedAt":"2026-01-24T16:30:04.988Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6973843e42802783543e5a24","news_date":"2026-01-24T07:22:53.578Z","news_title":"Kansas Bill Creates Bitcoin Reserve From Unclaimed Crypto","news_subtitle":"Bitcoin News Kansas lawmakers are considering legislation to establish a state-managed Bitcoin and digital assets reserve funded through unclaimed property rather than direct cryptocurrency purchases. The proposal takes a different approach from other state reserve concepts by us...","id":2088,"createdAt":"2026-01-24T02:40:05.227Z","updatedAt":"2026-01-24T14:30:05.516Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6973b0ca4280278354822a95","news_date":"2026-01-23T17:32:53.611Z","news_title":"Michael Saylor Leads Major Bitcoin Acquisition","news_subtitle":"Michael Saylor's company Strategy acquires a total of 709,715 BTC, solidifying its position as a significant holder of Bitcoin. This strategic move indicates strong institutional confidence in Bitcoin's value as a corporate treasury asset. Read original article on marketbit.io","id":2089,"createdAt":"2026-01-24T02:40:05.628Z","updatedAt":"2026-01-24T17:40:04.903Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6973eb614280278354ab2153","news_date":"2026-01-23T21:42:53.587Z","news_title":"SEC Approves Nasdaq Rule Change to Remove Limits on Bitcoin ETF Options","news_subtitle":"The U.S. Securities and Exchange Commission (SEC) has approved a rule that removes the special restriction on the options trading linked to Bitcoin ETFs on the Nasdaq Options Market. The decision was published under SEC Release No.34-104649 on January 21, 2026. How the New Rule C...","id":2100,"createdAt":"2026-01-24T07:50:06.481Z","updatedAt":"2026-01-24T18:00:05.077Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697405284280278354be4355","news_date":"2026-01-23T23:32:53.539Z","news_title":"Bitcoin Conference Strategy: MicroStrategy’s Pivotal Corporate Summit Aims to Accelerate Enterprise Adoption","news_subtitle":"BitcoinWorld Bitcoin Conference Strategy: MicroStrategy’s Pivotal Corporate Summit Aims to Accelerate Enterprise Adoption In a strategic move that could reshape corporate treasury management, MicroStrategy founder Michael Saylor announced the Bitcoin for Corporations 2026 confere...","id":2114,"createdAt":"2026-01-24T14:40:05.198Z","updatedAt":"2026-01-24T18:00:05.491Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69747a5a42802783543573b3","news_date":"2026-01-24T07:52:54.662Z","news_title":"Ethereum prepares for quantum era with new security team and funding","news_subtitle":"The Ethereum Foundation has formed a post-quantum security team, launching developer sessions, research funding and test networks to prepare the network for future quantum risks.","id":2115,"createdAt":"2026-01-24T14:40:05.609Z","updatedAt":"2026-01-24T18:00:06.306Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6973c5e142802783549090a2","news_date":"2026-01-23T19:52:53.345Z","news_title":"BlackRock, Fidelity, Grayscale: Why Nasdaq's SEC Rule Change Could Trigger A Crypto Derivatives Boom","news_subtitle":"Nasdaq files SEC proposal to eliminate 25,000-contract cap on Bitcoin and Ethereum ETF options. Move could unlock institutional derivatives participation","id":2118,"createdAt":"2026-01-24T16:40:06.124Z","updatedAt":"2026-01-24T18:00:06.491Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697450294280278354f648a0","news_date":"2026-01-24T04:52:53.353Z","news_title":"Nasdaq Lifts Bitcoin, Ethereum ETF Options Limits","news_subtitle":"Nasdaq removes position limits on Bitcoin, Ethereum ETFs, boosting trading potential. Read original article on tokentopnews.com","id":2123,"createdAt":"2026-01-24T17:50:06.681Z","updatedAt":"2026-01-24T17:50:06.681Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697504a64280278354bf6a97","news_date":"2026-01-24T17:42:57.329Z","news_title":"Ethereum creates a team dedicated to post-quantum security","news_subtitle":"The quantum era is fast approaching. These computers capable of defeating current cryptographies are no longer fiction. Technological infrastructures, from banks to blockchain networks, could soon tremble. Bitcoin and Ethereum are no exceptions: their encryption schemes, which pr...","id":2124,"createdAt":"2026-01-24T18:00:05.896Z","updatedAt":"2026-01-24T18:00:05.896Z"}]