[{"crypto_id":"1","crypto_name":"BTC","news_id":"69569a2d42802783546600bb","news_date":"2026-01-01T23:30:42.027Z","news_title":"TeraWulf Shares Soar as KBW Upgrades Price Target to $24","news_subtitle":"Crypto News Keefe, Bruyette & Woods upgraded Bitcoin miner TeraWulf to “outperform” with a $24 price target, more than doubling its previous $9.50 forecast, based on the company's transition toward high-performance computing leases. The investment bank cited investor underestimat...","id":1217,"createdAt":"2026-01-01T16:20:11.571Z","updatedAt":"2026-01-02T16:00:41.703Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69569c8842802783546850e5","news_date":"2026-01-01T23:30:42.027Z","news_title":"Bitcoin's Four-Year Cycle Died After 2024 Halving, Say Analysts","news_subtitle":"Bitcoin News Bitcoin has closed 2025 lower than it started, marking the first decline in a post-halving year and potentially signaling the end of the four-year cycle that has defined crypto markets. The pattern break comes despite the April 2024 halving event that has historicall...","id":1219,"createdAt":"2026-01-01T16:30:03.759Z","updatedAt":"2026-01-02T16:20:04.627Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6956d71b4280278354a13ebe","news_date":"2026-01-01T23:30:42.027Z","news_title":"Bitcoin Treasury Firm Strategy Shares Posts 6-Month Losing Streak","news_subtitle":"Crypto News MSTR declined every month from July through December 2025, marking the first six-month consecutive loss since the company adopted Bitcoin as a treasury reserve asset in August 2020. Crypto analyst Chris Millas highlighted the unusually persistent slump in a Thursday p...","id":1225,"createdAt":"2026-01-01T20:30:04.107Z","updatedAt":"2026-01-02T18:00:04.048Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6957140c4280278354c47e20","news_date":"2026-01-02T00:40:42.380Z","news_title":"Tether Adds 8,888 Bitcoin, Now Has Fifth-Largest BTC Wallet","news_subtitle":"Tether News USDT issuer Tether purchased 8,888 Bitcoin on New Year's Eve, increasing its disclosed Bitcoin holdings to more than 96,000 coins to close out 2025. CEO Paolo Ardoino announced the acquisition, which places the stablecoin company's Bitcoin address as the fifth-largest...","id":1231,"createdAt":"2026-01-02T00:50:05.230Z","updatedAt":"2026-01-02T18:00:04.641Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6957d8eb42802783543f21aa","news_date":"2026-01-02T14:40:41.701Z","news_title":"Will AI-Accelerated Quantum Computing Break Bitcoin in 2026?","news_subtitle":"By the end of 2025, \"Quantum Panic\" had reached a fever pitch. In the last year alone, there have been massive leaps forward in hardware stability and AI-driven error correction, leading many to ask: Is Bitcoin’s \"Q-Day” — the day its cryptography fails — scheduled for 2026? To u...","id":1247,"createdAt":"2026-01-02T14:50:05.323Z","updatedAt":"2026-01-02T18:00:04.929Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6957db474280278354403214","news_date":"2026-01-02T15:30:42.275Z","news_title":"Global Crypto Reporting Rules Enter First Enforcement Phase in 2026","news_subtitle":"As of January 1, 2026, the Organisation for Economic Co-operation and Development has officially launched the first global data collection phase of its Crypto-Asset Reporting Framework (CARF), marking a major step toward standardized international tax oversight of digital assets....","id":1251,"createdAt":"2026-01-02T16:30:05.130Z","updatedAt":"2026-01-02T16:40:05.283Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6957f51142802783544da0b5","news_date":"2026-01-02T16:40:46.109Z","news_title":"South Korea Exchange Ready for Crypto ETFs Despite Regulatory Standstill","news_subtitle":"South Korea Crypto News Korea Exchange chairman Jeong Eun-bo announced operational readiness for crypto exchange-traded funds at the New Year trading ceremony, though regulatory approval remains uncertain. The exchange operator is positioning itself to launch Bitcoin and Ethereum...","id":1252,"createdAt":"2026-01-02T16:50:03.933Z","updatedAt":"2026-01-02T18:00:04.358Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6957f51142802783544da0aa","news_date":"2026-01-02T16:40:46.109Z","news_title":"Crypto Fear & Greed Index Exits 'Extreme' Territory After 21-Day Low","news_subtitle":"Crypto News The widely tracked crypto sentiment gauge recorded a fear score of 34 on Friday, climbing from Extreme Fear levels for the first time since Dec. 12. Bitcoin traded at $89,995 despite the improved sentiment reading, remaining below the $90,000 threshold. The Crypto Fea...","id":1253,"createdAt":"2026-01-02T16:50:04.706Z","updatedAt":"2026-01-02T18:00:05.126Z"}]