[{"crypto_id":"1","crypto_name":"BTC","news_id":"697e435e428027835428c605","news_date":"2026-01-31T17:52:54.595Z","news_title":"Tennessee Advances Bill to Hold Bitcoin in State Financial Reserves","news_subtitle":"Tennessee, A state in the United States, is taking major steps towards adding Bitcoin to its public financial reserves. State Lawmakers have advanced a new bill that allows the state to officially hold Bitcoin using state funds. How the Bill works once passed Jody Barrett, a Tenn...","id":2289,"createdAt":"2026-01-31T20:50:05.459Z","updatedAt":"2026-02-01T18:00:05.601Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697ea5d0428027835471c28e","news_date":"2026-02-01T00:52:56.804Z","news_title":"Binance Moves $1 Billion SAFU Fund Into Bitcoin","news_subtitle":"Binance reallocates $1 billion SAFU fund into Bitcoin assets, reflecting confidence in BTC's long-term value and focusing on asset sovereignty. Read original article on tokentopnews.com","id":2292,"createdAt":"2026-02-01T01:20:04.903Z","updatedAt":"2026-02-01T18:00:05.225Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697f0f474280278354dc92b2","news_date":"2026-02-01T08:22:54.753Z","news_title":"Bitcoin AHR999 Indicator Falls Below Critical Mark","news_subtitle":"Bitcoin AHR999 indicator drops under buying point, signaling market shifts. Monitor BTC dynamics. Read original article on coincu.com","id":2296,"createdAt":"2026-02-01T08:50:06.152Z","updatedAt":"2026-02-01T16:40:05.657Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697f2b664280278354f1b409","news_date":"2026-02-01T10:22:55.881Z","news_title":"Bitget CEO Gracy Chen Confirms Year-Long Bitcoin Buying","news_subtitle":"Bitget grew BTC holdings from about 11,127 to nearly 21,889 between Jan 2025 and Jan 2026 through steady accumulation. Bitcoin reserves exceeded user balances by over 250 percent showing surplus coverage under Bitget’s proof of reserves. Accumulation continued despite ETFs outflo...","id":2297,"createdAt":"2026-02-01T10:50:05.095Z","updatedAt":"2026-02-01T18:00:06.706Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697f4785428027835406b6f2","news_date":"2026-02-01T12:22:54.732Z","news_title":"Hong Kong Regulators to Submit Draft Crypto Framework Bill in 2026","news_subtitle":"Hong Kong’s regulatory arc for digital assets is moving from consultation to drafting, with officials outlining a concrete timetable for 2026. In remarks prepared for the Legislative Council’s Finance Committee, Secretary for Financial Services and the Treasury Christopher Hui sa...","id":2304,"createdAt":"2026-02-01T14:20:06.239Z","updatedAt":"2026-02-01T18:00:05.976Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697f6aae4280278354207936","news_date":"2026-02-01T14:52:56.105Z","news_title":"Michael Saylor Says Strategy Faces No Liquidation Risk Even if Bitcoin Falls to $1","news_subtitle":"Michael Saylor has reiterated that Strategy faces no risk of forced liquidation, even in an extreme scenario where Bitcoin’s price collapses to $1. According to Saylor, the company’s balance sheet is deliberately structured to avoid the margin call dynamics that typically devasta...","id":2305,"createdAt":"2026-02-01T15:20:05.807Z","updatedAt":"2026-02-01T18:00:06.339Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697f78bf42802783542a7b44","news_date":"2026-02-01T15:42:54.920Z","news_title":"Bitcoin Miners Cut Production Amid Winter Storm","news_subtitle":"Analysis of Bitcoin mining curtailments due to Winter Storm Fern in January 2026. Read original article on coinwy.com","id":2306,"createdAt":"2026-02-01T16:20:05.598Z","updatedAt":"2026-02-01T16:40:05.481Z"}]