[{"crypto_id":"1","crypto_name":"BTC","news_id":"695c186f4280278354051716","news_date":"2026-01-05T20:00:46.034Z","news_title":"Strategy's Bitcoin Treasury Hits 673,783 BTC After Adding $116M","news_subtitle":"Bitcoin News Strategy purchased 1,286 Bitcoin for approximately $116.3 million between Dec. 29 and Jan. 4, according to a Monday filing with the Securities and Exchange Commission. The acquisition brought the company's total Bitcoin holdings to 673,783 Bitcoin, valued at roughly ...","id":1359,"createdAt":"2026-01-05T20:20:03.887Z","updatedAt":"2026-01-06T18:00:10.230Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"695c530342802783544c1766","news_date":"2026-01-06T00:10:41.271Z","news_title":"Crypto Stocks Rally as Bitcoin Price Climbs Past $94K","news_subtitle":"Bitcoin News Bitcoin surged above $94,000 on Monday to reach its highest price in 30 days, while crypto-related stocks posted gains across the board. The rally pushed Bitcoin to $94,634 during Monday's trading session before settling at $94,103, representing a gain of more than 3...","id":1365,"createdAt":"2026-01-06T00:20:04.687Z","updatedAt":"2026-01-06T18:00:10.566Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"695c186f42802783540516d9","news_date":"2026-01-05T20:00:46.034Z","news_title":"Bank of America Approves Four Spot Bitcoin ETFs for Advisers","news_subtitle":"Bitcoin News Bank of America will enable advisers across Merrill, the Bank of America Private Bank, and Merrill Edge to proactively recommend spot Bitcoin exchange-traded funds. The chief investment office approved four U.S.-listed products for coverage, expanding beyond previous...","id":1373,"createdAt":"2026-01-06T13:10:10.002Z","updatedAt":"2026-01-06T14:02:25.557Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"695d158b4280278354030253","news_date":"2026-01-06T14:00:42.077Z","news_title":"Bitcoin Whales Accumulate $5.3B as Retail Traders Exit Positions","news_subtitle":"Bitcoin News Large crypto holders have purchased 56,227 Bitcoin worth approximately $5.3 billion since mid-December, while smaller investors took profits, creating conditions that typically precede upward price movement. Santiment reported Monday that whale and shark wallets now ...","id":1381,"createdAt":"2026-01-06T14:20:07.509Z","updatedAt":"2026-01-06T18:00:10.899Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"695d158b428027835403024c","news_date":"2026-01-06T14:00:42.077Z","news_title":"Bill Miller IV Predicts Bitcoin Price Breakout to New All-Time High","news_subtitle":"Bitcoin News Bitcoin appears technically positioned for a rally past its previous peak, according to Bill Miller IV, chief investment officer at Miller Value Partners. The fund manager told CNBC Monday that technical indicators are aligning favorably, suggesting the cryptocurrenc...","id":1382,"createdAt":"2026-01-06T14:20:07.846Z","updatedAt":"2026-01-06T18:00:11.236Z"}]