[{"crypto_id":"1","crypto_name":"BTC","news_id":"69668fd3428027835445165b","news_date":"2026-01-13T18:32:49.996Z","news_title":"Bitcoin Jumps Above $92,500 on In-Line Inflation Data","news_subtitle":"Bitcoin News Bitcoin jumped to $92,500 immediately following December's Consumer Price Index release before moderating to $91,830, representing a 1.7% daily gain. The Bureau of Labor Statistics reported 2.7% annual inflation, unchanged from November and matching analyst projectio...","id":1687,"createdAt":"2026-01-13T18:50:06.065Z","updatedAt":"2026-01-14T18:00:04.588Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6966e68a42802783547779ef","news_date":"2026-01-14T00:42:47.938Z","news_title":"Bitcoin Options Overtake Futures as Institutions Favor Volatility Strategies","news_subtitle":"Bitcoin News Open interest in Bitcoin options contracts has reached $65 billion, surpassing the $60 billion held in futures positions and reflecting institutional preference for volatility strategies over leveraged directional bets. This leadership position has persisted since Ju...","id":1693,"createdAt":"2026-01-14T01:00:04.408Z","updatedAt":"2026-01-14T18:00:03.788Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6966e68a42802783547779f3","news_date":"2026-01-14T00:42:47.938Z","news_title":"Bitcoin Needs Three Catalysts for 2026 Recovery, Says Wintermute","news_subtitle":"Bitcoin News Cryptocurrency markets face uncertain prospects after 2025's disappointing performance, with digital asset recovery dependent on institutional mandate expansion, major asset rallies, or retail investor reengagement. Market maker Wintermute outlined these pathways in ...","id":1694,"createdAt":"2026-01-14T01:00:04.824Z","updatedAt":"2026-01-14T18:00:04.053Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6967318e4280278354bdef38","news_date":"2026-01-14T06:02:50.040Z","news_title":"Strive Deepens Corporate Bitcoin Bet Through Semler Scientific Deal","news_subtitle":"The deal, approved by Semler shareholders, marks a rare example of a publicly traded company being acquired primarily for its […] The post Strive Deepens Corporate Bitcoin Bet Through Semler Scientific Deal appeared first on Coindoo.","id":1698,"createdAt":"2026-01-14T06:20:06.767Z","updatedAt":"2026-01-14T07:00:06.991Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69673d454280278354c3aa00","news_date":"2026-01-14T11:22:49.101Z","news_title":"Negative User Feedback Gains Visibility Across Review Platforms for Remittix","news_subtitle":"Public review platforms are showing an uptick in negative user sentiment toward Remittix, a crypto project positioning itself within the digital payments and remittance space. Read original article on coinwy.com","id":1699,"createdAt":"2026-01-14T07:10:07.296Z","updatedAt":"2026-01-14T13:40:05.963Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69679d5b4280278354f64bbc","news_date":"2026-01-14T13:42:48.995Z","news_title":"Corporate Bitcoin Buying Outstrips Mining Supply 3-to-1","news_subtitle":"Bitcoin News Public and private company Bitcoin treasuries have expanded by 260,000 Bitcoin over six months, tripling the approximately 82,000 coins produced by miners during the same timeframe, according to on-chain analytics provider Glassnode. Corporate digital asset treasury ...","id":1710,"createdAt":"2026-01-14T13:52:19.671Z","updatedAt":"2026-01-14T18:00:04.715Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6967a47d4280278354fa8249","news_date":"2026-01-14T14:13:14.098Z","news_title":"Bitcoin Rally to $95K Driven by Spot Buying as $100K Targeted","news_subtitle":"Bitcoin News Spot market buying propelled Bitcoin above $95,000 on Tuesday, with analysts projecting the psychological $100,000 level as the next target after the cryptocurrency gained 4.65% over 24 hours to trade at $95,190. Crypto analyst Will Clemente identified spot purchasin...","id":1712,"createdAt":"2026-01-14T14:30:06.166Z","updatedAt":"2026-01-14T18:00:04.323Z"}]