[{"crypto_id":"1","crypto_name":"BTC","news_id":"695596074280278354b26dea","news_date":"2025-12-31T21:30:44.840Z","news_title":"Bitcoin Faces Q4 2026 Bottom Near $60K Despite Payment Growth — Michael Terpin","news_subtitle":"Bitcoin News Early Bitcoin investor Michael Terpin projects the cryptocurrency will reach its cycle low around $60,000 in Q4 2026, though blockchain software developer Rich Rines says payment infrastructure improvements will define the year ahead. Terpin told analysts that market...","id":1190,"createdAt":"2025-12-31T21:50:05.130Z","updatedAt":"2026-01-01T18:00:05.495Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"695596074280278354b26df5","news_date":"2025-12-31T21:30:44.840Z","news_title":"Bitcoin Trails Gold’s 9% Gain as BTC Whales Pause Accumulation","news_subtitle":"Bitcoin News Santiment analysts project cryptocurrency markets will continue bleeding into 2026 despite gains in traditional assets, though 2026 presents opportunities for Bitcoin to close performance gaps with gold and equities. Data shows gold has climbed 9% since early Novembe...","id":1192,"createdAt":"2025-12-31T22:40:04.375Z","updatedAt":"2026-01-01T18:00:05.896Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"695596074280278354b26df1","news_date":"2025-12-31T21:30:44.840Z","news_title":"CFTC Chair Selig Names Amir Zaidi Chief of Staff","news_subtitle":"Crypto News Michael Selig appointed Amir Zaidi as Commodity Futures Trading Commission chief of staff on Wednesday, selecting an official who oversaw the agency's approval of Bitcoin futures contracts during his previous tenure. Zaidi worked at the CFTC from 2010 to 2019, managin...","id":1194,"createdAt":"2025-12-31T23:50:04.475Z","updatedAt":"2026-01-01T16:20:12.560Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69557c464280278354a4b883","news_date":"2025-12-31T19:40:51.053Z","news_title":"Bitcoin Long-Term Holders Shift to Net Accumulation","news_subtitle":"Bitcoin long-term holders switch to net accumulation, reducing market sell pressure amid price fluctuations. Read original article on tokentopnews.com","id":1204,"createdAt":"2026-01-01T10:20:04.539Z","updatedAt":"2026-01-01T16:10:05.181Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69569a2d42802783546600bb","news_date":"2026-01-01T16:00:43.610Z","news_title":"TeraWulf Shares Soar as KBW Upgrades Price Target to $24","news_subtitle":"Crypto News Keefe, Bruyette & Woods upgraded Bitcoin miner TeraWulf to “outperform” with a $24 price target, more than doubling its previous $9.50 forecast, based on the company's transition toward high-performance computing leases. The investment bank cited investor underestimat...","id":1217,"createdAt":"2026-01-01T16:20:11.571Z","updatedAt":"2026-01-01T18:00:04.930Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69569c8842802783546850e5","news_date":"2026-01-01T16:10:46.676Z","news_title":"Bitcoin's Four-Year Cycle Died After 2024 Halving, Say Analysts","news_subtitle":"Bitcoin News Bitcoin has closed 2025 lower than it started, marking the first decline in a post-halving year and potentially signaling the end of the four-year cycle that has defined crypto markets. The pattern break comes despite the April 2024 halving event that has historicall...","id":1219,"createdAt":"2026-01-01T16:30:03.759Z","updatedAt":"2026-01-01T18:00:05.222Z"}]