[{"crypto_id":"1","crypto_name":"BTC","news_id":"697a24b142802783544ef1e4","news_date":"2026-01-29T11:55:42.728Z","news_title":"Citrea Launches Mainnet - Enabling Bitcoin to Be Used for Lending, Trading, and USD Settlement","news_subtitle":"Citrea Launches Mainnet - Enabling Bitcoin to Be Used for Lending, Trading, and USD Settlement","id":2190,"createdAt":"2026-01-28T15:20:04.992Z","updatedAt":"2026-01-29T15:10:05.369Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697a32c04280278354592506","news_date":"2026-01-28T20:52:53.204Z","news_title":"Steak ’n Shake Adds $5M in Bitcoin as Sales Jump on Lightning Payments","news_subtitle":"The American fast-food chain Steak ’n Shake has expanded its Bitcoin exposure, adding $5 million worth of Bitcoin to its balance sheet and lifting its Strategic Bitcoin Reserve to roughly $15 million. The move comes amid a sharp improvement in operating performance, with the comp...","id":2193,"createdAt":"2026-01-28T16:20:05.451Z","updatedAt":"2026-01-29T15:40:05.543Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697a79134280278354a98d80","news_date":"2026-01-29T11:55:42.728Z","news_title":"South Dakota Revisits Bitcoin Reserve Plan With New Bill","news_subtitle":"South Dakota has taken a significant step toward embracing Bitcoin (BTC) reserve adoption at the state level The post South Dakota Revisits Bitcoin Reserve Plan With New Bill appeared first on TheCoinrise.com.","id":2211,"createdAt":"2026-01-29T07:20:05.538Z","updatedAt":"2026-01-29T18:00:05.705Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697b762f42802783547f28a7","news_date":"2026-01-29T14:55:53.172Z","news_title":"Gold Adds $1.5T in Single Day, Outpaces Bitcoin Over 5 Years","news_subtitle":"Crypto News Gold rallied 4.4% in 24 hours on Wednesday, adding $1.5 trillion to its market cap while Bitcoin traded lower. The precious metal breached $5,500 per troy ounce for the first time, reaching a new all-time high and pushing its total market cap to approximately $34 tril...","id":2224,"createdAt":"2026-01-29T15:20:05.472Z","updatedAt":"2026-01-29T18:00:04.856Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697b762f42802783547f28a0","news_date":"2026-01-29T14:55:53.172Z","news_title":"Sygnum's Market-Neutral Fund Raises 750 BTC, Posts 8.9% Returns","news_subtitle":"Crypto News Crypto banking group Sygnum has completed the seed phase of its Starboard Sygnum BTC Alpha Fund, attracting more than 750 Bitcoin from professional and institutional investors in four months following its October 2025 launch. The market-neutral Bitcoin fund posted an ...","id":2225,"createdAt":"2026-01-29T15:20:05.627Z","updatedAt":"2026-01-29T18:00:05.247Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697a87214280278354b30ef0","news_date":"2026-01-28T21:52:53.934Z","news_title":"Bitcoin Miners Make Astounding 150% Profit Surge by Halting Operations During US Winter Storm","news_subtitle":"BitcoinWorld Bitcoin Miners Make Astounding 150% Profit Surge by Halting Operations During US Winter Storm Across the United States in late February 2025, a powerful winter storm triggered a remarkable and strategic pivot within the Bitcoin mining industry. Instead of competing f...","id":2226,"createdAt":"2026-01-29T15:50:04.846Z","updatedAt":"2026-01-29T18:00:06.179Z"}]