[{"crypto_id":"1","crypto_name":"BTC","news_id":"69727b6942802783545d6b7e","news_date":"2026-01-22T19:32:54.023Z","news_title":"Strategy Hints Fresh Bitcoin Buy in Unusual Thursday Post","news_subtitle":"Bitcoin News Michael Saylor posted Thursday morning that Strategy is considering additional Bitcoin purchases, marking an unusual departure from his standard weekend acquisition announcements. The firm's executive chairman typically signals upcoming buys through weekend social me...","id":2049,"createdAt":"2026-01-22T19:50:05.787Z","updatedAt":"2026-01-23T18:00:06.214Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69727b6942802783545d6b83","news_date":"2026-01-22T19:32:54.023Z","news_title":"Nomura-Backed Laser Digital Launches Tokenized Bitcoin Yield Fund","news_subtitle":"Bitcoin News Nomura-backed Laser Digital rolled out a Bitcoin yield fund Thursday that targets returns exceeding 5% above Bitcoin's base performance through diversified trading approaches. The product marks the first natively tokenized Bitcoin income fund developed via KAIO's pla...","id":2050,"createdAt":"2026-01-22T19:50:05.954Z","updatedAt":"2026-01-23T18:00:06.392Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6972db924280278354a10b98","news_date":"2026-01-23T02:23:13.121Z","news_title":"Pantera Predicts ‘Brutal’ Purge of Crypto Treasuries","news_subtitle":"Crypto News Investment firm Pantera Capital predicts a year of significant winnowing among companies holding cryptocurrency on their balance sheets, with a few dominant players continuing to accumulate Bitcoin and Ethereum while smaller operations face acquisition or abandonment....","id":2061,"createdAt":"2026-01-23T02:40:02.158Z","updatedAt":"2026-01-23T18:00:05.399Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6972db924280278354a10be3","news_date":"2026-01-23T02:23:13.121Z","news_title":"Bitwise Bitcoin-Gold Hybrid ETF Debuts on NYSE","news_subtitle":"Bitcoin News Bitwise Asset Management rolled out a new investment vehicle Thursday that allocates capital across Bitcoin, precious metals, and mining company stocks. The product represents a departure from traditional single-asset crypto funds by blending digital and physical sto...","id":2062,"createdAt":"2026-01-23T02:40:04.435Z","updatedAt":"2026-01-23T18:00:05.002Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69727b6942802783545d6b89","news_date":"2026-01-22T19:32:54.023Z","news_title":"Bitcoin Faces Resistance at $98K as Recent Buyers Sell, Glassnode Reports","news_subtitle":"Bitcoin News Bitcoin dropped beneath $90,000 after unsuccessful attempts to break through overhead supply concentrated near $98,000, according to on-chain data from Glassnode. The digital asset briefly climbed toward that upper threshold last week before encountering significant ...","id":2075,"createdAt":"2026-01-23T14:30:06.821Z","updatedAt":"2026-01-23T16:00:08.854Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6973995742802783544e4013","news_date":"2026-01-23T15:52:52.414Z","news_title":"Binance Alpha News: ELSA and FIGHT Launch Drive Activity Amid Broader Market Weakness","news_subtitle":"Binance Alpha held steady with a market cap of $15.98B this week while the broader crypto market shed nearly 1%. Two new token launches, HeyElsa (ELSA) on Jan. 20 and FIGHT on Jan. 22, tested updated airdrop mechanics, including a dynamic threshold system. Despite Bitcoin capitul...","id":2079,"createdAt":"2026-01-23T16:10:05.852Z","updatedAt":"2026-01-23T18:00:05.791Z"}]