[{"crypto_id":"1","crypto_name":"BTC","news_id":"697129ea4280278354341945","news_date":"2026-01-22T16:02:56.546Z","news_title":"Crypto ETFs Record $713M Outflows as Institutions Exit","news_subtitle":"Crypto News Exchange-traded funds holding Bitcoin and Ethereum experienced heavy selling on Tuesday as global economic tensions prompted institutional exits. Data from SoSoValue showed Bitcoin products lost $483.4 million across eight funds, while Ethereum vehicles shed $230 mill...","id":2012,"createdAt":"2026-01-21T19:50:02.295Z","updatedAt":"2026-01-22T18:00:04.921Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697137f942802783543e7208","news_date":"2026-01-22T16:02:56.546Z","news_title":"US Treasury Confirms Seized Bitcoin Will Build National Reserve","news_subtitle":"All Bitcoin seized through criminal or civil forfeiture will be retained in the Strategic Bitcoin Reserve, not sold. The SBR grows through enforcement and forfeitures, requiring no taxpayer funds for acquisition. Reserve assets follow strict custody rules and are only sellable in...","id":2016,"createdAt":"2026-01-21T20:50:05.552Z","updatedAt":"2026-01-22T18:00:05.703Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697187a84280278354763763","news_date":"2026-01-22T16:02:56.546Z","news_title":"Bitcoin Could Reach $16 Trillion Market Cap, Says Ark Invest","news_subtitle":"Bitcoin News Investment management firm Ark Invest published projections Wednesday showing Bitcoin could command a $16 trillion market capitalization within four years. The forecast appears in the company's annual \"Big Ideas 2026\" report, which positions digital currencies as mat...","id":2018,"createdAt":"2026-01-22T02:30:04.451Z","updatedAt":"2026-01-22T18:00:05.294Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"697187a84280278354763741","news_date":"2026-01-22T16:02:56.546Z","news_title":"Steak n Shake Launches Bitcoin Bonus Program for Hourly Staff","news_subtitle":"Bitcoin News Restaurant chain Steak n Shake announced a Bitcoin compensation program for hourly staff Tuesday, introducing cryptocurrency earnings as part of employee benefits. The initiative provides workers at corporate locations with digital currency rewards tied to hours work...","id":2019,"createdAt":"2026-01-22T02:30:04.825Z","updatedAt":"2026-01-22T18:00:05.540Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69722e1242802783540e185c","news_date":"2026-01-22T16:02:56.546Z","news_title":"Bitcoin Rally to $150K Needs Catalyst Beyond Institutions, Says Luke Gromen","news_subtitle":"Bitcoin News Institutional investors are unlikely to drive Bitcoin from current levels near $89,880 to $150,000 without a significant market catalyst, according to macro researcher Luke Gromen. The FFTT founder told Natalie Brunell's Coin Stories that waiting for large allocators...","id":2036,"createdAt":"2026-01-22T14:30:03.332Z","updatedAt":"2026-01-22T18:00:04.517Z"}]