[{"crypto_id":"1","crypto_name":"BTC","news_id":"695d158b4280278354030253","news_date":"2026-01-07T10:42:50.315Z","news_title":"Bitcoin Whales Accumulate $5.3B as Retail Traders Exit Positions","news_subtitle":"Bitcoin News Large crypto holders have purchased 56,227 Bitcoin worth approximately $5.3 billion since mid-December, while smaller investors took profits, creating conditions that typically precede upward price movement. Santiment reported Monday that whale and shark wallets now ...","id":1381,"createdAt":"2026-01-06T14:20:07.509Z","updatedAt":"2026-01-07T14:00:04.686Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"695d158b428027835403024c","news_date":"2026-01-07T10:42:50.315Z","news_title":"Bill Miller IV Predicts Bitcoin Price Breakout to New All-Time High","news_subtitle":"Bitcoin News Bitcoin appears technically positioned for a rally past its previous peak, according to Bill Miller IV, chief investment officer at Miller Value Partners. The fund manager told CNBC Monday that technical indicators are aligning favorably, suggesting the cryptocurrenc...","id":1382,"createdAt":"2026-01-06T14:20:07.846Z","updatedAt":"2026-01-07T14:00:05.387Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"695d8f6a42802783548822ca","news_date":"2026-01-07T10:42:50.315Z","news_title":"Bitcoin Faces Three Key Tests for 2026 Rally Continuation, Says Bitwise","news_subtitle":"Bitcoin News Asset manager Bitwise has outlined three critical conditions that must hold for cryptocurrency markets to reach new highs in 2026 as Bitcoin and Ethereum post early gains. The analysis comes as Bitcoin and Ethereum have climbed roughly 7% year-to-date through the fir...","id":1400,"createdAt":"2026-01-06T22:50:02.650Z","updatedAt":"2026-01-07T18:00:05.630Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"695d158b428027835403024a","news_date":"2026-01-07T10:42:50.315Z","news_title":"Bitcoin ETFs Record $697M Inflows in Strongest Day Since October","news_subtitle":"Bitcoin News U.S. spot Bitcoin exchange-traded funds attracted $697.25 million in net inflows Monday, marking the highest single-day total in three months. The surge followed $471.14 million in inflows on Friday, bringing the cumulative two-day total above $1.16 billion according...","id":1402,"createdAt":"2026-01-07T00:20:05.639Z","updatedAt":"2026-01-07T13:20:05.599Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"695e62dd42802783545306f8","news_date":"2026-01-07T13:42:50.907Z","news_title":"Bitcoin ETFs Pull $1.2B in Inflows in 48 Hours, Pace Hits 600% Surge","news_subtitle":"Bitcoin News U.S spot Bitcoin exchange-traded funds attracted over $1.2 billion in the first two trading days of 2026. Bloomberg analyst Eric Balchunas projects this pace could generate $150 billion in annual inflows, representing a 600% surge over 2025 totals. Nearly all funds s...","id":1421,"createdAt":"2026-01-07T14:00:05.037Z","updatedAt":"2026-01-07T18:00:04.316Z"}]