[{"crypto_id":"1","crypto_name":"BTC","news_id":"69673d454280278354c3aa00","news_date":"2026-01-14T23:22:48.280Z","news_title":"Negative User Feedback Gains Visibility Across Review Platforms for Remittix","news_subtitle":"Public review platforms are showing an uptick in negative user sentiment toward Remittix, a crypto project positioning itself within the digital payments and remittance space. Read original article on coinwy.com","id":1699,"createdAt":"2026-01-14T07:10:07.296Z","updatedAt":"2026-01-15T02:10:04.463Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6967f4124280278354483a8d","news_date":"2026-01-14T19:52:49.113Z","news_title":"Bitcoin Surges Past $97,000, Triggers $680M Short Liquidations","news_subtitle":"Bitcoin News Bitcoin broke through $97,000 on Wednesday, reaching its highest level in eight weeks as derivatives markets shifted to risk-on positioning. The largest cryptocurrency posted gains exceeding 4.4% over 24 hours while the broader crypto market capitalization climbed to...","id":1734,"createdAt":"2026-01-14T20:10:03.830Z","updatedAt":"2026-01-15T18:00:04.278Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6967f4124280278354483a46","news_date":"2026-01-14T19:52:49.113Z","news_title":"Bitcoin ETFs Record $753M Inflows After Four-Day Slump","news_subtitle":"Bitcoin News U.S.-listed spot Bitcoin exchange-traded funds pulled in $753 million on Tuesday, ending a four-day losing streak with their second consecutive day of positive flows. The products have accumulated $660 million in net inflows during 2026 as investor demand continues t...","id":1735,"createdAt":"2026-01-14T20:10:04.346Z","updatedAt":"2026-01-15T18:00:05.287Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69684ac9428027835475d682","news_date":"2026-01-15T02:02:48.171Z","news_title":"U.S. Bitcoin Mining Share Falls Amid AI Shift","news_subtitle":"Bitcoin News December data shows North American operations mined 35% of all Bitcoin blocks, representing a drop from January 2025's more than 40% share as computing resources shift toward artificial intelligence projects. BlocksBridge Consulting tracked steady declines for Foundr...","id":1740,"createdAt":"2026-01-15T02:20:04.324Z","updatedAt":"2026-01-15T18:00:04.565Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6968de774280278354e1c823","news_date":"2026-01-15T12:42:53.111Z","news_title":"Bitcoin-Backed Credit Card Launches in Argentina via Lemon","news_subtitle":"Argentina Crypto News Lemon has introduced Argentina's first Bitcoin-backed Visa credit card, allowing users to access Argentine peso financing without liquidating their Bitcoin holdings through a collateral-based system. Customers must lock up 0.01 Bitcoin as collateral, approxi...","id":1760,"createdAt":"2026-01-15T12:50:04.996Z","updatedAt":"2026-01-15T18:00:04.838Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6968e0cf4280278354e3001c","news_date":"2026-01-15T12:42:53.111Z","news_title":"Bitcoin Open Interest Drops 31%, Signals Bullish Reset","news_subtitle":"Bitcoin News Bitcoin derivatives open interest has declined 31% since October, creating a deleveraging signal that historically marks market bottoms and sets the stage for potential bullish recovery, according to CryptoQuant analysis. The drop in open interest on Bitcoin derivati...","id":1761,"createdAt":"2026-01-15T13:00:04.218Z","updatedAt":"2026-01-15T18:00:04.007Z"}]