[{"crypto_id":"1","crypto_name":"BTC","news_id":"6964069a42802783544ba2e0","news_date":"2026-01-11T20:22:48.117Z","news_title":"This Week, a Meeting Will Determine the Fate of Cryptocurrencies – Here’s the Date and Time","news_subtitle":"A meeting concerning the fate of the cryptocurrency market will be on the agenda of the US Congress this week. Here are the details. Continue Reading: This Week, a Meeting Will Determine the Fate of Cryptocurrencies – Here’s the Date and Time","id":1599,"createdAt":"2026-01-11T20:40:05.235Z","updatedAt":"2026-01-12T02:00:06.208Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6964170442802783545f2964","news_date":"2026-01-11T21:32:49.347Z","news_title":"Analysts Identify Bitcoin’s $87K Support as Critical Market Pivot","news_subtitle":"Bitcoin $87,200 support defines current market structure and short-term directional bias for price action stability. A daily close below $87,200 may expose liquidity toward $80,600 and deeper historical demand zones. Whale positioning on Bitfinex suggests leverage reduction while...","id":1600,"createdAt":"2026-01-11T21:50:04.651Z","updatedAt":"2026-01-12T16:10:06.557Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"696430cc42802783547cb9f9","news_date":"2026-01-11T23:22:48.729Z","news_title":"India Strengthens KYC & AML Laws to Securely Onboard New Crypto Users","news_subtitle":"India Implements Stricter KYC Regulations for Cryptocurrency Platforms Amid Regulatory Scrutiny India’s Financial Intelligence Unit (FIU) has introduced new enforcement measures aimed at strengthening the onboarding process for cryptocurrency users. The updated guidelines mandate...","id":1602,"createdAt":"2026-01-11T23:40:06.259Z","updatedAt":"2026-01-12T10:00:07.034Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"696453f24280278354996add","news_date":"2026-01-12T01:52:48.765Z","news_title":"Bitcoin Mining Difficulty Drops in First 2026 Update","news_subtitle":"Bitcoin News Bitcoin network mining difficulty recorded a slight decline to 146.4 trillion on Thursday, marking the first adjustment of 2026 after repeated highs throughout 2025. The relative computing challenge of adding new blocks to the decentralized blockchain ledger decrease...","id":1604,"createdAt":"2026-01-12T02:10:05.136Z","updatedAt":"2026-01-12T18:00:05.615Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"696470134280278354a785fb","news_date":"2026-01-12T03:52:48.440Z","news_title":"South Korea Lifts Ban on Corporate Crypto Investments","news_subtitle":"South Korea authorizes corporate crypto investments, ending a nine-year prohibition and impacting up to 3,500 entities. Read original article on coincu.com","id":1609,"createdAt":"2026-01-12T04:10:05.870Z","updatedAt":"2026-01-12T14:00:11.373Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69648e8b4280278354d709bc","news_date":"2026-01-12T06:02:48.498Z","news_title":"South Korea to lift ban on corporate crypto investment: Report","news_subtitle":"South Korea’s finance regulator reportedly updated corporate crypto guidelines, permitting listed firms to invest up to 5% of equity in digital assets.","id":1611,"createdAt":"2026-01-12T06:50:06.071Z","updatedAt":"2026-01-12T09:50:05.991Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6964c21e4280278354f0664b","news_date":"2026-01-12T09:42:50.103Z","news_title":"Bitcoin Market Analysis: Three Critical Factors Traders Must Watch This Week","news_subtitle":"BitcoinWorld Bitcoin Market Analysis: Three Critical Factors Traders Must Watch This Week As global markets open on Monday, January 13, 2025, Bitcoin traders face a pivotal week shaped by three distinct yet interconnected factors. Market analysts from Cointelegraph and other lead...","id":1620,"createdAt":"2026-01-12T10:00:06.630Z","updatedAt":"2026-01-12T10:40:06.416Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6964c4744280278354f15bef","news_date":"2026-01-12T11:32:47.969Z","news_title":"South Korea eases rules on company crypto holdings","news_subtitle":"South Korea’s financial regulator moves to allow listed firms and professional investors to buy cryptocurrencies under strict new guidelines.","id":1623,"createdAt":"2026-01-12T10:10:05.931Z","updatedAt":"2026-01-12T13:30:05.972Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6964cdd64280278354f5b6c6","news_date":"2026-01-12T10:32:48.801Z","news_title":"South Korea Ends Nine-Year Ban on Corporate Crypto Investing","news_subtitle":"South Korea lifted its 2017 ban, allowing listed firms and professional investors limited crypto access under new FSC rules. Eligible entities can invest up to 5% of equity in top-20 cryptocurrencies on the country’s five regulated exchanges. The move aims to boost liquidity and ...","id":1628,"createdAt":"2026-01-12T10:50:05.729Z","updatedAt":"2026-01-12T13:20:06.505Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6964f35542802783540701f4","news_date":"2026-01-12T13:12:49.339Z","news_title":"Michael Saylor’s Strategy Pushes Bitcoin Holdings to 687,410 BTC After Newest Purchase","news_subtitle":"Michael Saylor confirmed another major Bitcoin purchase, reinforcing Strategy’s aggressive accumulation strategy at the start of 2026. Another Large Bitcoin Buy According to Saylor’s statement, Strategy acquired 13,627 BTC for approximately $1.25 billion, paying an average price ...","id":1638,"createdAt":"2026-01-12T13:30:05.390Z","updatedAt":"2026-01-12T14:30:06.379Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6964f5b14280278354080a19","news_date":"2026-01-12T13:22:56.084Z","news_title":"Ethereum-Bitcoin Ratio Follows 2019 Pattern After April Low","news_subtitle":"Ethereum And Bitcoin News The Ethereum-Bitcoin ratio hit bottom in April 2025 and has tracked a trajectory similar to the 2019 market cycle, crypto analyst Michaël van de Poppe said Sunday. Van de Poppe cited rising stablecoin supply, increased tokenized real-world assets, and he...","id":1640,"createdAt":"2026-01-12T13:40:02.775Z","updatedAt":"2026-01-12T18:00:04.560Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6964fcb342802783540b3d55","news_date":"2026-01-12T13:52:49.284Z","news_title":"Future Holdings Agrees to H100 Takeover in Swiss Expansion","news_subtitle":"Crypto News Future Holdings, a Switzerland-based Bitcoin treasury company backed by industry veteran Adam Back, has agreed to preliminary terms that may result in its acquisition by Sweden-listed H100 Group. The Swiss Bitcoin treasury company announced Monday it entered a non-bin...","id":1642,"createdAt":"2026-01-12T14:10:06.713Z","updatedAt":"2026-01-12T18:00:04.984Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"696503bf42802783540ede95","news_date":"2026-01-12T14:32:49.319Z","news_title":"Strategy makes biggest Bitcoin purchase since July 2025, adds $1.25B in BTC","news_subtitle":"Strategy’s latest Bitcoin buy highlights how capital markets continue to drive corporate BTC treasury expansion in 2026.","id":1643,"createdAt":"2026-01-12T14:42:18.271Z","updatedAt":"2026-01-12T18:00:06.032Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69651b2a42802783541aa9cf","news_date":"2026-01-12T16:02:47.914Z","news_title":"Strategy Expands Bitcoin Holdings With a Fresh $1.25B Buy","news_subtitle":"Strategy, a Bitcoin-focused company led by Chairman Michael Saylor, has once again made news in the cryptocurrency market The post Strategy Expands Bitcoin Holdings With a Fresh $1.25B Buy appeared first on TheCoinrise.com.","id":1647,"createdAt":"2026-01-12T16:20:05.938Z","updatedAt":"2026-01-12T18:00:06.471Z"}]