[{"crypto_id":"1","crypto_name":"BTC","news_id":"6961c3b6428027835481fb80","news_date":"2026-01-10T03:12:49.141Z","news_title":"Supreme Court Decision Expands Crypto Seizure Powers in South Korea","news_subtitle":"South Korean Supreme Court makes historic ruling on Bitcoin seizure, ruling that Bitcoins in accounts on Korean cryptocurrency exchanges are subject to seizure under the Criminal Procedure Act, finally putting an end to questions about the treatment of cryptocurrency in criminal ...","id":1545,"createdAt":"2026-01-10T13:10:06.112Z","updatedAt":"2026-01-10T18:00:05.273Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"696200a54280278354c2130e","news_date":"2026-01-10T07:32:48.726Z","news_title":"South Korea Supreme Court Confirms Bitcoin Seizure as Legal","news_subtitle":"South Korea's Supreme Court rules that Bitcoin held on centralized exchanges is lawfully seizable, impacting asset seizure rules and anti-money laundering capabilities. Read original article on coinlive.me","id":1546,"createdAt":"2026-01-10T13:10:06.266Z","updatedAt":"2026-01-10T18:00:05.660Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"696200a34280278354c2124d","news_date":"2026-01-10T07:32:48.726Z","news_title":"Will This Development Ignite Bitcoin and Altcoins: Positive News May Soon Arrive from South Korea","news_subtitle":"South Korea is preparing to approve cryptocurrency spot ETFs, following in the footsteps of the US. Here are all the details. Continue Reading: Will This Development Ignite Bitcoin and Altcoins: Positive News May Soon Arrive from South Korea","id":1553,"createdAt":"2026-01-10T14:00:06.104Z","updatedAt":"2026-01-10T18:00:06.061Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"696171ac42802783544b7d00","news_date":"2026-01-09T21:22:49.351Z","news_title":"South Korea Plans Bitcoin ETF Debut and Stronger Crypto Asset Rules","news_subtitle":"The government recently shared plans to promote digital asset exchange-traded funds (ETFs), with a strong focus on a Bitcoin ETF The post South Korea Plans Bitcoin ETF Debut and Stronger Crypto Asset Rules appeared first on TheCoinrise.com.","id":1558,"createdAt":"2026-01-10T14:30:16.464Z","updatedAt":"2026-01-10T18:00:06.466Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69626a1d4280278354fa7393","news_date":"2026-01-10T15:02:50.314Z","news_title":"Colombia Implements New Mandatory Crypto Reporting Rules for Exchanges","news_subtitle":"Colombia Implements Crypto Service Provider Reporting Regulations to Enhance Tax Oversight Colombia’s Directorate of National Taxes and Customs (DIAN) has introduced a comprehensive mandatory reporting framework targeting cryptocurrency service providers. This move aims to align ...","id":1561,"createdAt":"2026-01-10T17:00:05.701Z","updatedAt":"2026-01-10T18:00:07.016Z"}]