[{"crypto_id":"1","crypto_name":"BTC","news_id":"695feef54280278354e7b2e1","news_date":"2026-01-08T17:52:49.931Z","news_title":"Florida Bitcoin Bill Sparks Bold Move: Proposal to Allocate 10% of State Funds to Cryptocurrency Reserves","news_subtitle":"BitcoinWorld Florida Bitcoin Bill Sparks Bold Move: Proposal to Allocate 10% of State Funds to Cryptocurrency Reserves In a potentially transformative move for public finance, Florida lawmakers have introduced legislation that could allocate a significant portion of state reserve...","id":1469,"createdAt":"2026-01-08T18:10:05.243Z","updatedAt":"2026-01-08T21:40:05.686Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"695ff8534280278354ed37b9","news_date":"2026-01-08T18:32:48.041Z","news_title":"Coincheck Group Announces $112M Stock Deal to Acquire Digital Asset Manager 3iQ","news_subtitle":"Coincheck Group Expands Its Cryptocurrency Footprint Through Acquisition of 3iQ Coincheck Group, a Nasdaq-listed Japanese cryptocurrency exchange operator, announced a significant strategic move by acquiring a 97% stake in Canadian digital asset manager 3iQ. This deal marks a maj...","id":1472,"createdAt":"2026-01-08T18:50:05.327Z","updatedAt":"2026-01-08T19:50:05.684Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"696008c04280278354f541a4","news_date":"2026-01-08T19:42:49.699Z","news_title":"Polygon Acquisition: Strategic Move to Acquire Bitcoin ATM Giant Coinme for $125 Million","news_subtitle":"BitcoinWorld Polygon Acquisition: Strategic Move to Acquire Bitcoin ATM Giant Coinme for $125 Million In a significant development for the cryptocurrency sector, blockchain scaling platform Polygon is reportedly pursuing a major acquisition of Bitcoin ATM operator Coinme. Accordi...","id":1475,"createdAt":"2026-01-08T20:00:05.856Z","updatedAt":"2026-01-08T21:30:05.360Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6960202a428027835401206e","news_date":"2026-01-08T21:22:48.306Z","news_title":"Bitcoin Faces Flat Trading Through Q1 2026, Says CryptoQuant CEO","news_subtitle":"Bitcoin News CryptoQuant CEO Ki Young Ju projected that Bitcoin will trade sideways through the first quarter of 2026, contradicting typical seasonal patterns. Capital inflows into Bitcoin have stopped as investors rotate back into traditional assets including stocks, gold, and s...","id":1477,"createdAt":"2026-01-08T21:40:04.670Z","updatedAt":"2026-01-09T14:20:05.275Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6960202a428027835401206f","news_date":"2026-01-08T21:22:48.306Z","news_title":"Morgan Stanley Bitcoin ETF Launch Brings Additional Strategic Value, Analysts Say","news_subtitle":"Bitcoin News Morgan Stanley filed with the Securities and Exchange Commission on Tuesday to launch two exchange-traded funds tracking Bitcoin and Solana, marking the investment bank's entry into spot crypto ETF markets. ProCap chief investment officer Jeff Park stated that even m...","id":1478,"createdAt":"2026-01-08T21:40:05.030Z","updatedAt":"2026-01-09T13:50:06.377Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"696022824280278354023659","news_date":"2026-01-08T21:32:48.992Z","news_title":"Bitcoin Price Drops Under $90K as Early 2026 Rally Loses Steam","news_subtitle":"Bitcoin News Bitcoin has fallen back below the $90,000 threshold at the time of writing after an early January surge faded, with the retreat reflecting overhead resistance and cautious positioning following disappointing 2025 performance. The digital asset approached $95,000 at t...","id":1480,"createdAt":"2026-01-08T21:50:04.146Z","updatedAt":"2026-01-09T18:00:06.368Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"696024da428027835403b1eb","news_date":"2026-01-08T21:42:48.831Z","news_title":"October Crypto Crash Left Market Makers Holding Coins, BitMEX Reports","news_subtitle":"Crypto News Market makers were left holding bags of crypto following October's crash, leading to the most challenging trading conditions since 2022, according to BitMEX's annual report. The market cratered on Oct. 10, with Bitcoin falling from $121,000 to $107,000. Several altcoi...","id":1482,"createdAt":"2026-01-08T22:00:03.772Z","updatedAt":"2026-01-09T18:00:06.745Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6960309442802783540ef425","news_date":"2026-01-08T22:32:48.505Z","news_title":"Nexo’s Revolutionary Zero-Interest Credit Lines for BTC and ETH Holders Transform Crypto Lending Landscape","news_subtitle":"BitcoinWorld Nexo’s Revolutionary Zero-Interest Credit Lines for BTC and ETH Holders Transform Crypto Lending Landscape In a bold move reshaping cryptocurrency finance, leading digital asset lender Nexo has unveiled groundbreaking zero-interest credit lines exclusively for Bitcoi...","id":1488,"createdAt":"2026-01-09T02:40:05.624Z","updatedAt":"2026-01-09T07:40:05.956Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"6960af234280278354abc872","news_date":"2026-01-09T07:32:50.085Z","news_title":"CMC Market Pulse: ICOs, ICOs, Everywhere","news_subtitle":"Market Overview 📉 *Data as of 6:45 AM UTC on January 9, 2026. Bitcoin (BTC) continued its sideways chop, moving up 2.36% this week, while Ethereum (ETH) followed along, moving up 2.92% in the same period. Total crypto market cap rose slightly, surging 3.32% to close the week at ...","id":1496,"createdAt":"2026-01-09T07:50:02.496Z","updatedAt":"2026-01-09T18:00:05.238Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"696105db4280278354ebd101","news_date":"2026-01-09T13:42:49.959Z","news_title":"Nexo Rolls Out Zero-Interest Loans for Bitcoin and Ethereum","news_subtitle":"Crypto News Nexo has launched a zero-interest crypto lending product that allows Bitcoin and Ethereum holders to borrow against their assets through fixed-term loans. The product, called Zero-interest Credit, offers structured loans for users holding Bitcoin and Ethereum, with re...","id":1507,"createdAt":"2026-01-09T14:00:02.939Z","updatedAt":"2026-01-09T18:00:05.617Z"},{"crypto_id":"1","crypto_name":"BTC","news_id":"69610ce24280278354f053b9","news_date":"2026-01-09T14:12:48.162Z","news_title":"GameFi News: Gaming Sector Rallies, WOD Soars, but Funding Slips YoY","news_subtitle":"TL;DR Sentiment: BTC rallies; dominance slips as altcoins regain ground. GameFi: sector market cap +14% WoW; top gaming tokens broadly green. Reality check: only a few games top 100K wallets; stay picky. Bitcoin (BTC) started the year strong, briefly touching its highest value si...","id":1510,"createdAt":"2026-01-09T14:30:04.907Z","updatedAt":"2026-01-09T18:00:05.991Z"}]