[{"crypto_id":"1839","crypto_name":"BNB","news_id":"695222714280278354322348","news_date":"2025-12-29T06:40:46.095Z","news_title":"BNB Chain 2025 Updates: What Changed, What Works, and What It Means for Builders and Users","news_subtitle":"BNB Chain 2025 updates cover Maxwell hard fork, memecoin liquidity, RWAs, builder programs, validator changes, and ecosystem growth.","id":1089,"createdAt":"2025-12-29T07:00:12.659Z","updatedAt":"2025-12-29T18:00:12.499Z"},{"crypto_id":"1839","crypto_name":"BNB","news_id":"6952459c428027835465d5a4","news_date":"2025-12-29T09:10:47.102Z","news_title":"Digital Yuan to earn interest from 2026 in push for adoption","news_subtitle":"China will begin paying interest on holdings of its central bank digital currency (CBDC), the digital yuan, starting January 1, 2026, as authorities intensify efforts to drive broader adoption after several years of pilot trials. Under a newly issued action plan from the People’s...","id":1093,"createdAt":"2025-12-29T09:30:11.836Z","updatedAt":"2025-12-29T18:00:12.733Z"},{"crypto_id":"1839","crypto_name":"BNB","news_id":"695284e14280278354856087","news_date":"2025-12-29T13:40:46.136Z","news_title":"Belgium introduces 10% tax on stocks, bonds, and crypto gains","news_subtitle":"Belgium will implement a 10% tax on realized capital gains starting January 1, 2026, marking a major shift in the country’s long-standing tax framework and signaling the end of what many investors considered one of Europe’s most favorable investment environments. The Belgian gove...","id":1102,"createdAt":"2025-12-29T14:10:20.414Z","updatedAt":"2025-12-29T18:00:12.266Z"},{"crypto_id":"1839","crypto_name":"BNB","news_id":"695292f142802783548dc99e","news_date":"2025-12-29T14:40:46.749Z","news_title":"RWAs rise rapidly to top DeFi category as institutions join","news_subtitle":"Real-world asset (RWA) protocols have emerged as one of the fastest-growing sectors in decentralized finance (DeFi) in 2025, surpassing decentralized exchanges (DEXs) to become the fifth-largest category by total value locked (TVL), according to data from DefiLlama. As of the lat...","id":1106,"createdAt":"2025-12-29T15:00:14.347Z","updatedAt":"2025-12-29T18:00:12.840Z"}]