[{"crypto_id":"4705","crypto_name":"PAXG","post_time":"2025-12-18T18:48:19.243Z","text_content":"$PAXG Target 6000 for 2026","gravity_id":"372078319","id":35825,"createdAt":"2025-12-18T18:50:16.919Z","updatedAt":"2025-12-19T17:50:19.983Z"},{"crypto_id":"4705","crypto_name":"PAXG","post_time":"2025-12-18T19:06:09.114Z","text_content":"$PAXG The only “crypto” i feel safe in. Slowly griding up. Insulate your portfolio with a good 30% allocation. Bitcoin looks like its gunna get rugged next year","gravity_id":"372079407","id":35856,"createdAt":"2025-12-18T19:10:15.830Z","updatedAt":"2025-12-19T17:50:19.763Z"},{"crypto_id":"4705","crypto_name":"PAXG","post_time":"2025-12-18T20:46:45.115Z","text_content":"We’ve acquired a new 300-hectare gold concession in Peru, Madre de Dios. Licensed, scoped, and work has already started. First samples confirm gold at 5.5m depth and deeper.\n\nWe're expanding access to real gold production onchain ↴ \nStake $AYNI → earn PAXG rewards backed by physical gold production.\n\nStart here 🟡 http://app.ayni.gold/signup?utm_source=X&utm_campaign=main","gravity_id":"372080945","id":36057,"createdAt":"2025-12-18T20:50:18.676Z","updatedAt":"2025-12-19T17:50:19.558Z"},{"crypto_id":"4705","crypto_name":"PAXG","post_time":"2025-12-18T18:40:45.115Z","text_content":"Gold ends 2025 on a strong footing as analyst optimism and corporate reshuffling support the sector\n\n$XAU closes out the year in a position of steady strength, backed by bullish 2026 outlooks from major analysts, persistent ETF demand, and a new wave of tokenized gold products.\n\nMarket trends\n• Analyst optimism: Jefferies remains constructive on gold miners into 2026, expecting supportive conditions to persist. Berenberg sees 2026 as a shift away from “single-theme” investing in the sector, opening up broader opportunities.\n• ETF inflows: institutional interest stays solid into year-end. iShares Physical Metals issued over 960,000 new units this week, while Xtrackers added another tranche, confirming continued allocation to gold.\n• Tokenization builds: the total market cap of gold-backed stablecoins has crossed $4B, underscoring rising demand for digital claims on physical metal.\n\nTechs\nSupport: $4,300–4,350 (current consolidation band)\nResistance: $4,450–4,500 (initial 2026 upside target)\n\nEquities\nPrecious-metals equities are busy with restructuring, portfolio optimization, and new funding, all against a favorable 2026 backdrop.\n• Restructuring:\n– Seabridge Gold plans to spin out the Courageous Lake project into a separately listed company, aiming to unlock hidden value and attract targeted capital.\n– First Majestic Silver sells the Del Toro mine, streamlining its portfolio while expanding resources at Santa Elena.\n• Ops & funding:\n– Hycroft Mining hits a 52-week high at $14.17 and reports record silver grades at the Vortex system.\n– GreenTech Metals starts drilling at the Munni Munni PGE project.\n– The Bibemi project in Cameroon delivers encouraging economics in a preliminary assessment.\n– Freeport-McMoRan announces dividends, reinforcing the cash-flow story for diversified miners.\n• Deals & ratings:\n– Richmond Hill Resources signs an agreement on a gold project in Ontario.\n– Canaccord Genuity initiates Banyan Gold with a “Speculative Buy.”\n– UBS downgrades Hochschild Mining, reflecting a more selective stance within the group.\n\nCrypto vs Gold\nThe year closes with the usual valuation debate, but fundamentals remain sharply different.\n• Bitcoin:\n– Michaël van de Poppe argues BTC is “too undervalued versus gold” based on technicals.\n– Grayscale says quantum-computing threats are unlikely to materially impact crypto in 2026, easing some tail-risk concerns.\n– Robert Kiyosaki continues to advise crypto investors on how to “get rich in crisis,” staying active in both camps.\n• Gold:\n– Shows growing digital maturity via gold stablecoins now worth $4B+ in aggregate.\n– Retains the advantage of real assets and cash flows, reinforced by dividends from names like Freeport-McMoRan and strong operational updates across the sector.\nTakeaway: while the relative-value debate continues, gold’s mix of classic corporate actions (spinoffs, dividends) and adaptation to the digital era (stablecoins) underscores its durability.\n\nWhat to watch\n• Final 2025 macro data: last readings on inflation and growth in key economies.\n• Central-bank commentary as they wrap up the year.\n• Whether gold and miners can hold their year-to-date gains into January.\n• Additional restructuring or spin-off announcements from mid- and large-cap miners.\n\nTakeaways\n• Gold: finishing the year near $4,350 provides a solid launchpad for 2026. Analyst optimism (Jefferies, Berenberg), persistent ETF inflows, and the expansion of gold-backed stablecoins all support a continued uptrend. The $4,300 level remains key support.\n• Miners: active restructuring (Seabridge), portfolio optimization (First Majestic), and operational strength (Hycroft, Freeport) create selective opportunities. Prioritize companies with clear value-creation plans and high-quality projects.\n• Crypto: caution is still warranted. Even with arguments about BTC undervaluation, volatility and lack of intrinsic cash flows contrast sharply with dividend-paying miners, making gold the more predictable allocation for diversification at year-end.\n\nNot financial advice. Always do your own research.\nAyni Gold brings real-world gold mining on-chain.\n\nStake $AYNI → earn $PAXG rewards backed by physical gold production. Start here 🟡 http://app.ayni.gold/signup?utm_source=X&utm_campaign=main","gravity_id":"372077395","id":36094,"createdAt":"2025-12-18T21:10:19.166Z","updatedAt":"2025-12-19T17:50:20.186Z"},{"crypto_id":"4705","crypto_name":"PAXG","post_time":"2025-12-19T07:26:05.566Z","text_content":"$PAXG  Write this down!!! The price of gold will reach USD 6,040 per ounce in 2030, and USD 9,290 per ounce in 2035. (Sorry, this is not a prediction, but HIS prophecy)","gravity_id":"372094059","id":36876,"createdAt":"2025-12-19T07:30:18.643Z","updatedAt":"2025-12-19T17:50:19.353Z"},{"crypto_id":"4705","crypto_name":"PAXG","post_time":"2025-12-19T09:06:02.777Z","text_content":"$PAXG  is trading in a steady uptrend, holding above key moving averages and consolidating near recent highs. Momentum remains positive, and higher lows suggest continuation as long as price stays above the trend support zone.   Targets TP1: 4,380 TP2: 4,450 TP3: 4,550  Stop Loss: 4,250","gravity_id":"372096577","id":37044,"createdAt":"2025-12-19T09:10:19.054Z","updatedAt":"2025-12-19T17:50:19.141Z"},{"crypto_id":"4705","crypto_name":"PAXG","post_time":"2025-12-19T17:35:00.926Z","text_content":"$PAXG Is there anyone in this world who can help me?\nI have nothing left. I am on the verge of losing my home and I don’t know how to survive what’s coming.\n\n\nEth: 0x853c6eAA5F3B187E19ef429ed4025EB877850B33\n\n\nBtc: bc1q8ktu8x46xd6ldlg4c6rjh5vz0h9ym7x9xhw6pt\n\n\nSolana: 8pQSWwCorrMGnee5r1FCSHpRE45MRQpajrmR4UNgsGi2","gravity_id":"372110660","id":37931,"createdAt":"2025-12-19T17:40:18.322Z","updatedAt":"2025-12-19T17:50:18.930Z"}]