[{"crypto_id":"52","crypto_name":"XRP","news_id":"6947c5134280278354b3cde0","news_date":"2025-12-22T09:59:45.705Z","news_title":"# Ripple Hints at Institutional Credit System on XRP Ledger","news_subtitle":"Ripple unveils institutional lending protocol for XRP Ledger, led by Edward Hennis, potentially boosting XRP holders and institutional systems. Read original article on coinwy.com","id":789,"createdAt":"2025-12-21T10:20:10.969Z","updatedAt":"2025-12-22T10:10:10.590Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6948d9a24280278354884121","news_date":"2025-12-22T05:39:43.446Z","news_title":"XRP Shows a Powerful Bullish RSI Divergence on the Daily Chart","news_subtitle":"XRP forms a rare bullish RSI divergence, signaling fading selling pressure on daily charts. On-chain data confirms reduced selling as long term holders slow distribution. XRP must clear $1.96 to confirm a meaningful trend reversal. Ripple XRP’s price action appears quiet on the s...","id":822,"createdAt":"2025-12-22T08:10:07.969Z","updatedAt":"2025-12-22T13:00:08.616Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694896d94280278354437f22","news_date":"2025-12-22T01:09:41.522Z","news_title":"XRPL Propose Single-Use Keys Feature to Address Quantum Threats","news_subtitle":"Developers behind the XRP Ledger (XRPL), a recently upgraded decentralized blockchain network, have proposed a new feature The post XRPL Propose Single-Use Keys Feature to Address Quantum Threats appeared first on TheCoinrise.com.","id":823,"createdAt":"2025-12-22T08:10:08.341Z","updatedAt":"2025-12-22T11:20:05.847Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69487be1428027835434224d","news_date":"2025-12-21T22:59:42.023Z","news_title":"XRP Spot ETFs: A Staggering $1.2B Inflow Success Story Faces Price Puzzle","news_subtitle":"BitcoinWorld XRP Spot ETFs: A Staggering $1.2B Inflow Success Story Faces Price Puzzle The launch of U.S. spot XRP ETFs has ignited a firestorm of institutional capital, with a staggering $1.2 billion flowing into these funds in just weeks. This monumental figure signals robust i...","id":829,"createdAt":"2025-12-22T10:20:07.816Z","updatedAt":"2025-12-22T11:10:08.587Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694926fd4280278354b31b2c","news_date":"2025-12-22T11:09:47.240Z","news_title":"Expert Sends a Very Important Message to XRP Holders","news_subtitle":"In the fast-moving world of digital assets, a single overlooked detail can separate a smooth transaction from a costly mistake. As XRP continues to play a central role in cross-border payments and exchange-based trading, the mechanics of transferring tokens safely have become inc...","id":832,"createdAt":"2025-12-22T11:20:05.244Z","updatedAt":"2025-12-22T18:00:07.585Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694929544280278354b47298","news_date":"2025-12-22T11:19:45.051Z","news_title":"XRP Lending Goes Live — Ripple Lets Institutions Borrow Like Cash","news_subtitle":"Ripple rolls out native XRP lending, unlocking institutional-grade borrowing.","id":833,"createdAt":"2025-12-22T11:30:06.226Z","updatedAt":"2025-12-22T18:00:07.957Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694940c54280278354c1a3fe","news_date":"2025-12-22T12:59:44.182Z","news_title":"Ripple CTO Reveals More Use-Cases for the XRP Ledger Beyond Payments","news_subtitle":"Ripple CTO highlights XRP Ledger expansion beyond payments into broader financial infrastructure XRP Ledger positioned for lending, yield products, and tokenized real-world assets David Schwartz outlines XRPL’s shift toward practical, compliance-friendly financial use cases Recen...","id":838,"createdAt":"2025-12-22T13:10:07.933Z","updatedAt":"2025-12-22T14:20:07.860Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694941ef4280278354c23ce4","news_date":"2025-12-22T13:04:43.790Z","news_title":"Aave Governance Pushes for Full DAO Control Over Brand Assets","news_subtitle":"Aave token holders seek direct DAO control over branding assets Governance proposal challenges informal stewardship of domains social channels globally Legal safeguards proposed to prevent private monetization of Aave identity The Aave community entered a new phase of debate afte...","id":840,"createdAt":"2025-12-22T13:20:05.440Z","updatedAt":"2025-12-22T14:20:07.485Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694957074280278354cf58ea","news_date":"2025-12-22T14:34:43.673Z","news_title":"Unlock Yield: Upshift, Clearstar & Flare Launch New earnXRP Product","news_subtitle":"BitcoinWorld Unlock Yield: Upshift, Clearstar & Flare Launch New earnXRP Product For XRP holders seeking more than just price appreciation, a new opportunity has arrived. A strategic collaboration between Upshift, Clearstar, and Flare has resulted in the launch of earnXRP, a dedi...","id":844,"createdAt":"2025-12-22T14:50:04.796Z","updatedAt":"2025-12-22T18:00:08.324Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6949512d4280278354cb4c4e","news_date":"2025-12-22T14:09:45.494Z","news_title":"EarnXRP launches on Flare: First XRP-denominated yield product","news_subtitle":"Upshift, Clearstar, and Flare have unveiled earnXRP, a new onchain yield vault that allows XRP holders to earn compounded, XRP-denominated returns.","id":845,"createdAt":"2025-12-22T14:50:04.948Z","updatedAt":"2025-12-22T18:00:09.227Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694960654280278354d567ce","news_date":"2025-12-22T15:14:43.335Z","news_title":"XRP News: Ripple CTO Says One Metric Matters More Than Price","news_subtitle":"Ripple’s chief technology officer David Schwartz said transaction activity and liquidity are the most reliable indicators of real economic use on the XRP Ledger, as debate continues over how to measure blockchain adoption beyond price movements. Speaking during a discussion on on...","id":846,"createdAt":"2025-12-22T15:30:06.775Z","updatedAt":"2025-12-22T18:00:08.846Z"}]