[{"crypto_id":"52","crypto_name":"XRP","news_id":"694142b24280278354b7dcba","news_date":"2025-12-17T07:19:44.111Z","news_title":"Spot-Quoted XRP Futures Finally Live on CME – What it Means for XRP","news_subtitle":"CME launches spot-quoted XRP futures, expanding regulated access for XRP traders. XRP gains regulated futures exposure as CME targets broader market participation. Spot-based XRP futures reduce rollover costs while improving institutional trading flexibility. Spot-quoted XRP futu...","id":602,"createdAt":"2025-12-16T15:40:06.974Z","updatedAt":"2025-12-17T11:30:12.226Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6941dc3242802783542f5ee6","news_date":"2025-12-16T22:24:46.065Z","news_title":"CME Group Adds TAS Trading for SOL and XRP Futures","news_subtitle":"CME Group's new TAS trading for SOL and XRP futures offers enhanced settlement risk management options, starting December 16. Read original article on coincu.com","id":619,"createdAt":"2025-12-16T22:40:06.254Z","updatedAt":"2025-12-17T18:00:06.349Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694245a542802783548b9984","news_date":"2025-12-17T16:19:42.113Z","news_title":"XRP Urgent Alert Issued, Critical SHIB Price Level Revealed to Bulls, Solana Volume Rockets 40% Amid Golden Cross Setup — Crypto News Digest","news_subtitle":"Crypto market today: XRP Ledger Foundation issues urgent upgrade; max pain price for Shiba Inu bulls revealed; Solana's price surge might be closer.","id":629,"createdAt":"2025-12-17T06:40:06.440Z","updatedAt":"2025-12-17T18:00:07.424Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694262f342802783549ad47d","news_date":"2025-12-17T07:59:46.093Z","news_title":"Visa bets big on stablecoins once again, launches advisory practice to guide businesses","news_subtitle":"Visa is doubling down on its role in the future of digital payments with the launch of its Stablecoins Advisory Practice.","id":631,"createdAt":"2025-12-17T08:20:06.478Z","updatedAt":"2025-12-17T18:00:06.805Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6942942f4280278354b84ad7","news_date":"2025-12-17T13:24:46.117Z","news_title":"Bhutan’s Bold Move: Bitcoin to Fund Gelephu Mindfulness City Development","news_subtitle":"Bhutan taps Bitcoin to fund Gelephu Mindfulness City’s development projects. Bitcoin-backed development aims to boost Bhutan’s economy and create jobs. GMC’s crypto-friendly policies attract global businesses in various industries. Bhutan is set to tap into its significant Bitcoi...","id":637,"createdAt":"2025-12-17T11:40:05.122Z","updatedAt":"2025-12-17T18:00:06.005Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694291d04280278354b6cac1","news_date":"2025-12-17T11:19:41.409Z","news_title":"XRP ETF Wave Heats Up as CoinShares & WisdomTree Signal Entry","news_subtitle":"Spot XRP ETF momentum builds as CoinShares and WisdomTree join the queue.","id":638,"createdAt":"2025-12-17T11:50:06.700Z","updatedAt":"2025-12-17T18:00:07.109Z"}]