[{"crypto_id":"52","crypto_name":"XRP","news_id":"69348fe942802783540d68ae","news_date":"2025-12-07T06:24:40.707Z","news_title":"Ripple and SEC End Lawsuit After Nearly Five Years","news_subtitle":"The nearly five-year legal dispute between Ripple Labs and the SEC concluded, marking a significant moment for the cryptocurrency industry. Read original article on coinwy.com","id":217,"createdAt":"2025-12-06T20:30:04.408Z","updatedAt":"2025-12-07T18:00:05.260Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693508974280278354580403","news_date":"2025-12-07T04:54:41.856Z","news_title":"XRP Posts Only Positive Return Among Major Cryptocurrencies In 2025, Data Shows","news_subtitle":"XRP gains 4% in 2025 as Ripple integrates treasury platform handling $12.5T flows","id":223,"createdAt":"2025-12-07T05:10:05.343Z","updatedAt":"2025-12-07T18:00:05.414Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69353d53428027835495056e","news_date":"2025-12-07T08:39:44.593Z","news_title":"South Korea to Hold Crypto Exchanges Liable for Hacks, Aligning with Banks","news_subtitle":"South Korea plans to impose strict liability rules on exchanges. New regulations aim to hold crypto platforms accountable for hacks. Upbit breach sparks tighter oversight and no-fault compensation laws. South Korea is set to introduce sweeping new regulations that will require cr...","id":229,"createdAt":"2025-12-07T09:00:06.161Z","updatedAt":"2025-12-07T18:00:05.904Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69358f594280278354c5f546","news_date":"2025-12-07T14:29:42.460Z","news_title":"XRP Amazing Streak Continues, Here’s What’s Happening","news_subtitle":"XRP sees 15-day inflow streak, attracting major institutional investors. Grayscale, Bitwise, and others now hold 0.7% of XRP’s cap. Ripple’s acquisitions, like GTreasury, boost institutional adoption and XRP growth. XRP’s recent performance has the crypto world buzzing. According...","id":241,"createdAt":"2025-12-07T14:40:04.057Z","updatedAt":"2025-12-07T18:00:05.565Z"}]