[{"crypto_id":"52","crypto_name":"XRP","news_id":"692f4c3842802783545d9e3a","news_date":"2025-12-02T20:29:42.662Z","news_title":"XRP ETF Inflows Hit $756M as Technical Signals Point to Recovery","news_subtitle":"XRP News Spot XRP exchange-traded funds recorded their 11th consecutive day of inflows, attracting $89.65 million on Monday and bringing cumulative inflows to $756 million since launch, according to data from SoSoValue. The ETFs have attracted investors every trading day since de...","id":13,"createdAt":"2025-12-03T04:33:55.168Z","updatedAt":"2025-12-03T18:00:04.193Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"692f20e342802783543c8aac","news_date":"2025-12-02T17:24:46.033Z","news_title":"Ripple Partners With RedotPay To Expand XRP-Powered Remittances in Africa","news_subtitle":"Ripple teams with RedotPay to enable fast XRP and crypto-to-NGN remittances, boosting Africa’s cross-border payment efficiency.","id":62,"createdAt":"2025-12-03T14:50:04.275Z","updatedAt":"2025-12-03T17:20:04.525Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"692f1fb44280278354323df2","news_date":"2025-12-02T17:19:44.019Z","news_title":"Vanguard Finally Opens Doors to Crypto ETF Trading","news_subtitle":"Vanguard allows BTC, ETH, XRP and SOL ETFs after years of resistance, driven by rising customer demand and stable ETF performance. Executives tracked liquidity and volatility as BlackRock’s IBIT growth helped push Vanguard to open access to regulated crypto products. Vanguard mai...","id":68,"createdAt":"2025-12-03T16:00:06.405Z","updatedAt":"2025-12-03T17:20:04.611Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"692f34c842802783544cfbe6","news_date":"2025-12-02T18:49:42.080Z","news_title":"XRP News: Ripple Technology Expands Global Stablecoin Transfers","news_subtitle":"RedotPay, a fintech company that specializes in stablecoin-based payments, has integrated Ripple’s cross-border payment technology to expand its global transfer capabilities. The move includes the launch of a new option allowing users to send cryptocurrency and have the recipient...","id":69,"createdAt":"2025-12-03T16:00:06.513Z","updatedAt":"2025-12-03T18:00:04.289Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"692f41af428027835455ac52","news_date":"2025-12-02T19:44:43.802Z","news_title":"Ripple Inks New Partnership to Advance Bank Integration for RLUSD","news_subtitle":"Ripple Labs has expanded RLUSD utility as a payment token with its latest partnership with fintech firm RedotPay.","id":71,"createdAt":"2025-12-03T17:30:03.839Z","updatedAt":"2025-12-03T18:00:04.380Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"692fff8b4280278354fd5f7e","news_date":"2025-12-03T09:14:45.930Z","news_title":"Could This Be One of the Major Catalysts for XRP Massive Future Growth?","news_subtitle":"The UK has formally recognized crypto and digital assets—including XRP—as property. London’s push toward regulated tokenization, digital finance, and digital identity now aligns strongly with the XRP Ledger’s settlement features. Analysts say this convergence of regulation, settl...","id":72,"createdAt":"2025-12-03T17:30:03.887Z","updatedAt":"2025-12-03T18:00:04.467Z"}]