[{"crypto_id":"52","crypto_name":"XRP","news_id":"6946d72d4280278354f1efd3","news_date":"2025-12-20T17:24:46.038Z","news_title":"Ripple Developers Tease XRP Ledger (XRPL) Lending Protocol","news_subtitle":"To complement the efforts of Ripple Labs in the XRP Ledger development, innovators are now working on a lending system.","id":772,"createdAt":"2025-12-20T17:20:08.282Z","updatedAt":"2025-12-21T18:00:06.675Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6946de3642802783541567dd","news_date":"2025-12-20T17:34:41.872Z","news_title":"Everytime XRP Breaks Below This SMA, a Strong Rally Always Follow","news_subtitle":"Crypto analyst Steph Is Crypto (@Steph_iscrypto) revealed in a recent post that XRP has entered a key technical zone. He pointed to XRP’s behavior around the 50-week simple moving average, a long-term trend indicator that has preceded sharp upside moves after extended periods of ...","id":773,"createdAt":"2025-12-20T17:50:06.625Z","updatedAt":"2025-12-21T06:20:07.868Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6946e1ba42802783541802b2","news_date":"2025-12-21T12:04:51.090Z","news_title":"XRP Holders Target Yield via New XRPL Lending Protocol","news_subtitle":"XRP holders anticipate earning institutional-grade yield through Ripple's new XRPL Lending Protocol. Read original article on theccpress.com","id":774,"createdAt":"2025-12-20T18:00:07.059Z","updatedAt":"2025-12-21T18:00:07.893Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6946e4174280278354195821","news_date":"2025-12-20T17:59:46.113Z","news_title":"Ripple Prepares XRPL Lending Protocol for Institutional Yield","news_subtitle":"Ripple introduces an institutional-grade XRPL Lending Protocol, focusing on secure, compliance-driven credit markets for XRP holders. Read original article on nftenex.com","id":775,"createdAt":"2025-12-20T18:20:07.228Z","updatedAt":"2025-12-21T18:00:07.037Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694712f6428027835433347c","news_date":"2025-12-20T23:19:42.177Z","news_title":"XRP News: Ripple CTO Details Plan to Expand Role in Global Finance","news_subtitle":"Key Insights: In the latest XRP news, Ripple CTO David Schwartz says the company is building finance tools for real use. Tokenized assets, a planned XRPL lending system, and stablecoin payments show how Ripple wants to lead rival institutions toward a wider adoption across global...","id":778,"createdAt":"2025-12-20T21:30:07.637Z","updatedAt":"2025-12-21T08:50:17.435Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69479059428027835495c763","news_date":"2025-12-21T14:04:43.481Z","news_title":"Ripple News: XRP Ledger Moves Toward Institutional Lending and Yield","news_subtitle":"Rather than copying existing DeFi lending models, the upcoming XRPL Lending Protocol is designed to mirror how professional credit markets […] The post Ripple News: XRP Ledger Moves Toward Institutional Lending and Yield appeared first on Coindoo.","id":784,"createdAt":"2025-12-21T06:30:25.398Z","updatedAt":"2025-12-21T18:00:07.519Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"694792ae4280278354970c7d","news_date":"2025-12-21T06:24:42.550Z","news_title":"Ripple's XRPL Introduces Institutional Yield Lending Protocol","news_subtitle":"Ripple unveils XRPL lending protocol, targeting institutional yield through on-ledger lending and fixed-term credit markets. Read original article on bitcoininfonews.com","id":785,"createdAt":"2025-12-21T06:40:07.224Z","updatedAt":"2025-12-21T10:10:07.941Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6947c5134280278354b3cde0","news_date":"2025-12-21T13:59:43.070Z","news_title":"# Ripple Hints at Institutional Credit System on XRP Ledger","news_subtitle":"Ripple unveils institutional lending protocol for XRP Ledger, led by Edward Hennis, potentially boosting XRP holders and institutional systems. Read original article on coinwy.com","id":789,"createdAt":"2025-12-21T10:20:10.969Z","updatedAt":"2025-12-21T18:00:06.315Z"}]