[{"crypto_id":"52","crypto_name":"XRP","news_id":"693872cd42802783541879c2","news_date":"2025-12-09T19:04:42.442Z","news_title":"XRP Upgrade Imminent: Major Amendment Just Days Away","news_subtitle":"XRP Ledger prepares for year's end upgrade with major amendment just days away.","id":332,"createdAt":"2025-12-09T19:20:04.849Z","updatedAt":"2025-12-10T09:50:05.011Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69388212428027835421edbf","news_date":"2025-12-10T00:09:42.957Z","news_title":"Finance Expert: Nobody Is Ready for What Comes Next for XRP","news_subtitle":"The crypto market is bracing for a seismic shift as XRP enters a new era. Trading desks, hedge funds, and institutional investors are quietly positioning themselves. One upcoming event is poised to reshape XRP’s market dynamics entirely. According to Amonyx, CME Group will launch...","id":336,"createdAt":"2025-12-09T20:20:05.358Z","updatedAt":"2025-12-10T10:50:05.928Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6939274c42802783549d9e17","news_date":"2025-12-10T07:54:51.055Z","news_title":"21Shares’ XRP ETF Moves Closer to Launch With Updated Filing and Lower Fees","news_subtitle":"21Shares has inched another step closer to launching its highly anticipated 21Shares XRP ETF (TOXR) after submitting an updated prospectus. The latest amendment arrives just as investor appetite for crypto-focused exchange-traded products is heating up, setting the stage for a po...","id":350,"createdAt":"2025-12-10T08:10:05.386Z","updatedAt":"2025-12-10T08:10:05.386Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6939287a42802783549e21a4","news_date":"2025-12-10T07:59:51.048Z","news_title":"XRP Ledger Releases New Version Focused on Lending","news_subtitle":"XRP Ledger's new version supports Multi-Purpose Tokens and a native lending protocol, shaping institutional DeFi future. Read original article on kanalcoin.com","id":351,"createdAt":"2025-12-10T08:20:04.835Z","updatedAt":"2025-12-10T18:00:06.187Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69393a0d4280278354a8e84d","news_date":"2025-12-10T10:59:51.177Z","news_title":"Upbit to store majority of customer assets in cold wallets","news_subtitle":"Upbit plans to shift 99% of its deposits into cold wallets, up from the current storage standard of keeping 98% of funds offline.","id":353,"createdAt":"2025-12-10T09:30:05.283Z","updatedAt":"2025-12-10T11:10:06.443Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69394f264280278354b5c776","news_date":"2025-12-10T10:44:51.074Z","news_title":"Big Day for XRP on Dec 15 – Here’s What’s Coming","news_subtitle":"XRP futures launch on CME December 15, boosting institutional involvement. CME’s approval marks XRP’s entry into regulated global derivatives market. Low-margin XRP futures open new doors for institutional investors. The XRP community is buzzing with excitement as the Chicago Mer...","id":360,"createdAt":"2025-12-10T11:00:03.002Z","updatedAt":"2025-12-10T18:00:05.747Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693955014280278354b9065d","news_date":"2025-12-10T11:09:51.060Z","news_title":"Ripple’s Letter to the CFTC. What It Means to RLUSD and XRP Investors","news_subtitle":"Ripple has entered a decisive phase in its push to integrate digital assets into global financial infrastructure. Its latest letter to the Commodity Futures Trading Commission signals a coordinated effort to position RLUSD and tokenized money-market funds inside core institutiona...","id":361,"createdAt":"2025-12-10T11:20:05.374Z","updatedAt":"2025-12-10T18:00:05.973Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69399a294280278354e3538f","news_date":"2025-12-10T16:04:51.049Z","news_title":"Ripple Rolls Out Major XRP Ledger v3.0.0 Upgrade","news_subtitle":"Ripple has launched the XRP Ledger v3.0.0 upgrade. According to a blog post, this upgrade represents a enhancement for the blockchain The post Ripple Rolls Out Major XRP Ledger v3.0.0 Upgrade appeared first on TheCoinrise.com.","id":381,"createdAt":"2025-12-10T17:10:05.815Z","updatedAt":"2025-12-10T18:00:06.664Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6939a9614280278354ed23eb","news_date":"2025-12-10T17:09:51.058Z","news_title":"Updated Exchange XRP Balances: The First Time This Will Happen","news_subtitle":"XRP is showing a historic shift in on‑chain supply dynamics that could reshape market behavior. Exchange balances have dropped sharply, signaling a potential liquidity squeeze. Chad Steingraber highlighted this trend on X, noting that Glassnode data shows XRP exchange reserves de...","id":382,"createdAt":"2025-12-10T17:20:06.233Z","updatedAt":"2025-12-10T18:00:06.456Z"}]