[{"crypto_id":"52","crypto_name":"XRP","news_id":"693efe9442802783541350d9","news_date":"2025-12-15T04:39:42.599Z","news_title":"Gemini Expands Stablecoin Reach With RLUSD on XRP Ledger","news_subtitle":"Gemini added the RLUSD stablecoin to the XRP Ledger and introduced a faster, lower-cost settlement framework for users operating across chains. The integration allows RLUSD deposits and withdrawals on XRPL or Ethereum. It also offers a 4% yield through staking. Gemini Titan secur...","id":530,"createdAt":"2025-12-14T18:30:07.903Z","updatedAt":"2025-12-15T18:00:06.956Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693f5fd742802783544511f0","news_date":"2025-12-15T01:09:41.855Z","news_title":"XRP Bulls Dominate Social Media as ETF Streak Hits 19 Days","news_subtitle":"XRP News Retail traders are maintaining optimistic sentiment toward XRP as the token hovers around $2, with this week recording the seventh-highest number of bullish comments for the year, according to market intelligence platform Santiment. The firm monitors social interest acro...","id":534,"createdAt":"2025-12-15T01:20:05.381Z","updatedAt":"2025-12-15T18:00:06.106Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693f85584280278354586db8","news_date":"2025-12-15T10:04:51.046Z","news_title":"ETH Whale Resumes Buying Spree After Market Dip","news_subtitle":"ETH whale alert: $119M in ETH withdrawn from Binance after $85M USDT loan. Big moves after the dip! #Ethereum #ETH #CryptoNews The post ETH Whale Resumes Buying Spree After Market Dip appeared first on CoinoMedia.","id":540,"createdAt":"2025-12-15T04:00:07.870Z","updatedAt":"2025-12-15T15:50:11.286Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6940284d4280278354d20fcc","news_date":"2025-12-15T15:29:51.125Z","news_title":"Reece Merrick Teases Major Ripple Momentum: Big Week Ahead for XRP!","news_subtitle":"Ripple secures major expansion with MAS approval and GTreasury acquisition. XRP futures and new ETFs could reshape the crypto landscape. Middle East momentum grows as Ripple’s stablecoin gains traction. Ripple kicked off a dynamic December with a series of high-impact development...","id":558,"createdAt":"2025-12-15T15:40:05.868Z","updatedAt":"2025-12-15T18:00:06.659Z"}]