[{"crypto_id":"52","crypto_name":"XRP","news_id":"6952747a42802783547d48db","news_date":"2025-12-30T11:40:44.498Z","news_title":"Ripple Powers Europe’s Core Banking Through TAS Network Gateway","news_subtitle":"Ripple’s integration with the TAS Network Gateway embeds it in Europe’s core banking rails, unlocking access to TARGET2, SEPA and T2/T2S.","id":1098,"createdAt":"2025-12-29T12:51:54.704Z","updatedAt":"2025-12-30T12:40:05.633Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69527b854280278354807574","news_date":"2025-12-30T07:50:45.314Z","news_title":"Japan to Cut Crypto Taxes to 20% Under New 2026 Reform Plan","news_subtitle":"Japan is preparing a major shift in how cryptocurrency gains are taxed, signaling a more welcoming stance toward digital assets after years of criticism over high tax burdens. Under the government’s 2026 tax reform plan, profits from certain crypto investments could soon be taxed...","id":1099,"createdAt":"2025-12-29T13:10:06.150Z","updatedAt":"2025-12-30T09:10:06.034Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695284e04280278354855ffc","news_date":"2025-12-30T11:40:44.498Z","news_title":"This Change in Japan’s Crypto Tax Will Have Big Implications for Bitcoin and Ethereum","news_subtitle":"Japan is moving closer to fixing one of crypto’s biggest pain points in the country – taxes. But the details show the change won’t apply to everyone. Under its 2026 tax reform blueprint, Japan plans to cut crypto capital gains tax from as high as 55% to a flat 20%. The move would...","id":1101,"createdAt":"2025-12-29T14:10:16.575Z","updatedAt":"2025-12-30T13:50:06.086Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69530ccb4280278354ec4f83","news_date":"2025-12-30T11:40:44.498Z","news_title":"XRP Products Pull $70M as Crypto ETPs Drop $446M, CoinShares Reports","news_subtitle":"XTP News XRP exchange-traded funds attracted $70 million in fresh investment during a week when broader crypto products hemorrhaged $446 million in outflows, according to CoinShares data. Franklin Templeton's recently launched XRP fund alone captured $28.6 million of the inflows....","id":1114,"createdAt":"2025-12-29T23:30:04.670Z","updatedAt":"2025-12-30T18:00:05.714Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6953845a42802783544a895a","news_date":"2025-12-30T07:50:45.314Z","news_title":"The Quiet XRP Supply Crunch That Could Power Institutional Adoption in 2026","news_subtitle":"As ETFs drain XRP from exchanges, tightening liquidity, 2026 could be the year XRP cements its position as institutional-grade liquidity infrastructure.","id":1125,"createdAt":"2025-12-30T08:20:18.297Z","updatedAt":"2025-12-30T09:00:07.275Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695394c44280278354548b3c","news_date":"2025-12-30T13:00:46.190Z","news_title":"Ripple Enters Europe’s Core Payment Rails Through TAS Network Integration","news_subtitle":"Ripple has confirmed its integration with the TAS Network Gateway, a move that connects its blockchain technology directly to Europe’s most critical financial infrastructure. The development allows European banks to access high-value payment systems, real-time gross settlement (R...","id":1126,"createdAt":"2025-12-30T09:10:05.546Z","updatedAt":"2025-12-30T18:00:06.342Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69539bc9428027835457ced0","news_date":"2025-12-30T11:40:44.498Z","news_title":"Ripple Gains OCC Approval for National Trust Bank","news_subtitle":"Ripple receives OCC approval for a trust bank, boosting XRP's institutional adoption. Read original article on bitcoininfonews.com","id":1128,"createdAt":"2025-12-30T09:40:08.957Z","updatedAt":"2025-12-30T18:00:06.084Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6953bca0428027835467ef0d","news_date":"2025-12-30T13:10:45.228Z","news_title":"Japan’s Crypto Tax Cut Could Trigger a Massive Shift in Investor Behavior","news_subtitle":"Japan’s crypto tax reform could revolutionize investor participation in assets. Lower tax rates and clearer regulations boost Japan’s crypto market. FSA-backed stablecoin pilot signals Japan’s digital finance system modernization. Japan’s cryptocurrency market is set for a major ...","id":1131,"createdAt":"2025-12-30T12:00:05.899Z","updatedAt":"2025-12-30T15:50:05.611Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6953a2d542802783545b3da6","news_date":"2025-12-30T11:40:44.498Z","news_title":"Ripple Deepens Japan Ties with 3 Major Bank Alliances","news_subtitle":"The cryptocurrency landscape, Ripple has announced strategic partnerships with some of Japan’s leading financial institutions to accelerate the adoption of the XRP Ledger. The collaborations involve Mizuho Bank, SMBC Nikko Securities, and Securitize Japan, aiming to integrate blo...","id":1136,"createdAt":"2025-12-30T14:00:08.430Z","updatedAt":"2025-12-30T14:40:05.928Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6953e47342802783547d0957","news_date":"2025-12-30T14:40:47.643Z","news_title":"Canadian Hacker Steals $2M via Coinbase Scams: ZachXBT","news_subtitle":"Haby used social engineering to steal over $2M, showing human behavior as the main crypto security risk. Blockchain analysis linked Haby’s XRP thefts to multiple Coinbase users, exposing global fraud patterns. Coinbase faces $307M in breach costs, emphasizing the need for stronge...","id":1140,"createdAt":"2025-12-30T15:10:11.864Z","updatedAt":"2025-12-30T18:00:06.859Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6953f4d9428027835485fc4d","news_date":"2025-12-30T16:10:43.852Z","news_title":"Ripple Links Blockchain Settlement to European Banking Systems","news_subtitle":"By integrating with the TAS Network Gateway, Ripple gains a direct technical pathway into Europe’s most important payment and settlement […] The post Ripple Links Blockchain Settlement to European Banking Systems appeared first on Coindoo.","id":1142,"createdAt":"2025-12-30T16:00:09.150Z","updatedAt":"2025-12-30T18:00:06.619Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6953f4d9428027835485fc0e","news_date":"2025-12-30T15:50:46.076Z","news_title":"Ripple Partners With Major Japanese Banks on XRPL Push","news_subtitle":"Ripple’s Japan program offers $10K grants for startups building stablecoins, tokenized assets and credit infrastructure. Mizuho, SMBC Nikko and Securitize Japan back XRPL integration, connecting blockchain tools to traditional financial networks. XRPL’s TVL fell to $62M, ranking ...","id":1143,"createdAt":"2025-12-30T16:00:09.531Z","updatedAt":"2025-12-30T17:50:06.679Z"}]