[{"crypto_id":"52","crypto_name":"XRP","news_id":"6942942f4280278354b84ad7","news_date":"2025-12-18T09:14:46.543Z","news_title":"Bhutan’s Bold Move: Bitcoin to Fund Gelephu Mindfulness City Development","news_subtitle":"Bhutan taps Bitcoin to fund Gelephu Mindfulness City’s development projects. Bitcoin-backed development aims to boost Bhutan’s economy and create jobs. GMC’s crypto-friendly policies attract global businesses in various industries. Bhutan is set to tap into its significant Bitcoi...","id":637,"createdAt":"2025-12-17T11:40:05.122Z","updatedAt":"2025-12-18T11:40:06.371Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6943106142802783542033c4","news_date":"2025-12-17T20:19:41.458Z","news_title":"Ripple and AMINA Bank Partner for Real-Time Payments","news_subtitle":"Ripple partners with AMINA Bank to enhance real-time cross-border payments, bridging crypto and traditional finance. Read original article on coincu.com","id":663,"createdAt":"2025-12-17T20:30:05.696Z","updatedAt":"2025-12-18T18:00:06.687Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6942f570428027835411bab0","news_date":"2025-12-17T18:24:46.129Z","news_title":"SBI Ripple Asia Taps Doppler Finance for XRPL Tokenization","news_subtitle":"This is the first time SBI Ripple Asia has officially partnered with a native XRPL DeFi protocol.","id":671,"createdAt":"2025-12-18T06:10:07.273Z","updatedAt":"2025-12-18T14:10:09.050Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6943a78e428027835495a53c","news_date":"2025-12-18T08:19:44.144Z","news_title":"Digital Wealth Partners Introduces XRP Trading for Retirement Accounts","news_subtitle":"Digital Wealth Partners launches an algorithmic XRP trading strategy for eligible retirement accounts, enhancing integration of digital assets into traditional financial structures. Read original article on coinlineup.com","id":674,"createdAt":"2025-12-18T08:11:15.444Z","updatedAt":"2025-12-18T13:00:06.604Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6943b7f94280278354a0a3a4","news_date":"2025-12-18T11:09:41.649Z","news_title":"Digital Wealth Partners Launches Algorithmic XRP Trading for Retirement Accounts","news_subtitle":"Digital Wealth Partners (DWP), a U.S.-based registered investment advisory firm focused on digital assets, has introduced a new algorithmic trading strategy for XRP that can be deployed inside qualified retirement accounts, including IRAs. The offering is designed for high-net-wo...","id":676,"createdAt":"2025-12-18T08:50:06.373Z","updatedAt":"2025-12-18T18:00:07.015Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6943cab24280278354ab2f48","news_date":"2025-12-18T14:59:41.413Z","news_title":"XRP bulls get new on-ramp as DWP brings algo trading to IRAs and retirement plans","news_subtitle":"Digital Wealth Partners launched an Arch-powered XRP algo strategy for qualified IRAs, giving wealthy investors tax-advantaged, professionally managed XRP exposure at Anchorage. Digital Wealth Partners (DWP), a U.S.-based registered investment advisory firm focused on digital ass...","id":678,"createdAt":"2025-12-18T10:00:15.906Z","updatedAt":"2025-12-18T18:00:08.172Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6943f9984280278354c7bd82","news_date":"2025-12-18T12:54:46.081Z","news_title":"FDIC Greenlights U.S. Banks to Issue Stablecoins — RLUSD Poised to Lead the Way","news_subtitle":"FDIC greenlights U.S. banks to issue stablecoins, a major milestone boosting RLUSD’s growth potential.","id":683,"createdAt":"2025-12-18T13:10:07.898Z","updatedAt":"2025-12-18T18:00:07.388Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69440a004280278354d171ed","news_date":"2025-12-18T14:04:41.814Z","news_title":"Analyst: XRP Is in Early Stages of Forming an Impulsive Structure – What It Means","news_subtitle":"Mathew Dixon says XRP is forming an early bullish impulsive Elliott Wave, with Wave 3 completing at the 1.618 “golden ratio.” Price holding above the Wave 1 high is key, with the current Fibonacci retracement zone and neutral RSI supporting a healthy pause before a potential next...","id":687,"createdAt":"2025-12-18T14:20:08.815Z","updatedAt":"2025-12-18T18:00:07.712Z"}]