[{"crypto_id":"52","crypto_name":"XRP","news_id":"693abb964280278354ccaf72","news_date":"2025-12-12T08:59:46.061Z","news_title":"FalconX Acquisition of 21Shares Strengthens XRP TOXR ETF Infrastructure","news_subtitle":"FalconX's 21Shares acquisition combines prime brokerage with ETF expertise as TOXR XRP ETF gains Cboe approval.","id":402,"createdAt":"2025-12-11T12:50:04.876Z","updatedAt":"2025-12-12T12:40:06.106Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693ada0e4280278354df5048","news_date":"2025-12-12T02:59:46.065Z","news_title":"Ripple Ready to Become a US Bank: Has the \"Blue Chip\" Era of XRP Officially Begun?","news_subtitle":"Ripple’s efforts to obtain a US national bank license, coupled with new regulatory clarity from Washington and a wave of ETF/ETP inflows, are transforming XRP’s image from a speculative altcoin into a bank-grade, high-quality infrastructure at the heart of the new cross-border pa...","id":410,"createdAt":"2025-12-11T15:10:05.681Z","updatedAt":"2025-12-12T14:40:05.077Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693b2e65428027835431a812","news_date":"2025-12-11T20:49:39.847Z","news_title":"21Shares XRP ETF Begins Trading on CBOE With $226M Seed","news_subtitle":"XRP News The 21Shares XRP ETF started trading on CBOE under ticker symbol TOXR, becoming the fifth spot XRP product to receive exchange approval. Ripple Markets seeded the fund with 100 million XRP valued at approximately $226 million, enabling initial creation and redemption ope...","id":420,"createdAt":"2025-12-11T21:00:04.806Z","updatedAt":"2025-12-12T18:00:06.043Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693bb4064280278354a0ccc7","news_date":"2025-12-12T06:19:45.063Z","news_title":"Wrapped XRP Launches on Solana and Ethereum With $100M Liquidity Boost","news_subtitle":"Wrapped XRP (wXRP) is now live on Solana, Ethereum, Optimism, HyperEVM, and additional chains, marking one of the most comprehensive cross-chain expansions for XRP to date. The initiative is designed to bring XRP into the heart of decentralized finance without depending on unregu...","id":443,"createdAt":"2025-12-12T08:30:06.011Z","updatedAt":"2025-12-12T18:00:06.749Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693be53d4280278354bedc00","news_date":"2025-12-12T09:49:46.106Z","news_title":"Big News: Solana Finally Releases Major Update on XRP After Several Teases","news_subtitle":"Solana integrates XRP with wXRP, enhancing DeFi cross-chain potential. Wrapped XRP boosts liquidity, offering new opportunities for DeFi users. Hex Trust secures 1:1-backed wXRP for broader blockchain adoption. After weeks of anticipation, Solana has finally delivered on its cryp...","id":451,"createdAt":"2025-12-12T11:00:12.795Z","updatedAt":"2025-12-12T16:50:04.716Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693b9dbd428027835472f404","news_date":"2025-12-12T04:44:42.348Z","news_title":"Hex Trust Launches Wrapped XRP to Boost DeFi Utility","news_subtitle":"Hex Trust has launched wrapped XRP to enhance DeFi utility and cross-chain applications. Read original article on marketbit.io","id":453,"createdAt":"2025-12-12T12:50:05.269Z","updatedAt":"2025-12-12T13:50:08.949Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693c1c4e4280278354dea3c3","news_date":"2025-12-12T13:44:44.603Z","news_title":"Hex Trust To Launch Wrapped XRP for Multi-Chain DeFi Access","news_subtitle":"XRP News Hex Trust plans to issue and custody wrapped XRP, extending the asset's reach beyond the XRP Ledger into decentralized finance applications across multiple blockchains. The regulated institutional custodian will launch wXRP as a 1:1-backed representation of XRP designed ...","id":458,"createdAt":"2025-12-12T14:00:12.464Z","updatedAt":"2025-12-12T18:00:05.806Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693c1c504280278354dea81f","news_date":"2025-12-12T13:44:44.603Z","news_title":"Crucial XRP Ledger 3.0.0 Update: Fixes Critical Bugs and Boosts Scalability","news_subtitle":"BitcoinWorld Crucial XRP Ledger 3.0.0 Update: Fixes Critical Bugs and Boosts Scalability The XRP Ledger just leveled up. The core development team has officially released version 3.0.0 of its critical server software, rippled. This isn’t just a routine patch; it’s a significant u...","id":459,"createdAt":"2025-12-12T14:00:13.163Z","updatedAt":"2025-12-12T18:00:06.512Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693c46854280278354f8a39e","news_date":"2025-12-12T17:04:42.429Z","news_title":"Ripple Secures Conditional U.S. Banking Approval While XRP Stalls Below $2","news_subtitle":"The development positions Ripple among a small group of crypto-native firms moving directly into federally supervised financial infrastructure, potentially reshaping […] The post Ripple Secures Conditional U.S. Banking Approval While XRP Stalls Below $2 appeared first on Coindoo.","id":465,"createdAt":"2025-12-12T17:00:05.825Z","updatedAt":"2025-12-12T17:50:08.111Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"693c548d428027835420888f","news_date":"2025-12-12T17:44:42.119Z","news_title":"Ripple and Four Companies Achieve Milestone Approvals in Crypto Ventures","news_subtitle":"Ripple and four companies receive crucial banking licenses, propelling crypto services forward. Under federal oversight, Ripple National Trust Bank will expand its crypto offerings. Continue Reading:Ripple and Four Companies Achieve Milestone Approvals in Crypto Ventures The post...","id":466,"createdAt":"2025-12-12T18:00:06.277Z","updatedAt":"2025-12-12T18:00:06.277Z"}]