[{"crypto_id":"52","crypto_name":"XRP","news_id":"69569ee5428027835469617d","news_date":"2026-01-02T06:40:45.527Z","news_title":"XRP Ledger Validator: Logic Behind JPMorgan and Ripple’s GTreasury Partnership","news_subtitle":"Recent commentary from XRPL validator VET has provided technical context to a payment infrastructure announcement involving J.P. Morgan Payments and GTreasury, following a post shared by crypto commentator Subjective Views. Rather than focusing on the headline partnership itself,...","id":1220,"createdAt":"2026-01-01T16:30:05.409Z","updatedAt":"2026-01-02T16:40:06.921Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6956b3f742802783548f0c01","news_date":"2026-01-01T17:50:44.125Z","news_title":"XRP Escrow: Ripple’s Strategic 500 Million Token Lockup Signals Calculated Market Confidence","news_subtitle":"BitcoinWorld XRP Escrow: Ripple’s Strategic 500 Million Token Lockup Signals Calculated Market Confidence In a significant move for the digital asset ecosystem, blockchain payments firm Ripple has placed a substantial 500 million XRP into a secure escrow account, a strategic acti...","id":1223,"createdAt":"2026-01-01T18:00:07.040Z","updatedAt":"2026-01-02T13:30:06.304Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695768794280278354096e02","news_date":"2026-01-02T06:40:45.527Z","news_title":"Roundhill's Income-Focused XRP ETF Could Launch As Early As Jan. 29","news_subtitle":"Roundhill filed amended registration for XRP covered call ETF targeting Jan. 29 launch.","id":1234,"createdAt":"2026-01-02T07:12:32.960Z","updatedAt":"2026-01-02T15:00:05.529Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69577fdf4280278354155091","news_date":"2026-01-02T08:20:43.973Z","news_title":"Ripple Executive Backs Franklin Templeton’s XRP Ledger Strategy","news_subtitle":"Reece Merrick, Ripple’s Managing Director for the Middle East and Africa, reacted positively on social media after Franklin Templeton highlighted XRPL’s role in payments-focused blockchain infrastructure. His post, marked with partnership and rocket emojis, underscored Ripple’s e...","id":1239,"createdAt":"2026-01-02T08:50:08.343Z","updatedAt":"2026-01-02T17:30:06.392Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6957b81f42802783542fae5b","news_date":"2026-01-02T15:30:42.275Z","news_title":"XRP Faces a Key Monthly Test as Price Sits on the 21-Month EMA","news_subtitle":"Crypto analyst EGRAG CRYPTO has highlighted a critical moment for XRP, pointing to the 21-month exponential moving average (EMA) as the defining level that has historically separated major bull runs from deep corrections. According to EGRAG, this long-term EMA has acted as XRP’s ...","id":1243,"createdAt":"2026-01-02T12:30:06.236Z","updatedAt":"2026-01-02T18:00:05.700Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6957dffb4280278354428439","news_date":"2026-01-02T16:20:42.495Z","news_title":"XRP reclaims $1.88 support and eyes potential rally toward $2.30","news_subtitle":"XRP has regained a critical support level at $1.88, as traders await a possible confirmation. If the price holds, it expects a strong upward move toward the $2.30 resistance level. This sets the stage for a possible breakout at the start of the year. XRP Holds Above $1.88 Fibonac...","id":1248,"createdAt":"2026-01-02T15:50:05.732Z","updatedAt":"2026-01-02T18:00:06.997Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6957f51342802783544da33f","news_date":"2026-01-02T16:40:46.109Z","news_title":"500,000,000 XRP Locked Until 2028 – Why It Matters","news_subtitle":"500 million XRP has been escrowed until November 2028, removing that supply from circulation and reinforcing long-term supply transparency. The lock-up improves predictability for institutions, a key factor for ETFs, regulated products, and large-scale capital allocation. Multi-s...","id":1254,"createdAt":"2026-01-02T16:50:05.810Z","updatedAt":"2026-01-02T18:00:06.277Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695800c64280278354734626","news_date":"2026-01-02T17:30:41.803Z","news_title":"Legal Expert: This Data Cries for Massive XRP Price Rally","news_subtitle":"Crypto markets often signal major moves before most traders notice. Subtle shifts in liquidity and order book dynamics frequently foreshadow price breakouts, and XRP now appears at one of these critical junctures. Technical conditions suggest that a strong rally could unfold if c...","id":1257,"createdAt":"2026-01-02T17:40:06.331Z","updatedAt":"2026-01-02T18:00:06.709Z"}]