[{"crypto_id":"52","crypto_name":"XRP","news_id":"695bb8584280278354a7b566","news_date":"2026-01-06T06:20:40.873Z","news_title":"XRP Breaks $2.12 as Exchange Supply Is Drying Up","news_subtitle":"This article was first published on The Bit Journal. XRP price moved higher this week as buyers pushed the token above $2.12, a level that had blocked progress for weeks. The move stood out because it came with substantial trading volume and shrinking exchange supply. In crypto m...","id":1343,"createdAt":"2026-01-05T13:20:06.340Z","updatedAt":"2026-01-06T12:40:07.220Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695bbaad4280278354a8c0b0","news_date":"2026-01-06T05:40:46.776Z","news_title":"4 Major Ripple Acquisitions and How They Benefit and Strengthen XRP","news_subtitle":"Ripple’s acquisitions quietly reshape XRP into regulated institutional financial infrastructure. Strategic custody and brokerage deals expand XRP’s real-world liquidity and settlement use. Infrastructure-focused growth shifts XRP’s narrative away from speculation toward utility. ...","id":1345,"createdAt":"2026-01-05T13:30:06.747Z","updatedAt":"2026-01-06T13:20:09.049Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695c530342802783544c1763","news_date":"2026-01-06T00:10:41.271Z","news_title":"XRP Price Jumps 9% as Bitcoin Gains Over 3% and Approaches $95K","news_subtitle":"XRP News XRP led the crypto rally Monday with a 9% gain to just below $2.32 after breaking key resistance overnight. The move represents the strongest performance since mid-November and outpaced gains across other major digital assets. Bitcoin rose to its highest level since mid-...","id":1364,"createdAt":"2026-01-06T00:20:04.363Z","updatedAt":"2026-01-06T18:00:11.748Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695cc1334280278354c2b91e","news_date":"2026-01-06T11:20:44.758Z","news_title":"XRP Surges Over 10% as ETF Inflows and Technical Breakout Align","news_subtitle":"XRP has abruptly shifted into a higher gear, posting a 10.54% gain in the last 24 hours while Bitcoin rose about 1% and Ethereum roughly 2%. That surge caps a seven-day advance above 25%, placing XRP among the strongest large-cap performers this month. The move did not come quiet...","id":1368,"createdAt":"2026-01-06T08:10:07.353Z","updatedAt":"2026-01-06T18:00:12.930Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695cf0114280278354eedd27","news_date":"2026-01-06T16:00:45.482Z","news_title":"$46,000,000 XRP Scooped in One Day Amid Price Surge – What You Should Know","news_subtitle":"XRP ETFs absorb $46,000,000 as institutional demand strengthens during price surge ETF inflows and Ripple wallet movements place XRP at market center XRP jumps 9.67% to $2.35 amid heavy one day institutional buying Trading activity around XRP picked up noticeably as fresh data po...","id":1370,"createdAt":"2026-01-06T12:32:57.695Z","updatedAt":"2026-01-06T18:00:12.601Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695d00784280278354f7d028","news_date":"2026-01-06T12:30:45.515Z","news_title":"XRP ETF Net Assets Hit $1.65 Billion After $46.1 Million Institutional Buying Spree","news_subtitle":"After $46.1M in institutional purchases, total XRP ETF net assets climbed to $1.65B.","id":1374,"createdAt":"2026-01-06T13:10:11.092Z","updatedAt":"2026-01-06T18:00:12.082Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695d09d54280278354fcd529","news_date":"2026-01-06T13:10:42.649Z","news_title":"Analyst to XRP Holders: Something Incredibly Bullish Is Developing","news_subtitle":"XRP may be approaching a defining moment that could reshape its position within the broader crypto market. While daily price movements often attract attention, long-term relative strength against Bitcoin frequently signals deeper trend shifts. Current technical conditions on the ...","id":1377,"createdAt":"2026-01-06T13:40:12.100Z","updatedAt":"2026-01-06T18:00:13.274Z"}]