[{"crypto_id":"52","crypto_name":"XRP","news_id":"695d98cc42802783549230bd","news_date":"2026-01-07T04:02:52.103Z","news_title":"XRP Surges 12% Amid Institutional ETF Inflows","news_subtitle":"XRP sees a 12% price surge, driven by record ETF inflows and regulatory clarity. Read original article on bitcoininfonews.com","id":1401,"createdAt":"2026-01-06T23:40:07.133Z","updatedAt":"2026-01-07T13:50:07.511Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695d284c4280278354124c22","news_date":"2026-01-07T09:42:49.436Z","news_title":"Cardano price rallies on bullish engulfing candles, why strength continues","news_subtitle":"Cardano (ADA) has entered a renewed bullish phase, with recent price action showing strong continuation characteristics.","id":1409,"createdAt":"2026-01-07T08:40:07.937Z","updatedAt":"2026-01-07T09:50:12.292Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695e2a9c428027835436384e","news_date":"2026-01-07T15:02:50.910Z","news_title":"XRP price bulls seize momentum as spot ETF inflows blast past $1b mark","news_subtitle":"XRP outpaces Bitcoin and Ethereum as U.S. spot ETFs top $1b in assets, XRPL DEX liquidity surges, exchange balances sink, and futures open interest hits multi-month highs. XRP (XRP) has outperformed the top 10 cryptocurrencies by market capitalization in early…","id":1411,"createdAt":"2026-01-07T10:10:13.316Z","updatedAt":"2026-01-07T15:50:08.081Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695e4b6e428027835446e5ef","news_date":"2026-01-07T17:12:51.190Z","news_title":"Ripple’s GTreasury Expands With Solvexia Deal","news_subtitle":"Ripple’s GTreasury acquires Solvexia to automate reconciliation & compliance reporting for modern finance teams #Fintech #Ripple #GTreasury The post Ripple’s GTreasury Expands With Solvexia Deal appeared first on CoinoMedia.","id":1414,"createdAt":"2026-01-07T12:20:06.520Z","updatedAt":"2026-01-07T18:00:07.189Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695e54d042802783544c3d7b","news_date":"2026-01-07T12:42:50.117Z","news_title":"Ethereum Staking Shock as Validator Exit Queue Hits Zero and $1.3M ETH Waits","news_subtitle":"Validator exit queues vanish as over 1.3 million $ETH awaits staking Staking inflows rise sharply while sell-side pressure continues to weaken Ethereum supply tightens as long-term holders strengthen network commitment Ethereum’s staking structure has changed as validator exit qu...","id":1416,"createdAt":"2026-01-07T13:20:06.447Z","updatedAt":"2026-01-07T18:00:07.909Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695e54cf42802783544c3c8e","news_date":"2026-01-07T12:42:50.117Z","news_title":"Ripple (XRP) Makes Big Move In Japan","news_subtitle":"Developments in Japan’s financial sector are getting increased recognition following confirmation from Ripple of new collaborations with several of the country’s most prominent institutions. According to commentary shared by technologist and media host Paul Barron, Ripple has for...","id":1417,"createdAt":"2026-01-07T13:20:07.530Z","updatedAt":"2026-01-07T13:20:07.530Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695e5e2d428027835450d728","news_date":"2026-01-07T13:22:51.939Z","news_title":"XRP Gains 25% in First Week of 2026, Outpacing Bitcoin and Ethereum","news_subtitle":"XRP News XRP has surged 25% since Jan. 1, outperforming both Bitcoin and Ethereum as CNBC labels it the new crypto darling for 2026. The token's explosive start comes from multiple catalysts driving investor interest. CNBC's Power Lunch host Brian Sullivan declared that the hotte...","id":1419,"createdAt":"2026-01-07T13:40:02.892Z","updatedAt":"2026-01-07T18:00:06.283Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695e62e042802783545309b9","news_date":"2026-01-07T17:12:51.190Z","news_title":"Rumble Introduces Wallet to Let Users Pay Creators in Crypto","news_subtitle":"Instead of leaning on banks, card networks, or external processors, the video platform is introducing a built-in digital wallet that […] The post Rumble Introduces Wallet to Let Users Pay Creators in Crypto appeared first on Coindoo.","id":1422,"createdAt":"2026-01-07T14:00:06.838Z","updatedAt":"2026-01-07T18:00:06.827Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695e7f004280278354621a26","news_date":"2026-01-07T15:42:51.225Z","news_title":"Ripple Executive Officer Confirms What Will Drive XRP in the Near-Term","news_subtitle":"XRP momentum now centers on institutional adoption rather than unresolved regulatory debates Ripple leadership points to clearer regulation as XRP’s primary near-term catalyst Regulatory clarity already secured places XRP ahead as institutions increase exposure Reece Merrick, Rip...","id":1425,"createdAt":"2026-01-07T16:00:09.242Z","updatedAt":"2026-01-07T18:00:07.548Z"}]