[{"crypto_id":"52","crypto_name":"XRP","news_id":"6964d02e4280278354f6d146","news_date":"2026-01-12T18:03:00.633Z","news_title":"Pundit to XRP Army: This Is One of the Moments That Changes Everything","news_subtitle":"BNY Mellon’s tokenized deposits signal deep institutional alignment with Ripple infrastructure Pumpius highlights how quiet infrastructure upgrades reshape global settlement systems XRP utility may expand indirectly as tokenized cash adoption accelerates A detailed post on X by p...","id":1629,"createdAt":"2026-01-12T11:00:08.508Z","updatedAt":"2026-01-13T10:50:07.519Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69650f724280278354147876","news_date":"2026-01-12T19:42:58.239Z","news_title":"XRP Wallet Security Warning to Holders","news_subtitle":"As digital assets increase in value and adoption, they also attract more targeted and sophisticated attacks. Most crypto losses do not occur because of blockchain failures, but because attackers exploit weak personal security practices. Recent events within the XRP ecosystem have...","id":1645,"createdAt":"2026-01-12T15:30:07.912Z","updatedAt":"2026-01-13T13:30:06.271Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696547bc4280278354535b8b","news_date":"2026-01-12T19:42:58.239Z","news_title":"Latest BlackRock and RLUSD News Stuns XRP Army","news_subtitle":"Crypto Dyl News (@cryptodylnews) has recently highlighted a development that places Ripple’s stablecoin deeper into institutional finance. He revealed that RLUSD is now being used as collateral tied to BlackRock-related tokenized funds and in cross-border payment flows. Crypto Dy...","id":1652,"createdAt":"2026-01-12T19:30:06.516Z","updatedAt":"2026-01-13T18:00:08.090Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6965c3ec42802783549482c0","news_date":"2026-01-13T04:02:48.577Z","news_title":"Dubai Bans Privacy Tokens and Tightens Stablecoin Rules to Strengthen Crypto Compliance","news_subtitle":"The regulator of Dubai’s main Financial free zone, Dubai Financial Services Authority (DFSA), has reset its crypto rules. It banned the privacy tokens and tightened stablecoin definitions. All of these rules are applied only inside the Dubai International Financial Centre (DIFC)....","id":1659,"createdAt":"2026-01-13T04:20:07.984Z","updatedAt":"2026-01-13T14:10:09.927Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696607e44280278354d85aca","news_date":"2026-01-13T08:52:48.143Z","news_title":"Ripple Pushes for New Framework to Lift SEC Control Over XRP","news_subtitle":"Ripple Urges SEC to Adopt Lifespan Framework for XRP’s Status Ripple has made a significant move by submitting a 9-page letter to the U.S. Securities and Exchange Commission (SEC), pushing for a clear framework on the status of XRP after the completion of its initial fundraising ...","id":1662,"createdAt":"2026-01-13T09:10:07.062Z","updatedAt":"2026-01-13T18:00:07.658Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6966346d4280278354f0da53","news_date":"2026-01-13T12:32:49.005Z","news_title":"Nigeria Introduces Identity-Based Crypto Oversight with New Tax Reforms","news_subtitle":"Nigeria introduces identity-based crypto oversight, linking transactions to tax IDs. New reforms simplify crypto regulation through identity verification and tax compliance. Nigeria’s crypto regulations align with global reporting standards and frameworks. Nigeria has taken a bol...","id":1669,"createdAt":"2026-01-13T12:20:08.061Z","updatedAt":"2026-01-13T18:00:08.524Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6966472a4280278354fb33d1","news_date":"2026-01-13T13:22:48.390Z","news_title":"Lummis–Wyden bill shields non-custodial crypto devs from money transmitter rules","news_subtitle":"The bipartisan Blockchain Regulatory Certainty Act would exempt non-custodial crypto developers from money transmitter rules, aiming to cut legal risk and keep builders in the U.S. Two U.S. senators introduced bipartisan legislation on January 12, 2026, aimed at providing regulat...","id":1671,"createdAt":"2026-01-13T13:40:08.528Z","updatedAt":"2026-01-13T15:20:08.051Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6966508d4280278354004742","news_date":"2026-01-13T14:22:49.054Z","news_title":"Franklin Templeton adapts money market funds for US stablecoin rules","news_subtitle":"Franklin Templeton has updated two Western Asset institutional Treasury money market funds to be compatible with GENIUS Act stablecoin reserve rules.","id":1673,"createdAt":"2026-01-13T14:20:08.693Z","updatedAt":"2026-01-13T15:20:08.480Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696660f5428027835409be70","news_date":"2026-01-13T15:12:50.477Z","news_title":"New Bill Treats XRP and Five Others the Same As Bitcoin and Ethereum","news_subtitle":"A draft of the Senate Banking Committee’s market structure bill has been circulating. It contains a provision that changes how several major cryptocurrencies are treated. Former Fox Business journalist Eleanor Terrett highlighted the section in a new post shortly before the bill’...","id":1677,"createdAt":"2026-01-13T15:30:04.505Z","updatedAt":"2026-01-13T18:00:07.222Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696660f5428027835409be51","news_date":"2026-01-13T15:12:50.477Z","news_title":"Bipartisan Crypto Bill Nears Trump’s Desk — XRP Poised to Win Big","news_subtitle":"SEC Chair anticipates Trump’s signing of the bipartisan market structure bill with XRP poised to benefit as one of the major cryptocurrencies.","id":1678,"createdAt":"2026-01-13T15:30:08.947Z","updatedAt":"2026-01-13T18:00:09.004Z"}]