[{"crypto_id":"52","crypto_name":"XRP","news_id":"696a7d5442802783542e49f9","news_date":"2026-01-16T18:02:56.013Z","news_title":"Ripple's UC Berkeley Accelerator Graduates Nine XRP Ledger Startups With 92% Fundraising Boost","news_subtitle":"Ripple's UDAX program graduated 9 XRP Ledger startups showing 67% product maturity gains and 92% fundraising confidence growth.","id":1813,"createdAt":"2026-01-16T18:20:06.512Z","updatedAt":"2026-01-17T18:00:05.858Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696a901242802783543aaddc","news_date":"2026-01-17T01:13:05.081Z","news_title":"XRP Ledger Expands Into Prediction Markets With New Platform","news_subtitle":"The development highlights a broader trend: blockchain networks are increasingly integrating new financial primitives rather than relying solely on transfers […] The post XRP Ledger Expands Into Prediction Markets With New Platform appeared first on Coindoo.","id":1817,"createdAt":"2026-01-16T19:40:06.188Z","updatedAt":"2026-01-17T18:00:06.241Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696a94c242802783543f653e","news_date":"2026-01-16T19:42:52.953Z","news_title":"'Just 1 Vote Away': XRP Amendment Might Unlock Trillions in Institutional Capital","news_subtitle":"Crucial XRP Ledger amendment with potential to attract institutional flows is just 0.59% from activation threshold.","id":1818,"createdAt":"2026-01-16T20:00:06.432Z","updatedAt":"2026-01-17T18:00:06.558Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696b7cc94280278354d7e63c","news_date":"2026-01-17T12:12:53.819Z","news_title":"Big News: XRP Gets Major Boost With New Ripple’s UDAX Program – What You Should Know","news_subtitle":"UDAX accelerates XRP adoption by transforming university startups into deployable financial products Ripple-backed accelerator pushes real-world XRPL use across payments, insurance, and tokenization Institutional-ready blockchain projects gain momentum through Ripple’s university...","id":1836,"createdAt":"2026-01-17T12:30:06.354Z","updatedAt":"2026-01-17T18:00:05.547Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696baba84280278354f1a2b2","news_date":"2026-01-17T15:32:53.846Z","news_title":"Ripple, UC Berkeley Launch UDAX to Scale XRP Startups","news_subtitle":"Ripple and UC Berkeley’s UDAX bridges academic blockchain research with enterprise-grade XRP Ledger deployment. Ripple engineers worked hands-on with startups to scale compliant, market-ready XRP solutions beyond theory. Demo Day showed traction as startups launched on XRPL, rais...","id":1844,"createdAt":"2026-01-17T15:50:07.191Z","updatedAt":"2026-01-17T18:00:06.865Z"}]