[{"crypto_id":"52","crypto_name":"XRP","news_id":"695462ff4280278354ddaae1","news_date":"2025-12-31T19:10:47.070Z","news_title":"Ripple vs. SEC Lawsuit Resolution and Market Impacts","news_subtitle":"SEC lawsuit resolves; Ripple pays $50M; XRP not a security for retail sales. Read original article on coinlive.me","id":1160,"createdAt":"2025-12-30T23:50:05.042Z","updatedAt":"2026-01-01T00:30:06.011Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6954efa3428027835441e3ac","news_date":"2025-12-31T17:10:46.035Z","news_title":"XRP Supply Shock: 15 Billion XRP on Exchanges Is Not Enough to Satisfy – ETF Analyst","news_subtitle":"Institutional funds are quietly accumulating XRP, with millions absorbed even during low-volume trading periods. Steady, modest inflows could compound into billions of XRP annually, potentially overwhelming exchange-held supply. If large asset managers fully enter, exchange liqui...","id":1171,"createdAt":"2025-12-31T10:00:09.529Z","updatedAt":"2026-01-01T09:30:06.113Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6954d12b428027835430c59e","news_date":"2025-12-31T17:00:46.040Z","news_title":"XRP Supply on Exchanges Drops to 7-Year Low","news_subtitle":"XRP supply on exchanges hits a 7-year low! Just 1.6B tokens remain, down from 3.76B in Oct. Bullish signal? #XRP #CryptoNews #Ripple The post XRP Supply on Exchanges Drops to 7-Year Low appeared first on CoinoMedia.","id":1193,"createdAt":"2025-12-31T23:40:07.551Z","updatedAt":"2026-01-01T09:10:08.683Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69555dbc4280278354929c13","news_date":"2026-01-01T13:50:42.533Z","news_title":"Bitwise Pushes Deeper Into Altcoins With Broad ETF Filing","news_subtitle":"If approved, the move would mark one of the most expansive attempts yet to package individual altcoins into regulated U.S. […] The post Bitwise Pushes Deeper Into Altcoins With Broad ETF Filing appeared first on Coindoo.","id":1195,"createdAt":"2026-01-01T00:40:06.123Z","updatedAt":"2026-01-01T17:50:06.721Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69561b9f428027835427dc7f","news_date":"2026-01-01T07:00:45.067Z","news_title":"Analyst: This Could Fuel XRP Next Wave Up to $2.30","news_subtitle":"Tara (@PrecisionTrade3) recently shared an intriguing post showing that XRP has reached a critical point on the daily timeframe. Her chart places the moving average directly on the macro 0.5 support near $1.88. That alignment compresses the trend and structure into one price zone...","id":1199,"createdAt":"2026-01-01T07:30:11.006Z","updatedAt":"2026-01-01T18:00:06.354Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69554b0842802783546e4cb2","news_date":"2026-01-01T00:00:44.689Z","news_title":"Pundit to XRP Holders: Watch This Clip to the End","news_subtitle":"Commentary from X Finance Bull has reinforced the idea that many of the settlement capabilities now being discussed at the institutional level are already operational within the XRP Ledger. Responding to a post by crypto enthusiast ProfessoRipplEffect, the commentator argued that...","id":1208,"createdAt":"2026-01-01T11:20:30.801Z","updatedAt":"2026-01-01T16:10:06.221Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6955c0354280278354c9996b","news_date":"2026-01-01T00:30:42.008Z","news_title":"XRP Unlocked: Ripple’s Strategic 200 Million Release Sparks Market Analysis","news_subtitle":"BitcoinWorld XRP Unlocked: Ripple’s Strategic 200 Million Release Sparks Market Analysis On-chain analytics platform Whale Alert reported a significant transaction on January 15, 2025, revealing that Ripple, the blockchain payments company, unlocked 200 million XRP from its escro...","id":1209,"createdAt":"2026-01-01T12:30:06.523Z","updatedAt":"2026-01-01T18:00:07.348Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6955c28d4280278354caf506","news_date":"2026-01-01T00:40:42.692Z","news_title":"XRP Unlocked: Ripple’s Strategic 500 Million Release Sparks Market Analysis","news_subtitle":"BitcoinWorld XRP Unlocked: Ripple’s Strategic 500 Million Release Sparks Market Analysis On November 15, 2024, blockchain tracking service Whale Alert reported a significant transaction: Ripple unlocked 500 million XRP from its escrow accounts, triggering immediate analysis acros...","id":1216,"createdAt":"2026-01-01T14:40:18.318Z","updatedAt":"2026-01-01T18:00:07.629Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695591554280278354b03cc7","news_date":"2026-01-01T00:00:44.689Z","news_title":"Fresh Evidence Says Utility Will XRP Price","news_subtitle":"A recent post from crypto researcher SMQKE highlights documented evidence showing that blockchain-based settlement has already been tested within established banking environments. The material examines how distributed ledger technology has been applied to real financial operation...","id":1218,"createdAt":"2026-01-01T16:20:14.140Z","updatedAt":"2026-01-01T16:20:14.140Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69569ee5428027835469617d","news_date":"2026-01-01T16:20:51.021Z","news_title":"XRP Ledger Validator: Logic Behind JPMorgan and Ripple’s GTreasury Partnership","news_subtitle":"Recent commentary from XRPL validator VET has provided technical context to a payment infrastructure announcement involving J.P. Morgan Payments and GTreasury, following a post shared by crypto commentator Subjective Views. Rather than focusing on the headline partnership itself,...","id":1220,"createdAt":"2026-01-01T16:30:05.409Z","updatedAt":"2026-01-01T18:00:06.634Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6956851542802783545c026b","news_date":"2026-01-01T14:30:43.193Z","news_title":"U.S. XRP ETF Inflows Hit $1.17B After 30 Straight Days of Buying","news_subtitle":"Cryptocurrency markets saw sharp volatility in December, 2025. While most of the crypto market products struggled at the end, XRP-ETFs quietly moved in the opposite direction. Institutional investors kept buying XRP through regulated ETFs, even as Bitcoin and Ethereum ETFs faced ...","id":1221,"createdAt":"2026-01-01T16:30:05.979Z","updatedAt":"2026-01-01T17:50:06.395Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6956b3f742802783548f0c01","news_date":"2026-01-01T17:50:44.125Z","news_title":"XRP Escrow: Ripple’s Strategic 500 Million Token Lockup Signals Calculated Market Confidence","news_subtitle":"BitcoinWorld XRP Escrow: Ripple’s Strategic 500 Million Token Lockup Signals Calculated Market Confidence In a significant move for the digital asset ecosystem, blockchain payments firm Ripple has placed a substantial 500 million XRP into a secure escrow account, a strategic acti...","id":1223,"createdAt":"2026-01-01T18:00:07.040Z","updatedAt":"2026-01-01T18:00:07.040Z"}]