[{"crypto_id":"52","crypto_name":"XRP","news_id":"697a80164280278354ae55fb","news_date":"2026-01-29T11:55:42.728Z","news_title":"Ripple Launches Treasury Platform for Digital Assets","news_subtitle":"Ripple launches a new Treasury platform integrating blockchain with GTreasury expertise, supporting digital assets like XRP and RLUSD for faster cross-border settlements. Read original article on aicryptocore.com","id":2206,"createdAt":"2026-01-28T21:50:05.720Z","updatedAt":"2026-01-29T18:00:06.638Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"697b0cb7428027835432561d","news_date":"2026-01-29T13:55:43.543Z","news_title":"SEC Reaffirms Full Securities Rules for On-Chain Assets","news_subtitle":"In its latest statement, the regulator stressed that tokenized securities are securities first and technology second, meaning they remain fully […] The post SEC Reaffirms Full Securities Rules for On-Chain Assets appeared first on Coindoo.","id":2218,"createdAt":"2026-01-29T11:20:07.330Z","updatedAt":"2026-01-29T18:00:06.953Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"697b7d384280278354849df7","news_date":"2026-01-29T15:25:44.438Z","news_title":"Ninth Circuit Upholds Dismissal of Ripple XRP Securities Claims","news_subtitle":"Ripple’s legal narrative continues to shift toward clarity as U.S. courts deliver increasingly consistent outcomes. After years of uncertainty that weighed on market confidence, each resolved case now carries added significance. For investors and industry observers alike, legal f...","id":2227,"createdAt":"2026-01-29T15:50:06.632Z","updatedAt":"2026-01-29T18:00:07.591Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"697b28d94280278354464933","news_date":"2026-01-29T11:55:42.728Z","news_title":"XRP Price Forecast 2026: ETF Flows, Technical Triggers, and a Scenario Matrix","news_subtitle":"XRP Price Forecast 2026 explores ETF inflows, technical breakout levels, and scenario-based price targets from $2.50 to $10+, showing how regulation, RLUSD, and institutional demand may reshape XRP’s next market cycle. Read original article on coincu.com","id":2228,"createdAt":"2026-01-29T16:50:07.669Z","updatedAt":"2026-01-29T18:00:07.917Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"697b530542802783546619a4","news_date":"2026-01-29T12:25:42.807Z","news_title":"XRP traders face make-or-break test as spot ETF inflows near $7m","news_subtitle":"XRP spot ETFs add $6.95m in a day, lifting assets to $1.39b and steadily shrinking circulating supply as crypto trades a high‑beta macro risk regime. XRP’s spot exchange-traded funds (ETFs) saw another punchy demand spike on January 28, underscoring how…","id":2229,"createdAt":"2026-01-29T17:10:07.660Z","updatedAt":"2026-01-29T18:00:08.362Z"}]