[{"crypto_id":"52","crypto_name":"XRP","news_id":"69720f9c4280278354f5d869","news_date":"2026-01-22T18:12:54.813Z","news_title":"Big News: XRP Is Entering Global Banks With New Ripple and DXC Partnership – Details","news_subtitle":"XRP seamlessly integrates into banks’ core systems with Ripple and DXC. Ripple and DXC bring secure, scalable digital asset solutions to banks. New partnership advances XRP adoption, enhancing global cross-border payment solutions. Ripple and DXC Technology (NYSE: DXC) have joine...","id":2032,"createdAt":"2026-01-22T12:10:08.372Z","updatedAt":"2026-01-23T12:10:08.803Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"697268a94280278354503af9","news_date":"2026-01-22T18:12:54.813Z","news_title":"Evernorth Taps AI Automation Startup to Actively Grow XRP Treasury","news_subtitle":"Evernorth has just partnered with t54 Labs, an agentic finance team known for applying AI-driven automation The post Evernorth Taps AI Automation Startup to Actively Grow XRP Treasury appeared first on TheCoinrise.com.","id":2054,"createdAt":"2026-01-22T21:30:08.413Z","updatedAt":"2026-01-22T22:00:07.667Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69729c394280278354747b70","news_date":"2026-01-22T21:52:53.825Z","news_title":"Ripple Partners with DXC for Banking Integration","news_subtitle":"Ripple and DXC Technology partner to integrate XRP custody and payments into a $5 trillion banking network. Read original article on aicryptocore.com","id":2055,"createdAt":"2026-01-22T22:10:06.396Z","updatedAt":"2026-01-23T18:00:07.335Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6972f54a4280278354b33785","news_date":"2026-01-23T04:12:54.886Z","news_title":"U.Today Crypto Digest: Ripple Snatches Major Partnership in $5 Trillion Pool, XRP Defies Death Sentence, Shiba Inu Avoids BTC Selling Pressu...","news_subtitle":"Crypto news digest: Ripple and DXC set a bridge between traditional banking and crypto; XRP price recovers from catastrophic scenario; SHIB avoids a wave of selling pressure that fell on Bitcoin.","id":2063,"createdAt":"2026-01-23T04:30:07.963Z","updatedAt":"2026-01-23T18:00:08.272Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6972fea94280278354b86372","news_date":"2026-01-23T04:52:53.716Z","news_title":"Ripple Labs Secures Regulatory Clarity in Settlement","news_subtitle":"XRP gains regulatory clarity after Ripple Labs settles SEC lawsuit over unregistered securities. Read original article on coinlive.me","id":2064,"createdAt":"2026-01-23T05:10:07.352Z","updatedAt":"2026-01-23T18:00:07.854Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"697321fd4280278354f0c255","news_date":"2026-01-23T07:23:36.905Z","news_title":"DXC Teams Up with Ripple to Power Next-Gen Crypto Custody for Global Banks","news_subtitle":"DXC Technology has collaborated with Ripple to equip global banks with enterprise-grade digital asset custody and real-time cross-border payment solutions.","id":2065,"createdAt":"2026-01-23T07:40:06.300Z","updatedAt":"2026-01-23T18:00:06.931Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6973636f4280278354260272","news_date":"2026-01-23T12:02:53.674Z","news_title":"Ripple Boosts XRP, Bitcoin and Ethereum Security & Transfer in Major Turkey Partnership","news_subtitle":"Ripple has renewed its custody deal with Garanti BBVA Crypto to strengthen secure storage and transfers of XRP, Bitcoin, and Ethereum in Turkey.","id":2070,"createdAt":"2026-01-23T12:20:09.094Z","updatedAt":"2026-01-23T18:00:08.686Z"}]