[{"crypto_id":"52","crypto_name":"XRP","news_id":"6963027442802783546e5b8c","news_date":"2026-01-11T03:32:49.021Z","news_title":"Senate Banking Committee Sets January 15 Markup for CLARITY Act","news_subtitle":"The Senate Banking Committee has officially scheduled the markup for the Digital Asset Market Clarity Act of 2025 on January 15 at 10 AM ET [...]","id":1569,"createdAt":"2026-01-11T02:10:07.441Z","updatedAt":"2026-01-11T18:00:08.559Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69627a83428027835405031f","news_date":"2026-01-11T03:32:49.021Z","news_title":"XRP Structure Tightens. Here’s What Traders Should Expect","news_subtitle":"XRP is exhibiting price behavior that suggests more than random volatility. Instead of chaotic swings, the token’s recent movement points to a structural realignment where support and resistance compress into a well‑defined range. Traders interpret this kind of compression as a c...","id":1577,"createdAt":"2026-01-11T07:30:08.178Z","updatedAt":"2026-01-11T16:40:07.671Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6963385f4280278354b016da","news_date":"2026-01-11T05:42:50.808Z","news_title":"Ripple Secures UK FCA Registration to Offer Limited Crypto Services and Expand Payment Operations","news_subtitle":"Ripple is now registered with the UK FCA to offer limited crypto and payment services. The FCA approval boosts XRP use in cross-border payments and supports global expansion. UK registration strengthens Ripple’s partnerships and attracts institutional investment into crypto. The ...","id":1579,"createdAt":"2026-01-11T08:30:07.664Z","updatedAt":"2026-01-11T18:00:09.091Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69636beb4280278354cce9ae","news_date":"2026-01-11T09:22:47.963Z","news_title":"Ripple Secures UK FCA Authorisation","news_subtitle":"Ripple has received UK FCA authorisation enabling Ripple Markets UK Ltd to operate as an Electronic Money Institution and Cryptoasset firm. This expands Ripple’s licensing portfolio, enhancing cross-border payments in the UK. Read original article on aicryptocore.com","id":1581,"createdAt":"2026-01-11T09:50:04.426Z","updatedAt":"2026-01-11T18:00:07.606Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69636bec4280278354ccea40","news_date":"2026-01-11T09:22:47.963Z","news_title":"Ripple Secures FCA Approval for UK Subsidiary Operations","news_subtitle":"Ripple's UK subsidiary gains FCA approval, expanding its cryptocurrency operations under anti-money laundering regulations. Read original article on coincu.com","id":1582,"createdAt":"2026-01-11T09:50:04.583Z","updatedAt":"2026-01-11T18:00:08.150Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6962d327428027835454157f","news_date":"2026-01-10T22:22:49.198Z","news_title":"John Deaton Says Ripple’s $40B Rise Leaves Even Critics With No Choice But Respect","news_subtitle":"Ripple reached a $40 b valuation despite years of regulatory pressure Legal clarity strengthened Ripple’s credibility among institutions and market observers Strategic acquisitions and licensing fueled growth critics can no longer ignore Ripple has moved back into market focus af...","id":1591,"createdAt":"2026-01-11T16:50:08.071Z","updatedAt":"2026-01-11T17:20:08.683Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6963da1442802783540b79fa","news_date":"2026-01-11T17:12:48.531Z","news_title":"Morning Crypto Report: 1.16% of XRP Market Cap Disappears in ETFs, New Shiba Inu Trillionaire Absorbs 1,923,043,775,311 SHIB on Coinbase, 'P...","news_subtitle":"In this Sunday report, XRP ETFs hit $1.47 billion, a SHIB mega-whale drains Coinbase Prime dry and Vitalik Buterin sketches what a proper decentralized stablecoin should actually look like.","id":1594,"createdAt":"2026-01-11T17:30:08.114Z","updatedAt":"2026-01-11T18:00:09.485Z"}]