[{"crypto_id":"52","crypto_name":"XRP","news_id":"6973dfa94280278354a30552","news_date":"2026-01-23T20:52:54.905Z","news_title":"Ripple Deepens Turkey Push With Renewed Garanti BBVA Kripto Custody Deal","news_subtitle":"Ripple is strengthening its presence in one of the world’s most active crypto markets after renewing its institutional custody partnership with Garanti BBVA Kripto, the digital asset arm of Garanti BBVA. The updated agreement confirms that Garanti BBVA Kripto will continue relyin...","id":2087,"createdAt":"2026-01-24T00:20:08.438Z","updatedAt":"2026-01-24T18:00:08.383Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69738ffa4280278354479849","news_date":"2026-01-23T20:02:53.370Z","news_title":"Ripple Strengthens Institutional XRP Access in Turkey Through Renewed Custody Deal","news_subtitle":"The move strengthens secure, regulated access to XRP for institutional clients and underscores Ripple’s strategy of expanding in high-growth, crypto-active […] The post Ripple Strengthens Institutional XRP Access in Turkey Through Renewed Custody Deal appeared first on Coindoo.","id":2094,"createdAt":"2026-01-24T05:00:08.294Z","updatedAt":"2026-01-24T15:20:08.380Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69737188428027835430d3b1","news_date":"2026-01-23T17:23:04.148Z","news_title":"Analyst: ‘The Next Major XRP Move Comes Today’ – Here’s Why","news_subtitle":"XRP breaks resistance, signaling potential rally toward $2.50 target. Crypto analyst predicts major XRP move, eyes bullish momentum today. Breakout above trendline sets stage for XRP’s next big move. Crypto market expert Maxi, known for his insightful analysis, recently pointed t...","id":2095,"createdAt":"2026-01-24T05:00:08.696Z","updatedAt":"2026-01-24T13:40:09.393Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"697452824280278354f7df7f","news_date":"2026-01-24T05:02:55.561Z","news_title":"XRP Faces Extreme Fear, But Accumulation Points to Potential Reversal","news_subtitle":"Key Insights: XRP sentiment has plunged into extreme fear, indicating a potential turning point for price action in the near future. Despite negative sentiment, spot accumulation continues, suggesting long-term holders see value at current price levels. A descending wedge pattern...","id":2096,"createdAt":"2026-01-24T05:20:08.398Z","updatedAt":"2026-01-24T18:00:08.785Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69749b4842802783544f00a4","news_date":"2026-01-24T10:12:53.867Z","news_title":"India Bans Monero, Zcash, Dash Over Money-Laundering Fears","news_subtitle":"India's financial regulator orders crypto exchanges to delist Monero, Zcash and Dash over anonymity concerns.","id":2105,"createdAt":"2026-01-24T10:30:07.380Z","updatedAt":"2026-01-24T18:00:07.977Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6973a5114280278354583133","news_date":"2026-01-23T17:32:53.611Z","news_title":"DXC Technology and Ripple Partner for Digital Asset Custody","news_subtitle":"DXC partners with Ripple to integrate digital asset custody and RLUSD in their Hogan platform. Kanalcoin is the original publisher of DXC Technology and Ripple Partner for Digital Asset Custody.","id":2108,"createdAt":"2026-01-24T13:50:08.158Z","updatedAt":"2026-01-24T14:20:07.675Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6974d368428027835477fe17","news_date":"2026-01-24T14:12:52.479Z","news_title":"Self-Taught Analyst to XRP Holders: Take Note of This Trend of Developments","news_subtitle":"Market cycles often blur the line between noise and signal, but certain periods reveal a clearer narrative for those paying attention. Over the past year, Ripple has advanced through regulatory, institutional, and infrastructure milestones that collectively reshaped how XRP fits ...","id":2110,"createdAt":"2026-01-24T14:30:06.592Z","updatedAt":"2026-01-24T18:00:07.560Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6974e179428027835481ab49","news_date":"2026-01-24T15:12:55.819Z","news_title":"Japan Set to Recognize XRP as a Regulated Financial Asset","news_subtitle":"Japan plans to classify XRP as a regulated financial product under its updated crypto laws, signaling tighter oversight and clearer rules for digital assets.","id":2116,"createdAt":"2026-01-24T15:30:06.322Z","updatedAt":"2026-01-24T18:00:07.155Z"}]