[{"crypto_id":"52","crypto_name":"XRP","news_id":"6966867742802783543ff21f","news_date":"2026-01-13T17:52:50.749Z","news_title":"XRP May Soon Be Legally Untouchable by SEC, Thanks to This Doc","news_subtitle":"XRP may officially shed its \"security\" status if the Clarity Act passes with its current ETF clause, marking a turning point after years of SEC pressure and Ripple's legal fight.","id":1683,"createdAt":"2026-01-13T18:10:07.379Z","updatedAt":"2026-01-14T18:00:05.684Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696769cc4280278354da35c6","news_date":"2026-01-14T10:02:48.993Z","news_title":"Ripple Chairman Confirms Plan to Replace SWIFT and XRP Role","news_subtitle":"Ripple aims to replace SWIFT, creating a seamless global payment system. XRP will provide on-demand liquidity, revolutionizing cross-border payment efficiency. ILP integration connects providers worldwide, enhancing global financial transaction speed. Ripple’s ambitious plan to o...","id":1705,"createdAt":"2026-01-14T10:20:08.326Z","updatedAt":"2026-01-14T18:00:05.949Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696783924280278354e72182","news_date":"2026-01-14T14:32:49.287Z","news_title":"XRP News Today: Ripple Expands in Europe with Luxembourg EMI License Approval","news_subtitle":"Ripple has taken another important step in expanding its presence in Europe after receiving preliminary approval for an Electronic Money Institution (EMI) license from Luxembourg’s financial regulator. The approval was granted by the Commission de Surveillance du Secteur Financie...","id":1706,"createdAt":"2026-01-14T12:10:09.030Z","updatedAt":"2026-01-14T18:00:05.383Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6967ab6f4280278354fe6cb3","news_date":"2026-01-14T14:42:49.727Z","news_title":"'No Giveaways': Urgent Warning Issued to XRP Community Amid Major Scam Threat","news_subtitle":"Crucial warning issued to XRP holders as full-blown scam attack becomes visible across the board.","id":1719,"createdAt":"2026-01-14T15:20:05.940Z","updatedAt":"2026-01-14T18:00:06.219Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6967a47d4280278354fa82f7","news_date":"2026-01-14T14:13:14.098Z","news_title":"Bitcoin and gold face off as Bitwise backs Dalio’s 15% hedge thesis","news_subtitle":"Bitwise finds gold cushions 60/40 portfolios in drawdowns while Bitcoin drives outsized recovery gains, with a combined 15% allocation lifting Sharpe to 0.679 versus 0.23. Asset management firm Bitwise has released analysis indicating that gold and Bitcoin perform distinct functi...","id":1721,"createdAt":"2026-01-14T15:40:06.753Z","updatedAt":"2026-01-14T17:40:06.061Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696770d24280278354ddad8e","news_date":"2026-01-14T10:32:47.829Z","news_title":"CLARITY Act May Put XRP in the Same Legal League as Bitcoin & Ethereum","news_subtitle":"If passed, the CLARITY Act would legally group XRP with Bitcoin and Ethereum.","id":1724,"createdAt":"2026-01-14T16:10:06.556Z","updatedAt":"2026-01-14T18:00:06.511Z"}]