[{"crypto_id":"52","crypto_name":"XRP","news_id":"696c44004280278354667713","news_date":"2026-01-18T02:22:53.466Z","news_title":"Axiom Protocol Launches Prediction Market on XRPL","news_subtitle":"Axiom Protocol is launching a prediction market on the XRP Ledger, targeting XRP and RLUSD holders. This initiative enhances market dynamics without introducing new tokens. Read original article on aicryptocore.com","id":1860,"createdAt":"2026-01-18T02:40:06.416Z","updatedAt":"2026-01-18T18:00:06.536Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696ca8c94280278354bce51b","news_date":"2026-01-18T09:32:53.543Z","news_title":"Clarity Act Approval Could Impact Crypto Regulation and Prices","news_subtitle":"The Clarity Act's approval could reshape crypto regulation, potentially affecting Bitcoin, Ethereum, and XRP prices. Read original article on theccpress.com","id":1865,"createdAt":"2026-01-18T09:50:06.044Z","updatedAt":"2026-01-18T18:00:06.228Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696cafd14280278354c0a4e3","news_date":"2026-01-18T10:02:53.448Z","news_title":"Steak n Shake Integrates Bitcoin Payments Into Treasury Strategy","news_subtitle":"Steak n Shake redirects bitcoin payments into treasury while cutting transaction costs nationwide Customer dining activity now fuels bitcoin reserves instead of traditional cash conversion Restaurant chain adopts payment driven crypto strategy without relying on capital markets S...","id":1866,"createdAt":"2026-01-18T10:20:06.759Z","updatedAt":"2026-01-18T18:00:06.871Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696cc4e94280278354ca7114","news_date":"2026-01-18T16:33:00.073Z","news_title":"XRP Whales Take Control as On-Chain Data Signals Buy-Dominant Phase","news_subtitle":"According to a report shared by CryptoQuant, recent on-chain data from the XRP Ledger points to a clear shift in market structure, driven primarily by large participants rather than retail flows. The analysis is based only on spot market metrics visible in the uploaded charts, wi...","id":1869,"createdAt":"2026-01-18T11:50:07.049Z","updatedAt":"2026-01-18T18:00:07.191Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696d068e4280278354ed5ee7","news_date":"2026-01-18T16:13:00.465Z","news_title":"Evernorth Simplifies Institutional Access to XRP, Here’s The Latest","news_subtitle":"Evernorth, an XRP-focused treasury company, has confirmed plans to pursue a public listing in the first quarter of 2026 as part of a broader strategy to simplify institutional exposure to the digital asset. The firm believes that improving regulatory clarity, particularly in the ...","id":1874,"createdAt":"2026-01-18T16:30:07.155Z","updatedAt":"2026-01-18T17:30:06.367Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696cbb874280278354c61a9a","news_date":"2026-01-18T10:52:53.805Z","news_title":"XRP to $12.50? Standard Chartered’s Bet Gains Steam as Spot ETFs Steal the Spotlight","news_subtitle":"Standard Chartered forecasts XRP could surge to $12.50 by 2028, driven by the growing prominence of spot XRP ETFs, which are expected to unlock institutional demand and accelerate mainstream adoption.","id":1876,"createdAt":"2026-01-18T17:40:07.372Z","updatedAt":"2026-01-18T18:00:07.505Z"}]