[{"crypto_id":"52","crypto_name":"XRP","news_id":"695fc4c2428027835499895b","news_date":"2026-01-09T10:22:48.636Z","news_title":"XRP News: Ripple Explores Amazon AI to Upgrade the XRP Ledger","news_subtitle":"Ripple is testing a possible partnership with Amazon Web Services (AWS) that could improve the speed and scalability of the XRP Ledger (XRPL). The company is reportedly exploring Amazon Bedrock, AWS’s AI platform, to better analyze and manage XRPL data. If implemented, this could...","id":1464,"createdAt":"2026-01-08T15:10:06.019Z","updatedAt":"2026-01-09T12:40:07.656Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"695fd9de4280278354be7632","news_date":"2026-01-08T20:22:48.833Z","news_title":"Ripple Taps Amazon AI to Cut XRP Ledger Issue Resolution to Minutes","news_subtitle":"People familiar with the effort say the initiative centers on applying Amazon Bedrock’s AI models to XRPL system logs, with […] The post Ripple Taps Amazon AI to Cut XRP Ledger Issue Resolution to Minutes appeared first on Coindoo.","id":1466,"createdAt":"2026-01-08T16:40:06.124Z","updatedAt":"2026-01-09T16:50:06.817Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"696022824280278354023690","news_date":"2026-01-08T21:32:48.992Z","news_title":"US Spot XRP ETFs Record Their First Outflows Since November Launch","news_subtitle":"XRP News Spot XRP exchange-traded funds reported their first day of net outflows on Wednesday, ending a 36-day streak without withdrawals. The five XRP funds saw a combined $40.8 million exit, with 21Shares' TOXR accounting for $47.25 million in outflows. Canary, Bitwise, and Gra...","id":1481,"createdAt":"2026-01-08T21:50:05.723Z","updatedAt":"2026-01-09T18:00:07.917Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6960b8864280278354b80d45","news_date":"2026-01-09T08:12:50.708Z","news_title":"XRP Infrastructure Gets Major Boost: Evernorth and Doppler Finance Forge Powerful Institutional Partnership","news_subtitle":"BitcoinWorld XRP Infrastructure Gets Major Boost: Evernorth and Doppler Finance Forge Powerful Institutional Partnership In a significant move for enterprise blockchain adoption, Evernorth—a crypto venture with strategic backing from Ripple—has announced a pivotal partnership wit...","id":1498,"createdAt":"2026-01-09T08:30:07.586Z","updatedAt":"2026-01-09T18:00:09.187Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6960e5104280278354d9487e","news_date":"2026-01-09T11:22:49.520Z","news_title":"The Ripple and Amazon Collaboration That Got the XRP Army Talking – What You Should Know","news_subtitle":"AI-powered log analysis to transform XRP Ledger operations, enhancing efficiency. Amazon Bedrock streamlines Ripple’s decentralized network, drastically reducing troubleshooting time. Graph-based system optimizes code relationships, speeding up query processing. A detailed post o...","id":1501,"createdAt":"2026-01-09T11:40:07.073Z","updatedAt":"2026-01-09T18:00:08.307Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6960f5744280278354e26bb9","news_date":"2026-01-09T12:32:49.313Z","news_title":"Senior Executive At Ripple Drops Major XRP Confirmation","news_subtitle":"Reece Merrick, a Senior Executive Officer at Ripple, recently addressed an important concern from the XRP community. The community member questioned whether XRP still needed legislation such as the Clarity Act to succeed when court rulings have already confirmed XRP’s legal statu...","id":1506,"createdAt":"2026-01-09T12:50:08.104Z","updatedAt":"2026-01-09T18:00:08.698Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6960fc7b4280278354e60043","news_date":"2026-01-09T13:02:48.119Z","news_title":"Ripple Secures Crucial FCA Registration, Unlocking UK Crypto Market Access","news_subtitle":"BitcoinWorld Ripple Secures Crucial FCA Registration, Unlocking UK Crypto Market Access In a significant regulatory milestone, Ripple has officially completed its business registration with the United Kingdom’s Financial Conduct Authority (FCA), London, as of late 2024. This pivo...","id":1513,"createdAt":"2026-01-09T17:00:08.765Z","updatedAt":"2026-01-09T18:00:09.572Z"}]