[{"crypto_id":"52","crypto_name":"XRP","news_id":"6970e1444280278354dbc288","news_date":"2026-01-21T17:33:15.057Z","news_title":"New Attack on Linux Exploits Trusted Snap Store Apps to Steal Crypto Recovery Phrases","news_subtitle":"Linux Snap Store apps hijacked to steal crypto recovery phrases. Attackers exploit expired domains to distribute malicious crypto wallet updates. Crypto wallets impersonated to exfiltrate recovery phrases and drain funds. According to a recent warning from blockchain security com...","id":2000,"createdAt":"2026-01-21T14:40:06.898Z","updatedAt":"2026-01-22T10:30:07.621Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"697129eb4280278354341bdb","news_date":"2026-01-22T16:02:56.546Z","news_title":"Ripple Partners with DXC to Enhance Banking Technology","news_subtitle":"Ripple and DXC Technology partner to integrate blockchain solutions into banking systems. Read original article on defiliban.com","id":2013,"createdAt":"2026-01-21T19:50:06.327Z","updatedAt":"2026-01-22T18:00:07.639Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69714159428027835444d0a5","news_date":"2026-01-21T21:12:53.984Z","news_title":"Vitalik Buterin Proposes a Way to Strengthen Ethereum Staking","news_subtitle":"Vitalik Buterin has introduced a new proposal on the Ethereum Research forum outlining a “native DVT” (Distributed Validator Technology) design aimed at improving staking security, decentralization, and fault tolerance at the protocol level. Unlike today’s implementations, which ...","id":2017,"createdAt":"2026-01-21T21:30:06.723Z","updatedAt":"2026-01-22T18:00:06.885Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6971c49b4280278354bbc87c","news_date":"2026-01-22T10:52:53.622Z","news_title":"Ripple Announces Major New Integration With Core Banking Systems","news_subtitle":"This marks a more pragmatic phase of blockchain adoption – one focused on integration rather than disruption. Key Takeaways Ripple […] The post Ripple Announces Major New Integration With Core Banking Systems appeared first on Coindoo.","id":2023,"createdAt":"2026-01-22T06:50:06.358Z","updatedAt":"2026-01-22T18:00:06.096Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"6971fa824280278354e4c2e5","news_date":"2026-01-22T16:02:56.546Z","news_title":"Ripple and DXC Partner to Integrate XRP Payments Directly Into Global Core Banking Systems","news_subtitle":"Ripple and DXC connect blockchain payments to core banking systems used by millions of accounts worldwide today. Banks can use XRP and RLUSD payments without changing existing core infrastructure or replacing legacy systems. The partnership brings digital asset custody and tokeni...","id":2028,"createdAt":"2026-01-22T10:40:07.016Z","updatedAt":"2026-01-22T18:00:06.505Z"},{"crypto_id":"52","crypto_name":"XRP","news_id":"69720f9c4280278354f5d869","news_date":"2026-01-22T16:02:56.546Z","news_title":"Big News: XRP Is Entering Global Banks With New Ripple and DXC Partnership – Details","news_subtitle":"XRP seamlessly integrates into banks’ core systems with Ripple and DXC. Ripple and DXC bring secure, scalable digital asset solutions to banks. New partnership advances XRP adoption, enhancing global cross-border payment solutions. Ripple and DXC Technology (NYSE: DXC) have joine...","id":2032,"createdAt":"2026-01-22T12:10:08.372Z","updatedAt":"2026-01-22T18:00:07.259Z"}]